# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

MSG_COMPOSITE_COMPONENT_SOURCE=\u30bd\u30fc\u30b9:
MSG_COMPOSITE_COMPONENT_DISPLAYNAME=\u8868\u793a\u540d:
MSG_COMPOSITE_COMPONENT_SHORTDESCRIPTION=\u7c21\u5358\u306a\u8aac\u660e:
MSG_TAG_ATTRS=\u30bf\u30b0\u306e\u5c5e\u6027
MSG_NO_TAG_ATTRS=\u3053\u306e\u30bf\u30b0\u306f\u3069\u306e\u5c5e\u6027\u3082\u5ba3\u8a00\u3057\u307e\u305b\u3093
MSG_NO_DESCRIPTOR=\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf\u306f\u3042\u308a\u307e\u305b\u3093
MSG_ParsingFaceletsLibraries=Facelets\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u30b9\u30ad\u30e3\u30f3\u3057\u3066\u3044\u307e\u3059...

HELP_id=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u8b58\u5225\u5b50
HELP_parent=\u3053\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u5b50\u307e\u305f\u306f\u30d5\u30a1\u30bb\u30c3\u30c8\u3067\u3042\u308b\u5bfe\u8c61\u306e\u89aa\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3002
HELP_rendered=true\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u30ea\u30af\u30a8\u30b9\u30c8\u51e6\u7406\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u306e\u3059\u3079\u3066\u306e\u30d5\u30a7\u30fc\u30ba\u4e2d\u306b\u51e6\u7406\u3059\u308b\u3053\u3068\u3092\u793a\u3059\u30d5\u30e9\u30b0\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f"true"\u3067\u3059\u3002
HELP_rendererType=\u30ec\u30f3\u30c0\u30e9\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9(\u51e6\u7406\u5bfe\u8c61\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u30fb\u30c4\u30ea\u30fc\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305fRenderKit\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30ec\u30f3\u30c0\u30e9\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30bb\u30c3\u30c8\u306b\u542b\u307e\u308c\u3066\u3044\u308b)\u306e\u8b58\u5225\u5b50\u3002\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u51e6\u7406\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u4e2d\u306e\u3044\u304f\u3064\u304b\u306e\u64cd\u4f5c(decode\u3084encodeXxx\u30e1\u30bd\u30c3\u30c9\u30fb\u30d5\u30a1\u30df\u30ea\u306a\u3069)\u304c\u3053\u306e\u30bf\u30a4\u30d7\u306e\u30ec\u30f3\u30c0\u30e9\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u59d4\u8b72\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u308c\u3089\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u3053\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u76f4\u63a5\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
HELP_rendersChildren=true\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u305d\u306e\u3059\u3079\u3066\u306e\u5b50\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u63cf\u753b\u3092\u7ba1\u7406\u3059\u308b(\u3057\u305f\u304c\u3063\u3066\u3001JSF\u306e\u5b9f\u88c5\u306f\u305d\u308c\u3089\u306e\u63cf\u753b\u3092\u8a66\u307f\u3066\u306f\u3044\u3051\u306a\u3044)\u3053\u3068\u3092\u793a\u3059\u30d5\u30e9\u30b0\u3002UIComponentBase\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5b9f\u88c5\u306f\u3001\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30ec\u30f3\u30c0\u30e9\u304c\u5b58\u5728\u3059\u308b\u5834\u5408\u306f\u3053\u306e\u8a2d\u5b9a\u3092\u305d\u306e\u30ec\u30f3\u30c0\u30e9\u306b\u59d4\u8b72\u3057\u3001\u305d\u308c\u4ee5\u5916\u306e\u5834\u5408\u306ffalse\u3092\u8fd4\u3057\u307e\u3059\u3002
HELP_transient=true\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u30fb\u30c4\u30ea\u30fc\u306e\u72b6\u614b\u306b\u542b\u3081\u3066\u306f\u3044\u3051\u306a\u3044\u3053\u3068\u3092\u793a\u3059\u30d5\u30e9\u30b0\u3002UIComponentBase\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5b9f\u88c5\u306f\u3001\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u5bfe\u3057\u3066false\u3092\u8fd4\u3057\u307e\u3059\u3002
HELP_class=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306eCSS\u30af\u30e9\u30b9\u540d
HELP_binding=JSF\u4ed5\u69d8\u306b\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u3088\u3046\u306b\u3001\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u30d0\u30c3\u30ad\u30f3\u30b0Bean\u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002

