OpenIDE-Module-Display-Category=Base de dades
OpenIDE-Module-Long-Description=Aquest m\u00f2dul proporciona caracter\u00edstiques de suport a bases de dades espec\u00edfiques MYSQL per a NetBeans.  Aquest inclou la gesti\u00f3 b\u00e0sica d'un servidor local i altres funcionalitats que nosaltres creiem oportunes.
OpenIDE-Module-Name=Suport base de dades MySQL
OpenIDE-Module-Short-Description=Proporciona suport espec\u00edfic per a bases de dades MySQL

#Installer
MSG_RegisterMySQL=Cercar per a un servidor local de bases de dades MySQL

#ServerNode
# Run states
DISCONNECTED=(desconnectat)
CONNECTED=
CONFIGERR=(error configuraci\u00f3)

LBL_ServerDisplayName=Servidor MySQL a {0} [{1}] {2}
LBL_ServerShortDescription=Inst\u00e0ncia de servidor MySQL a {0} [usuari {1}] {2}
LBL_ServerShortDescriptionError=Error amb la configuraci\u00f3 MySQL: {0}

MSG_UnableToGetDatabaseList=No es pot obtindre el llistat de bases de dades del servidor MySQL

#DatabaseNode
LBL_DBNodeShortDescription=Bases de dades MySQL {0}

#DatabaseUtils
MSG_JDBCDriverNotRegistered=El controlador JDBC per MySQL no est\u00e0 registrat
MSG_UnableToLoadJDBCDriver=No es pot carregar el controlador JDBC
MSG_NotEnoughInformationToConnect=No hi ha suficient informaci\u00f3 per a connectar amb el servidor MySQL.  Comproveu les propietats de MySQL i torneu-ho a intentar

#PropertiesAction
LBL_PropertiesAction=Propietats...

#RegisterServerAction
LBL_RegisterServerAction=Registrar servidor MySQL...

#RefreshServerAction
LBL_RefreshServerAction=Refrescar

#CreateDatabaseAction
LBL_CreateDatabaseAction=Crear base de dades...

#DeleteDatabaseAction
MSG_ErrorDeletingDatabase=No es pot eliminar la base de dades {0}

#ConnectAction
LBL_ConnectAction=Connectar...

#Utils
MSG_SeeErrorLog=Vegeu l'error per a m\u00e9s detalls

#DatabaseUtils
ERR_MySQLCommunicationFailure=No es pot comunicar amb el servidor MySQL.  Comproveu que aquest estigui executant-se i que el port estigui establert correctament.
MSG_ErrorDialogTitle=Error

MSG_ConnectingToServer=Intentant de connectar amb el servidor MySQL
MSG_ReconnectingToServer=Reconnectant amb el servidor MySQL
MSG_UnableToConnect=No es pot connectar al servidor MySQL.  Comproveu les prefer\u00e8ncies i propietats i torneu-ho a intentar.

#ConnectServerAction
LBL_ConnectServerAction=Connectar

#DisconnectServerAction
LBL_DisconnectServerAction=Desconnectar

#StartAction
LBL_StartAction=Iniciar
MSG_UnableToStartServer=No es pot iniciar el servidor MySQL  Comproveu les vostres prefer\u00e8ncies i torneu-ho a intentar.
MSG_NoStopPath=No s'ha establert el cam\u00ed a la comanda per a iniciar el servidor MySQL.  Voleu editar les propietats del servidor per a establir aquest cam\u00ed?

#StopAction
LBL_StopAction=Aturar
MSG_ServerStopped=El servidor ha estat aturat
MSG_UnableToStopServer=Error mentre s'estava aturant el servidor MySQL
MSG_NoStartPath=No s'ha establert el cam\u00ed a la comanda per a iniciar el servidor MySQL.  Voleu editar les propietats del servidor per a establir aquest cam\u00ed?

#AdministerAction
LBL_AdministerAction=Executar l'eina d'administraci\u00f3
MSG_NoAdminPath=No s'ha establer el cam\u00ed/URL a l'eina d'administraci\u00f3 MySQL.  Voleu editar les propietats del servidor per a establir aquest cam\u00ed?
MSG_ErrorStartingAdminTool=Hi ha hagut un error iniciant l'eina d'administraci\u00f3

#ServerInstance
MSG_NoSuchSample=El nom {0} no ha estat reconegut al nom de la base de dades de l''exemple.
MSG_ErrorLoadingSampleSQL=No es pot carregar el SQL per l''exemple {0}: {1}
MSG_ErrorExecutingSampleSQL=Error executant la comanda SQL per l''exemple {0}: {1}
MSG_AdminCommandNotSet=La comanda d'administraci\u00f3 no est\u00e0 establerta.  Utilitzeu el di\u00e0leg de propietats MySQL per a establir un cam\u00ed.
MSG_InvalidAdminCommand=La comanda d''administraci\u00f3 {0} no \u00e9s un fitxer o URL v\u00e0lid.  Trieu propietats i seleccioneu la pestanya d'administraci\u00f3 per ajustar el cam\u00ed.
MSG_InvalidStartCommand=La comanda d''inici {0} no \u00e9s un fitxer v\u00e0lid.  Trieu propietats i seleccioneu la pestanya d'administraci\u00f3 per ajustar el cam\u00ed.
MSG_InvalidStopCommand=La comanda d''aturar {0} no \u00e9s un fitxer v\u00e0lid.  Trieu propietats i seleccioneu la pestanya d'administraci\u00f3 per ajustar el cam\u00ed.
LBL_MySQLOutputTab=Comandes servidor MySQL
LBL_StoppingMySQLServer=Aturant servidor MySQL

