# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

OpenIDE-Module-Display-Category=Web Services
OpenIDE-Module-Long-Description=O m\u00f3dulo permite o registro no IDE de Web services conhecidos e ajuda na cria\u00e7\u00e3o pr\u00e9via de artefatos necess\u00e1rios para consumo por tipos diferentes de clientes.  \n\nO m\u00f3dulo exp\u00f5e a API e a SPI do lado do consumidor para participar na prepara\u00e7\u00e3o de artefatos e expor as informa\u00e7\u00f5es necess\u00e1rias ao c\u00f3digo de uso do servi\u00e7o.
OpenIDE-Module-Name=Gerenciador dos Web Services
OpenIDE-Module-Short-Description=Registro no IDE dos Web services

WS_MODELER_ERROR=Erro ao gerar o modelo JAX-WS do Web service especificado. Causa:
WS_NO_SOAP_PORTS_ERROR=N\u00e3o havia portas SOAP no WSDL.  O cliente do Web service n\u00e3o ser\u00e1 gerado.
WSDL_COPY_ERROR=Erro ao recuperar o arquivo WSDL.
WSDL_ALREADY_EXISTS_ERROR=O arquivo WSDL especificado j\u00e1 existe.  Use uma c\u00f3pia local com um nome de arquivo exclusivo para criar um cliente para esse Web service.
WS_ALREADY_EXISTS_ERROR=J\u00e1 existe outro Web service com o mesmo nome:
WS_WSDL_XML_ERROR=N\u00e3o \u00e9 poss\u00edvel recuperar o arquivo WSDL.  Verifique as defini\u00e7\u00f5es de proxy do IDE em Ferramentas->Op\u00e7\u00f5es e a sa\u00edda do Recuperador em Janela ->Sa\u00edda.  Atualize o n\u00f3 do Web service quando o problema tiver sido corrigido.
WS_NO_METHODS_ERROR=A defini\u00e7\u00e3o do WSDL n\u00e3o cont\u00e9m opera\u00e7\u00f5es.  N\u00e3o ser\u00e1 criado nenhum cliente de Web services.

MSG_BadContent=Conte\u00fado inv\u00e1lido no arquivo do descritor do componente: {0}
JAX_WS_MODELER_ERROR=Houve erro ao gerar o modelo JAX-WS do Web service especificado.\n\nCausa:\n{0}
JAX_WS_MODEL_CREATION_ERROR=O utilit\u00e1rio Wsimport falhou ao gerar o modelo JAX-WS. Raz\u00e3o:\n{0}
JAX_RPC_MODELER_ERROR=O IDE n\u00e3o pode criar o modelo java deste arquivo wsdl.\nPoss\u00edveis raz\u00f5es:\n- o estilo de vincula\u00e7\u00e3o usado em wsdl \u00e9 RPC/Encoded e o plug-in JAX-RPC\n que suporta este estilo de vincula\u00e7\u00e3o n\u00e3o est\u00e1 instalado\n- o IDE n\u00e3o pode localizar o provedor de modelo wsdl2java deste wsdl

