AttachDialog_CopiedToClipboard=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u30af\u30ea\u30c3\u30d7\u30dc\u30fc\u30c9\u306b\u30b3\u30d4\u30fc\u3055\u308c\u307e\u3057\u305f
AttachDialog_RemotePackDialogCaption=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u306e\u9078\u629e
AttachDialog_RemotePackSaved=\u30ea\u30e2\u30fc\u30c8\u30fb\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30d1\u30c3\u30af\u304c{0}\u306b\u4fdd\u5b58\u3055\u308c\u307e\u3057\u305f
AttachDialog_Steps_AddParameters=\u6b21\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8d77\u52d5\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u8ffd\u52a0\u3057\u307e\u3059
AttachDialog_Steps_CopyToClipboard=\u30af\u30ea\u30c3\u30d7\u30dc\u30fc\u30c9\u306b\u30b3\u30d4\u30fc
AttachDialog_Steps_CreateRemotePack=\u307e\u3060\u3053\u308c\u3092\u884c\u3063\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u9078\u629e\u3057\u305fOS\u304a\u3088\u3073JVM\u306e<a href={0}>\u30ea\u30e2\u30fc\u30c8\u30fb\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30d1\u30c3\u30af\u3092\u4f5c\u6210</a>\u3057\u3066\u3001\u30ea\u30e2\u30fc\u30c8\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u3057\u307e\u3059\u3002\u30ea\u30e2\u30fc\u30c8\u30fb\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30d1\u30c3\u30af\u306e\u30eb\u30fc\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306f{1}\u3068\u8868\u3055\u308c\u307e\u3059\u3002
AttachDialog_Steps_EnsureCorrectJava=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c{0}\u3092\u4f7f\u7528\u3057\u3066\u5b9f\u884c\u3059\u308b\u3088\u3046\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002
AttachDialog_Steps_Java5=Java 5
AttachDialog_Steps_Java5_32b=Java 5\u300132\u30d3\u30c3\u30c8
AttachDialog_Steps_Java5_64b=Java 5\u300164\u30d3\u30c3\u30c8
AttachDialog_Steps_Java6=Java 6+
AttachDialog_Steps_Java6_32b=Java 6+\u300132\u30d3\u30c3\u30c8
AttachDialog_Steps_Java6_64b=Java 6+\u300164\u30d3\u30c3\u30c8
AttachDialog_Steps_JavaCvm=CVM
AttachDialog_Steps_JavaSeEmbedded=Java SE Embedded
AttachDialog_Steps_MakeSureStarted=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30e6\u30fc\u30b6\u30fc{0}\u306b\u3088\u3063\u3066\u8d77\u52d5\u3055\u308c\u3001Java 6+\u3092\u4f7f\u7528\u3057\u3066\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002
AttachDialog_Steps_RunCalibrateScript=\u30ea\u30e2\u30fc\u30c8\u30fb\u30b7\u30b9\u30c6\u30e0\u3067\u307e\u3060\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u3092\u5b9f\u884c\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u307e\u305a{0}\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5b9f\u884c\u3057\u3066\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u3092\u8abf\u6574\u3057\u307e\u3059\u3002
AttachDialog_Steps_StartApplication=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u8d77\u52d5\u3057\u307e\u3059\u3002\u30d7\u30ed\u30bb\u30b9\u306f\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u304c\u63a5\u7d9a\u3059\u308b\u307e\u3067\u5f85\u6a5f\u3057\u307e\u3059\u3002
AttachDialog_Steps_Step=\u30b9\u30c6\u30c3\u30d7{0}:
AttachDialog_Steps_SubmitSelectProcess=\u3053\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u3092\u9001\u4fe1\u3057\u3001\u300c\u30a2\u30bf\u30c3\u30c1\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30bb\u30b9\u3092\u9078\u629e\u3057\u307e\u3059\u3002
AttachDialog_Steps_SubmitUnblock=\u3053\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u3092\u9001\u4fe1\u3057\u3001\u300c\u30a2\u30bf\u30c3\u30c1\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u63a5\u7d9a\u3057\u5b9f\u884c\u3092\u518d\u958b\u3057\u307e\u3059\u3002
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchTo32BitArch={0}\u30af\u30ea\u30c3\u30af{1}\u3059\u308b\u3068\u300132\u30d3\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u624b\u9806\u304c\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchTo64BitArch={0}\u30af\u30ea\u30c3\u30af{1}\u3059\u308b\u3068\u300164\u30d3\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u624b\u9806\u304c\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchToJava5={0}\u30af\u30ea\u30c3\u30af{1}\u3059\u308b\u3068\u3001JDK 5\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u624b\u9806\u304c\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchToJava6Up={0}\u30af\u30ea\u30c3\u30af{1}\u3059\u308b\u3068\u3001JDK 6+\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u624b\u9806\u304c\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002

