# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

TOOLTIP_HelpBar=A Barra de Ajuda exibe dicas contextuais para o seu design de GUI.

# General messages shown in select mode
select_1=Para alterar o gerenciador de layout de um cont\u00eainer, use o submenu Definir Layout de seu menu de contexto.
select_2=Use o menu de contexto para acessar a\u00e7\u00f5es \u00fateis dispon\u00edveis para os componentes selecionados.
select_3=O bot\u00e3o Visualizar Design (na barra de ferramentas) permite testar o design do form.
select_4=Para selecionar v\u00e1rios componentes em uma \u00e1rea, mantenha a tecla Shift pressionada e arraste o mouse pelos componentes.
select_5=Selecione o n\u00f3-raiz no Navegador para acessar v\u00e1rias defini\u00e7\u00f5es \u00fateis do formul\u00e1rio (em Propriedades).
select_6=A janela Navegador exibe uma hierarquia de \u00e1rvore dos componentes no form aberto.
select_7=Para adicionar um componente v\u00e1rias vezes, selecione-o clicando na paleta e, em seguida, clique com a tecla Shift pressionada na tela de design.
select_8=O item do menu Ferramentas>Paleta>Componentes Swing/AWT permite modificar o conte\u00fado da Paleta.

# Connect mode messages
connectSource=Selecione o componente que ir\u00e1 gerar o evento.
connectTarget=Selecione o componente que receber\u00e1 o evento.
connectWizard=Especifique os detalhes da conex\u00e3o.

# Moving/resizing messages
alignHorizontalLeading=Alinhe com o lado esquerdo do outro componente.
alignHorizontalTrailing=Alinhe com o lado direito do outro componente.
alignVerticalLeading=Alinhe com a parte superior do outro componente.
alignVerticalTrailing=Alinhe com a parte inferior do outro componente.
alignVerticalBaseline=Alinhe na linha de base com outro componente.
nextToContainerHorizontalLeading=Mova at\u00e9 a dist\u00e2ncia preferida da borda esquerda do cont\u00eainer.
nextToContainerHorizontalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida da borda direita do cont\u00eainer.
nextToContainerVerticalLeading=Mova at\u00e9 a dist\u00e2ncia preferida da borda superior do cont\u00eainer.
nextToContainerVerticalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida da parte inferior do cont\u00eainer.
nextToRelatedHorizontalLeading=Mova at\u00e9 a dist\u00e2ncia preferida pequena de um componente \u00e0 esquerda.
nextToUnrelatedHorizontalLeading=Mova at\u00e9 a dist\u00e2ncia preferida m\u00e9dia de um componente \u00e0 esquerda.
nextToSeparateHorizontalLeading=Mova at\u00e9 a dist\u00e2ncia preferida grande de um componente \u00e0 esquerda.
nextToRelatedHorizontalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida pequena de um componente \u00e0 direita.
nextToUnrelatedHorizontalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida m\u00e9dia de um componente \u00e0 direita.
nextToSeparateHorizontalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida grande de um componente \u00e0 direita.
nextToRelatedVerticalLeading=Mova at\u00e9 a dist\u00e2ncia preferida pequena de um componente acima.
nextToUnrelatedVerticalLeading=Mova at\u00e9 a dist\u00e2ncia preferida m\u00e9dia de um componente acima.
nextToSeparateVerticalLeading=Mova at\u00e9 a dist\u00e2ncia preferida grande de um componente acima.
nextToRelatedVerticalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida pequena de um componente abaixo.
nextToUnrelatedVerticalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida m\u00e9dia de um componente abaixo.
nextToSeparateVerticalTrailing=Mova at\u00e9 a dist\u00e2ncia preferida grande de um componente abaixo.
indent=Recue o componente.
generalPosition=Mova o componente para sua posi\u00e7\u00e3o.
generalResizing=Redimensione o componente.
gapResizing=Redimensione a lacuna.
unplacedComponent1=Componente copiado ou inserido - ainda n\u00e3o posicionado no layout.
unplacedComponent2=Mova o componente com o mouse para posicion\u00e1-lo.
unplacedComponents1=Componentes copiados ou inseridos - ainda n\u00e3o posicionados no layout.
unplacedComponents2=Mova os componentes com o mouse para posicion\u00e1-los.

# Clickable layout gaps
layoutGaps=As lacunas entre os componentes podem ser selecionadas e ajustadas com o mouse, ou editadas em uma caixa de di\u00e1logo.
selectedLayoutGaps_1=Para redimensionar a lacuna selecionada com o mouse, arraste o handle de redimensionamento ou utilize o bot\u00e3o de rolagem do mouse.
selectedLayoutGaps_2=Clique duas vezes na lacuna ou chame <i>Editar o Espa\u00e7o do Layout</i> no menu de contexto para mostrar a caixa de di\u00e1logo de personaliza\u00e7\u00e3o.
selectedLayoutGaps_3=Se for dif\u00edcil selecionar uma lacuna, chame a a\u00e7\u00e3o do menu de contexto <i>Editar Espa\u00e7o do Layout</i> em um componente vizinho.
selectedLayoutGaps_4=Ajuste as lacunas em vez de mover os componentes, por exe.: ao arranjar espa\u00e7o para inserir novos componentes.

# Layout managers
absoluteLayout=Coloque o componente em [{0}, {1}].
borderLayout=Coloque o componente na \u00e1rea {0}.
boxLayout=Coloque o componente na posi\u00e7\u00e3o {0}.
flowLayout=Coloque o componente na posi\u00e7\u00e3o {0}.
gridLayout=Coloque o componente na posi\u00e7\u00e3o {0}.
toolbarLayout=Coloque o componente na posi\u00e7\u00e3o {0}.
splitPaneLayout=Coloque o componente na \u00e1rea {0}.
jscrollPaneLayout=Adicione o componente ao JScrollPane.
scrollPaneLayout=Adicione o componente ao ScrollPane.
tabbedPaneLayout=Adicione o componente como uma tab ao JTabbedPane.
cardLayout=Adicione o componente como uma placa ao CardLayout.

# Selection
tabbedPaneEmpty=Adicione um cont\u00eainer ou componente para criar uma tab.
tabbedPaneOne=Adicione o segundo componente/cont\u00eainer para criar a segunda tab.
tabbedPane_1=Clique duas vezes na tab para alterar o texto.
tabbedPane_2=Voc\u00ea pode reordenar as tabs usando a op\u00e7\u00e3o arrastar e soltar do Navegador.
buttonGroup=Use o componente ButtonGroup e a propriedade buttonGroup para criar um grupo de JRadioButtons exclusivos.
designThisContainer=Use a a\u00e7\u00e3o Criar Este Cont\u00eainer do menu de contexto para concentrar-se neste cont\u00eainer.
comboBoxModel=Use a propriedade do modelo para editar o conte\u00fado da JComboBox.
listModel=Use a propriedade do modelo para editar o conte\u00fado da JList.
tableModel=Use a propriedade do modelo para editar o conte\u00fado da JTable.
scrollPaneEmpty=Adicione um componente que vai servir como view do painel de rolagem.
scrollPane=Clique novamente no painel de rolagem para selecionar uma view.

# Other
missingMenubar=N\u00e3o \u00e9 poss\u00edvel adicionar um componente do menu a um form sem uma barra de menus.

