## WorkdirStep.java
BK2024=Dossiers \u00e0 extraire

BK0008=Dossiers
BK0009=OK
BK0010=Rechercher le dossier local

BK2013=Impossible de cr\u00e9er le dossier\: 
BK2014=Vous devez sp\u00e9cifier le r\u00e9pertoire de travail.
BK2015=Vous devez sp\u00e9cifier au moins un dossier du r\u00e9f\u00e9rentiel
BK2016=Impossible d'\u00e9crire dans\: 
BK2017=Le chemin d\u00e9signe un fichier alors qu'un r\u00e9pertoire est attendu
BK2018=Format de r\u00e9vision incorrect

LBL_BrowserMessage=&Choisissez les dossiers que vous voulez extraire du r\u00e9f\u00e9rentiel

ACSD_BrowseFolder = Permet de rechercher le dossier de destination local pour les fichiers extraits.
CTL_Checkout_LocalFolderHint=Sp\u00e9cifie le dossier local dans lequel les dossiers seront extraits.
CTL_Checkout_LocalFolder=Dossier &local\:
CTL_Checkout_Browse2=Parc&ourir...
CTL_Checkout_RepositoryHint=Sp\u00e9cifier le(s) dossier(s) \u00e0 extraire du r\u00e9f\u00e9rentiel Subversion.
CTL_Checkout_RepositoryFolder=&Dossier(s) du r\u00e9f\u00e9rentiel\:
CTL_Checkout_Browse1=Pa&rcourir...
CTL_Checkout_Revision=R\u00e9vision du r\u00e9f\u00e9rentiel\:
CTL_Checkout_Search=Rechercher...
CTL_Checkout_Browse=&Parcourir...
CTL_Checkout_EmptyHint=(vide signifie HEAD du r\u00e9f\u00e9rentiel)
CTL_Checkout_WorkingCopy=Copie de travail\:
CTL_Checkout_CheckoutContentEmpty=Sauter "<selected-folder>" et n'extraire que son contenu
CTL_Checkout_CheckoutContentFolder=Sauter "{0}" et n'extraire que son contenu
CTL_Checkout_Export=Export d'une arborescence propre depuis le r\u00e9f\u00e9rentiel

CTL_Scan_After_Checkout=Re&chercher des projets NetBeans apr\u00e8s le checkout
ACSD_Scan_After_Checkout=Recherche des projets NetBeans dans les fichiers extraits
ASCD_Browse_Repository_Foldres=ouvre un dialogue pour s\u00e9lectionner un ou plusieurs dossiers dans le r\u00e9f\u00e9rentiel Subversion
ASCD_Repository_Folders_to_Checkout=liste (s\u00e9par\u00e9e par des virgules) de dossiers \u00e0 extraire du r\u00e9f\u00e9rentiel Subversion
ASCD_Repository_Revision=num\u00e9ro de r\u00e9vision - version des dossiers \u00e0 extraire
ASCD_Browse_Local_Directory=ouvre un dialogue pour choisir le dossier local dans lequel stocker les dossiers t\u00e9l\u00e9charg\u00e9s
ASCD_Search_Revision_Number=ouvre un dialogue pour choisir un num\u00e9ro de r\u00e9vision
ASCD_Browse_Revision_Number=ouvre un dialogue pour choisir un num\u00e9ro de r\u00e9vision
ASCD_Checkout_only_folder_contents=extrait le contenu du dossier s\u00e9lectionn\u00e9 dans le r\u00e9f\u00e9rentiel, sans cr\u00e9er le dossier lui-m\u00eame
ASCD_Checkout_Export=Exporte une arborescence propre depuis le r\u00e9f\u00e9rentiel, sans les m\u00e9tadonn\u00e9es Subversion

