# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

#Question to show user to find out whether start second instance of NetBeans  or not
MSG_AlreadyRunning=O instan\u021b\u0103 a programului ruleaz\u0103 \u0219i folose\u0219te dosarul dumneavoastr\u0103.\nFie o sesiune anterioar\u0103 nu s-a terminat corespunz\u0103tor, sau o alt\u0103 instan\u021b\u0103\n a programului ruleaz\u0103 pe un alt calculator \u0219i folose\u0219te acela\u0219i dosar.\n\nDac\u0103 o alt\u0103 sesiune a programului folose\u0219te acela\u0219i director, ap\u0103sa\u021bi\nAnuleaz\u0103 pentru a evita coruperea fi\u0219ierelor din dosar. Dac\u0103 sunte\u021bi siguri c\u0103 nicio alt\u0103\n instan\u021b\u0103 nu folose\u0219te dosarul, ap\u0103sa\u021bi De acord pentru a continua.
MSG_AlreadyRunningTitle=Avertisment
MSG_CannotWrite=O instan\u021b\u0103 a programului nu poate accesa directorul specificat al utilizatorului.\nAceasta este o problem\u0103 important\u0103 care poate \u00eempiedica func\u021bionarea corespunz\u0103toare a aplica\u021biei.\nAsigura\u021bi-v\u0103 c\u0103 ave\u021bi permisiunea de scriere \u00een {0}.\nAp\u0103sa\u021bi De acord pentru a continua ignor\u00e2nd eroarea.
MSG_CannotWriteTitle=Avertisment

EXC_not_a_module={0} nu este un modul NetBeans valid.

# bootstrap manifest
OpenIDE-Module-Name=Ini\u0163ializare
OpenIDE-Module-Display-Category=Infrastructur\u0103
OpenIDE-Module-Short-Description=Nucleul de ini\u0163ializare al aplica\u0163iilor bazate pe NetBeans.
OpenIDE-Module-Long-Description=Acest modul ofer\u0103 infrastructura ini\u0163ial\u0103 care \u00eencarc\u0103 celelalte p\u0103r\u0163i ale aplica\u0163iei. Nu poate fi dezactivat.

MSG_InstallJava6=Nu func\u021bioneaz\u0103 pe versiuni mai vechi dec\u00e2t Java 6 Edi\u021bia Standard.\nInstala\u021bi Java 6 Edi\u021bia Standard sau mai nou\u0103 sau folosi\u021bi comutatorul --jdkhome\npentru a indica directorul de instalare.
MSG_NeedsJava6=Este necesar\u0103 platforma Java 6 Edi\u021bia Standard sau mai nou\u0103.

