<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>GUI-Formularbeispiele</title>
<!--      Copyright (c) 2007 Sun Microsystems, Inc. All rights reserved. -->
<!--     Use is subject to license terms.-->
        <link rel="stylesheet" type="text/css" href="netbeans.css" media="screen">

</head>
<body>
<br>
<h1 align="">Beschreibung der GUI-Formularbeispiele</h1>
<p>

Dieses Projekt enth&auml;lt drei Formulare, die mit dem GUI-Designer der IDE erstellt wurden. </p>
<p><strong>&Ouml;ffnen eines Beispielformulars im GUI-Designer:</strong></p>
<ol>
  <li>Im Projektfenster der IDE auf den Knoten f&uuml;r das Standardpaket innerhalb <br>
    der Quellpaketes gehen.</li>
  <br>
  <li>Doppelklick auf das gew&auml;hlte Beispielformular.
    <p>Die IDE startet den GUI-Designer und zeigt das gew&auml;hlte Formular an.
  </p></li>
</ol>

<br>

<h2>Kontakteditor</h2>
<p>Dieses komplexe Formular ist &auml;hnlich Windowsdialogen, die normalerweise f&uuml;r die Anzeige und das Bearbeiten von Datenbankinformationen genutzt werden. Dieses Beispiel zeigt die volle Bandbreit der F&auml;higkeiten des GUI-Designers, z.B. Ausrichtung, Verankerung, Gr&ouml;&szlig;enangaben, Einr&uuml;ckung und automatische Gr&ouml;&szlig;en&auml;nderung zur Laufzeit. Ein detailiertes Tutorial, inklusive Flashpr&auml;sentation, welches das Erstellen dieses Formulars zeigt, kann unter <a href="http://netbeans.org/kb/60/java/quickstart-gui.html">Designing a Swing GUI in NetBeans IDE</a> angesehen werden.</p>

<br>

<h2>Antennapr&auml;ferenzen</h2>
<p>Dieses Beispiel zeigt eine Art tabellenbasiertes Formular, welches allgemein f&uuml;r das Gruppieren gleicher Daten verwendet wird. Die fortschrittliche Ausrichtungsfunktion des GUI-Designers erm&ouml;glicht es nicht-adjazente Komponenten (z.B.: Labels, Textfelder und Buttons) konsistent zu gruppieren und in der Gr&ouml;&szlig;e anzupassen, ohne die Zellen manuell zusammenf&uuml;hren zu m&uuml;ssen.
</p>

<br>

<h2>Suche</h2>
<p>Dieses einfache Beispielt zeigt ein simples Layout, welches oftmals von Anwendungen genutzt wird, die eine Basissuchfunktionalit&auml;t ben&ouml;tigen. Die Ausrichtungs- und Gr&ouml;&szlig;enfunktion des GUI-Designers erlaubt ein schnelles Erstellen solcher Formulare mit vorraussagbaren Positionsnangaben.
</p>

</body>
</html>
