# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

#Question to show user to find out whether start second instance of NetBeans  or not
MSG_AlreadyRunning=\u0418\u0437\u0433\u043b\u0435\u0436\u0434\u0430, \u0447\u0435 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430\u0442\u0430 \u0432\u0435\u0447\u0435 \u0440\u0430\u0431\u043e\u0442\u0438 \u0441 \u0412\u0430\u0448\u0430\u0442\u0430 \u043f\u043e\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043b\u0441\u043a\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f.\n\u0418\u043b\u0438 \u043f\u0440\u0435\u0434\u0438\u0448\u043d\u0430 \u0441\u0435\u0441\u0438\u044f \u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430\u0442\u0430 \u043d\u0435 \u0435 \u0437\u0430\u0442\u0432\u043e\u0440\u0435\u043d\u0430 \u043a\u043e\u0440\u0435\u043a\u0442\u043d\u043e, \u0438\u043b\u0438 \u0434\u0440\u0443\u0433\u043e \u043a\u043e\u043f\u0438\u0435\n \u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430\u0442\u0430 \u0440\u0430\u0431\u043e\u0442\u0438 \u043d\u0430 \u0434\u0440\u0443\u0433 \u043a\u043e\u043c\u043f\u044e\u0442\u044a\u0440 \u0438 \u0438\u0437\u043f\u043e\u043b\u0437\u0432\u0430 \u0412\u0430\u0448\u0430\u0442\u0430 \u043f\u043e\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043b\u0441\u043a\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f.\n\nlf \u0434\u0440\u0443\u0433\u0430 \u0441\u0435\u0441\u0438\u044f \u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430\u0442\u0430 \u0435 \u0430\u043a\u0442\u0438\u0432\u043d\u0430 \u0438 \u0438\u0437\u043f\u043e\u043b\u0437\u0432\u0430 \u0441\u044a\u0449\u0430\u0442\u0430 \u043f\u043e\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043b\u0441\u043a\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f, \u043c\u043e\u043b\u044f \u043d\u0430\u0442\u0438\u0441\u043d\u0435\u0442\u0435\n\u041e\u0442\u043a\u0430\u0437 \u0437\u0430 \u0434\u0430 \u043f\u0440\u0435\u0434\u043f\u0430\u0437\u0438\u0442\u0435 \u043f\u043e\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043b\u0441\u043a\u0430\u0442\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f \u043e\u0442 \u043f\u043e\u0432\u0440\u0435\u0434\u0430. \u0410\u043a\u043e \u0441\u0442\u0435 \u0441\u0438\u0433\u0443\u0440\u043d\u0438, \u0447\u0435 \u043d\u044f\u043c\u0430 \u0434\u0440\u0443\u0433\u0438 \u043a\u043e\u043f\u0438\u044f \u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430\u0442\u0430, \u0440\u0430\u0431\u043e\u0442\u0435\u0449\u0438 \u0441 \u0412\u0430\u0448\u0430\u0442\u0430 \u043f\u043e\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043b\u0441\u043a\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f, \u043d\u0430\u0442\u0438\u0441\u043d\u0435\u0442\u0435 OK \u0437\u0430 \u0434\u0430 \u043f\u0440\u043e\u0434\u044a\u043b\u0436\u0438\u0442\u0435.
MSG_AlreadyRunningTitle=\u0412\u043d\u0438\u043c\u0430\u043d\u0438\u0435
MSG_CannotWrite=\u041f\u0440\u043e\u0433\u0440\u0430\u043c\u0430\u0442\u0430 \u043d\u044f\u043c\u0430 \u0434\u043e\u0441\u0442\u044a\u043f \u0434\u043e \u0438\u0437\u0431\u0440\u0430\u043d\u0430\u0442\u0430 \u043f\u043e\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043b\u0441\u043a\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f.\n\u0422\u043e\u0432\u0430 \u0435 \u0441\u0435\u0440\u0438\u043e\u0437\u0435\u043d \u043f\u0440\u043e\u0431\u043b\u0435\u043c, \u043a\u043e\u0439\u0442\u043e \u043c\u043e\u0436\u0435 \u0434\u0430 \u043f\u043e\u043f\u0440\u0435\u0447\u0438 \u043d\u0430 \u043d\u043e\u0440\u043c\u0430\u043b\u043d\u043e\u0442\u043e \u0444\u0443\u043d\u043a\u0446\u0438\u043e\u043d\u0438\u0440\u0430\u043d\u0435 \u043d\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430\u0442\u0430.\n\u0423\u0431\u0435\u0434\u0435\u0442\u0435 \u0441\u0435, \u0447\u0435 \u0432 {0} \u043c\u043e\u0436\u0435 \u0434\u0430 \u0441\u0435 \u043f\u0438\u0448\u0435.\n\n\u041d\u0430\u0442\u0438\u0441\u043d\u0435\u0442\u0435 OK \u0437\u0430 \u0434\u0430 \u043f\u0440\u043e\u0434\u044a\u043b\u0436\u0438\u0442\u0435 \u0432\u044a\u043f\u0440\u0435\u043a\u0438 \u043f\u0440\u0435\u0434\u0445\u043e\u0434\u043d\u0430\u0442\u0430 \u0433\u0440\u0435\u0448\u043a\u0430.
MSG_CannotWriteTitle=\u0412\u043d\u0438\u043c\u0430\u043d\u0438\u0435

EXC_not_a_module={0} \u043d\u0435 \u0435 \u0432\u0430\u043b\u0438\u0434\u0435\u043d \u043c\u043e\u0434\u0443\u043b \u043d\u0430 NetBeans

# bootstrap manifest
OpenIDE-Module-Name=\u041f\u044a\u0440\u0432\u043e\u043d\u0430\u0447\u0430\u043b\u043d\u043e \u0437\u0430\u0440\u0435\u0436\u0434\u0430\u043d\u0435
OpenIDE-Module-Display-Category=\u0418\u043d\u0444\u0440\u0430\u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0430
OpenIDE-Module-Short-Description=\u041f\u0440\u043e\u0446\u0435\u0434\u0443\u0440\u0430 \u0437\u0430 \u043f\u044a\u0440\u0432\u043e\u043d\u0430\u0447\u0430\u043b\u043d\u043e \u0441\u0442\u0430\u0440\u0442\u0438\u0440\u0430\u043d\u0435 \u043d\u0430 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u0435 \u043e\u0441\u043d\u043e\u0432\u0430\u0432\u0430\u0449\u043e \u0441\u0435 \u043d\u0430 NetBeans.
OpenIDE-Module-Long-Description=\u0422\u043e\u0437\u0438 \u043c\u043e\u0434\u0443\u043b \u043f\u0440\u0435\u0434\u043e\u0441\u0442\u0430\u0432\u044f \u043f\u044a\u0440\u0432\u0438\u0447\u043d\u0430\u0442\u0430 \u0438\u043d\u0444\u0440\u0430\u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0430 \u043a\u043e\u044f\u0442\u043e \u0437\u0430\u0440\u0435\u0436\u0434\u0430 \u0432\u0441\u0438\u0447\u043a\u0438 \u043e\u0441\u0442\u0430\u043d\u0430\u043b\u0438 \u0447\u0430\u0441\u0442\u0438 \u043d\u0430 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u0435\u0442\u043e. \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0441\u0435 \u0438\u0437\u043a\u043b\u044e\u0447\u0432\u0430.

MSG_InstallJava6=\u041d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0440\u0430\u0431\u043e\u0442\u0438 \u043d\u0430 \u043f\u043e \u0441\u0442\u0430\u0440\u0430 \u0432\u0435\u0440\u0441\u0438\u044f \u043d\u0430 Java \u043e\u0442 Java 6 Standard Edition.\n\u041c\u043e\u043b\u044f, \u0438\u043d\u0441\u0442\u0430\u043b\u0438\u0440\u0430\u0439\u0442\u0435 Java 6 Standard Edition \u0438\u043b\u0438 \u043f\u043e-\u043d\u043e\u0432\u0430, \u0438\u043b\u0438 \u0438\u0437\u043f\u043e\u043b\u0437\u0432\u0430\u0439\u0442\u0435 \u043a\u043b\u044e\u0447\u0430 --jdkhome\n \u0437\u0430 \u0434\u0430 \u0443\u043a\u0430\u0436\u0435\u0442\u0435 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f\u0442\u0430 \u0432 \u043a\u043e\u044f\u0442\u043e \u0435 \u0438\u043d\u0441\u0442\u0430\u043b\u0438\u0440\u0430\u043d\u0430.
MSG_NeedsJava6=\u0418\u0437\u0438\u0441\u043a\u0432\u0430 \u0441\u0435 Java 6 Standard Edition \u0438\u043b\u0438 \u043f\u043e-\u043d\u043e\u0432\u0430

