<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>GUI Formu &Ouml;rnekleri</title>
<!--      Copyright (c) 2007 Sun Microsystems, Inc. All rights reserved. -->
<!--     Use is subject to license terms.-->
        <link rel="stylesheet" type="text/css" href="netbeans.css" media="screen">

</head>
<body>
<br>
<h1 align="">GUI Formu &Ouml;rnek Tanımları</h1>
<p>

Bu proje IDE'nin GUI tasarımcısı ile tasarlanmış &uuml;&ccedil; g&ouml;rsel form i&ccedil;erir.  </p>
<p><strong>&Ouml;rnek formu GUI Tasarımcısında a&ccedil;mak i&ccedil;in:</strong></p>
<ol>
  <li>IDE'nin Projeler penceresinde Kaynak Paketleri dizininde bulunan <br>
    varsayılan paket d&uuml;ğ&uuml;m&uuml;ne gidin.</li>
  <br>
  <li>G&ouml;r&uuml;nt&uuml;lemek istediğiniz &ouml;rnek form d&uuml;ğ&uuml;m&uuml;n&uuml; &ccedil;ift-tıklayın.
    <p>IDE GUI tasarımcısını başlatır ve se&ccedil;ilen formu g&ouml;sterir.
  </p></li>
</ol>

<br>

<h2>Bağlantı D&uuml;zenleyici</h2>
<p>Bu karmaşık form Windows dyaloglarına benzer bir şekilde veritabanı bilgisini g&ouml;stermeye ve değiştirmeye yarar. Bu &ouml;rnek hizalama, boyutlandırma, girintileme ve &ccedil;alışma zamanı otomatik-boyutlandırma gibi GUI tasarımcı &ouml;zelliklerinin t&uuml;m&uuml;n&uuml; g&ouml;sterir. Bu formun nasıl tasarlandığı hakkında flash g&ouml;sterimleri i&ccedil;eren detaylı bir demoyu izlemk i&ccedil;in <a href="http://netbeans.org/kb/60/java/quickstart-gui.html">NetBeans IDE'de Swing GUI Tasarımı</a> adresine g&ouml;z atın.</p>

<br>

<h2>Anten &Ouml;zellikleri</h2>
<p>Bu &ouml;rnek ilintili verileri g&ouml;rsel olarak birbirine uygun şekilde g&ouml;stermeye yarayan tablo bazlı form tasarımını g&ouml;sterir. GUI tasarımcısının gelişmiş hizalama yetenekleri kullanıcının komşu olmayan elemanları (etiketler, d&uuml;ğmeler) h&uuml;creleri birleştirme ihtiyacı duymadan gruplamasını ve boyutlandırmasını sağlar.
</p>

<br>

<h2>Bul</h2>
<p>Bu form temel arama fonksiyonu gerektiren &ccedil;eşitli uygulamalarda kullanılan basit bir layout &ouml;rneğidir. GUI Tasarımcısı'nın hizalama ve boyutlandırma &ouml;zellikleri bu t&uuml;r formları kolaylıkla oluşturmanızı sağlarken formunuzun yerelleştirilmesini da destekler.
</p>

</body>
</html>
