# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

ACT_OPEN_FILE_START=\u5f71\u97ff\u3092\u53d7\u3051\u308b\u30d5\u30a1\u30a4\u30eb\u304c\u958b\u304b\u308c\u307e\u3057\u305f\u3002
ACT_start_validate=\u30d7\u30e9\u30a4\u30df\u30f3\u30b0\u30fb\u30d3\u30eb\u30c9\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
ACT_validate=\u30d7\u30e9\u30a4\u30df\u30f3\u30b0\u30fb\u30d3\u30eb\u30c9
# {0} - full directory path
build_details={0}\u3067\u30d7\u30e9\u30a4\u30df\u30f3\u30b0\u30fb\u30d3\u30eb\u30c9\u3092\u5b9f\u884c
# {0} - directory name of reactor
build_label={0}\u306e\u30d7\u30e9\u30a4\u30df\u30f3\u30b0
# {0} - directory basename
build_title={0}\u306e\u30d3\u30eb\u30c9
# {0} - jdk platform id
DESC_No_such_JDK=\u73fe\u5728\u306eIDE\u306b\u5024"{0}"\u304c\u5b9a\u7fa9\u3055\u308c\u305fJava\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u304c\u304b\u308f\u308a\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u4fee\u6b63\u3059\u308b\u306b\u306f\u3001\u6307\u5b9a\u306e\u540d\u524d\u306eJava\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3092\u5c0e\u5165\u3059\u308b\u304b\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f7f\u7528\u3055\u308c\u308bJava\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ERR_MissingApisupportModule=Maven NetBeans\u30e2\u30b8\u30e5\u30fc\u30eb\u30fb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30b5\u30dd\u30fc\u30c8\u304c\u3042\u308a\u307e\u305b\u3093
ERR_MissingJ2eeModule=Maven Java EE\u306e\u30b5\u30dd\u30fc\u30c8\u304c\u3042\u308a\u307e\u305b\u3093
ERR_NonLocal=\u4e00\u90e8\u306e\u4f9d\u5b58\u6027\u306e\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306f\u3001\u30ed\u30fc\u30ab\u30eb\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u306f\u3042\u308a\u307e\u305b\u3093\u3002
ERR_NoParent=\u89aaPOM\u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u8a2d\u5b9a\u304c\u6b63\u3057\u304f\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
ERR_Participant=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d3\u30eb\u30c9\u53c2\u52a0\u8005\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
ERR_SystemScope=\u30b7\u30b9\u30c6\u30e0\u30fb\u30b9\u30b3\u30fc\u30d7\u306e\u4f9d\u5b58\u6027\u306f\u691c\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b3\u30fc\u30c9\u88dc\u5b8c\u304c\u5f71\u97ff\u3092\u53d7\u3051\u307e\u3059\u3002
LBL_Problems=\u554f\u984c(&P):
LBL_Description=\u8aac\u660e(&D):
# {0} - jdk platform id
MGS_No_such_JDK=\u6b21\u306eJava\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u306f\u3042\u308a\u307e\u305b\u3093: {0}
MSG_MissingApisupportModule=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u5185\u306bMaven NetBeans\u30e2\u30b8\u30e5\u30fc\u30eb\u30fb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u305f\u3081\u3001NetBeans\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u306e\u3059\u3079\u3066\u306e\u6a5f\u80fd(API\u30a6\u30a3\u30b6\u30fc\u30c9\u3001\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5b9f\u884c\u306a\u3069)\u304c\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u3082\u3063\u3068\u3082\u53ef\u80fd\u6027\u306e\u9ad8\u3044\u539f\u56e0\u306f\u3001\u4e00\u822c\u7684\u306a\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u958b\u767a\u30b5\u30dd\u30fc\u30c8\u306e\u4e00\u90e8\u304c\u540c\u69d8\u306b\u5b58\u5728\u3057\u306a\u3044\u3053\u3068\u3067\u3059\u3002\u300c\u30c4\u30fc\u30eb\u300d/\u300c\u30d7\u30e9\u30b0\u30a4\u30f3\u300d\u3092\u9078\u629e\u3057\u3066\u3001NetBeans\u958b\u767a\u306b\u95a2\u9023\u3059\u308b\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_MissingJ2eeModule=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u5185\u306bMaven Java EE\u30b5\u30dd\u30fc\u30c8\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u305f\u3081\u3001EE\u95a2\u9023\u306e\u3059\u3079\u3066\u306e\u6a5f\u80fd(\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u3001\u30d5\u30a1\u30a4\u30eb\u306e\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306a\u3069)\u304c\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u3082\u3063\u3068\u3082\u53ef\u80fd\u6027\u306e\u9ad8\u3044\u539f\u56e0\u306f\u3001\u4e00\u822c\u7684\u306aJava EE\u30b5\u30dd\u30fc\u30c8\u306e\u4e00\u90e8\u304c\u540c\u69d8\u306b\u5b58\u5728\u3057\u306a\u3044\u3053\u3068\u3067\u3059\u3002\u300c\u30c4\u30fc\u30eb\u300d/\u300c\u30d7\u30e9\u30b0\u30a4\u30f3\u300d\u306b\u79fb\u52d5\u3057\u3066\u3001Java EE\u306b\u95a2\u9023\u3057\u305f\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002
# {0} - list of artifacts
MSG_NonLocal=\u30ed\u30fc\u30ab\u30eb\u3067\u89e3\u6c7a\u3055\u308c\u3066\u3044\u306a\u3044\u4f9d\u5b58\u6027\u304c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u3042\u308a\u307e\u3059\u3002IDE\u306e\u30b3\u30fc\u30c9\u88dc\u5b8c\u306f\u3001\u3053\u308c\u3089\u306e\u4f9d\u5b58\u6027\u304b\u3089\u306e\u30af\u30e9\u30b9\u3092\u542b\u307f\u307e\u305b\u3093\u3002\u307e\u305f\u3001\u305d\u308c\u3089\u306e\u63a8\u79fb\u7684\u306a\u4f9d\u5b58\u6027\u306b\u3082(\u958b\u3044\u3066\u3044\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5185\u306b\u306a\u3044\u9650\u308a)\u542b\u307e\u308c\u307e\u305b\u3093\u3002\n\u4f9d\u5b58\u6027\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3059\u308b\u304b\u3001\u30ea\u30e2\u30fc\u30c8\u3067\u4f7f\u7528\u53ef\u80fd\u3067\u306a\u3044\u5834\u5408\u306f\u3001\u624b\u52d5\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059:\n {0}
# {0} - Maven coordinates
MSG_NoParent=ID {0}\u306e\u89aaPOM\u304c\u3001\u30bd\u30fc\u30b9\u307e\u305f\u306f\u30ed\u30fc\u30ab\u30eb\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u3067\u691c\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002<relativePath>\u30bf\u30b0\u304c\u5b9f\u5728\u3057\u3066\u6b63\u3057\u3044\u304b\u3001\u30bd\u30fc\u30b9\u306e\u89aaPOM\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u4e00\u81f4\u3057\u3066\u3044\u308b\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30ea\u30e2\u30fc\u30c8\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u4ecb\u3057\u3066\u306e\u307f\u89aa\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u5834\u5408\u3001\u305d\u308c\u3092\u53ce\u5bb9\u3059\u308b\u30ea\u30dd\u30b8\u30c8\u30ea\u304c\u73fe\u5728\u306ePOM\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_Participant=IDE\u306f\u3001Maven\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30ed\u30fc\u30c9\u4e2d\u3001\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u306e\u62e1\u5f35\u30b3\u30fc\u30c9\u3092\u5b9f\u884c\u3057\u307e\u305b\u3093\u3002\n\u3053\u308c\u306f\u3001Maven\u30e2\u30c7\u30eb\u306e(\u518d)\u30ed\u30fc\u30c9\u306e\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u306b\u91cd\u5927\u306a\u5f71\u97ff\u3092\u53ca\u307c\u3057\u305f\u308a\u3001IDE\u72ec\u81ea\u306e\u30b3\u30fc\u30c9\u30d9\u30fc\u30b9\u306b\u5e72\u6e09\u3057\u305f\u308a\u3059\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002\u4e00\u65b9\u3001\u30ed\u30fc\u30c9\u3055\u308c\u305f\u30e2\u30c7\u30eb\u306f\u3001\u305d\u306e\u53c2\u52a0\u8005\u306a\u3057\u3067\u4e0d\u5b8c\u5168\u306b\u306a\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u306f\u3001\u6b21\u306e\u5916\u90e8\u30d3\u30eb\u30c9\u53c2\u52a0\u8005\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002\n{0}
MSG_SystemScope=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5185\u306b\u300c\u30b7\u30b9\u30c6\u30e0\u300d\u304c\u30b9\u30b3\u30fc\u30d7\u3057\u305f\u4f9d\u5b58\u6027\u304c\u3042\u308a\u307e\u3059\u304c\u3001\u30d0\u30a4\u30ca\u30ea\u3078\u306e\u30d1\u30b9\u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\n\u30d1\u30b9\u304c\u7d76\u5bfe\u30d1\u30b9\u3067\u3001\u65e2\u5b58\u306e\u30d0\u30a4\u30ca\u30ea\u3092\u793a\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TXT_Artifact_Not_Found=\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
TXT_Artifact_Resolution_problem=\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u7cbe\u5ea6\u306e\u554f\u984c
TXT_Cannot_Load_Project=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u6b63\u5e38\u306b\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093
TXT_Cannot_read_model=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30e2\u30c7\u30eb\u306e\u8aad\u53d6\u308a\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
TXT_No_Res=\u554f\u984c\u306b\u89e3\u6c7a\u7b56\u304c\u3042\u308a\u307e\u305b\u3093
TXT_NoMsg={0}\u3067maven\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u308b\u3068\u304d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002\u8a73\u7d30\u306f\u3001messages.log\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TXT_OPEN_FILE=\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f

