# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

OpenIDE-Module-Display-Category=Servicios Web
OpenIDE-Module-Long-Description=Declaraci\u00f3n de servicios Web "StrikeIron" como componentes de servicios Web RESTful.
OpenIDE-Module-Name=Servicios "StrikeIron"

OpenIDE-Module-Short-Description=Componente de servicio "StrikeIron"
#StrikeIron_Name=StrikeIron

AddressVerification40_Name=Verificaci\u00f3n de direcci\u00f3n 40
EmailVerify30_Name=Verificaci\u00f3n de correo electr\u00f3nico 30
IPAddressLookup_Name=B\u00fasqueda de direcciones IP
ReversePhoneLookup_Name=B\u00fasqueda invertida de tel\u00e9fonos
SalesandUseTaxComplete40_Name=Completar Impuesto 40
ZipCode_Name=C\u00f3digo postal

AddressVerification40_Desc=<html>El servicio Web inspecciona cada elemento de una direcci\u00f3n para asegurar su validez y, <br/>usando tecnolog\u00edas de comparaci\u00f3n y de estandarizaci\u00f3n de datos sofisticadas, actualiza <br/> las direcciones incorrectas de acuerdo a los requerimientos postales. StrikeIron inspects house <br/>numbers, street directions, street names, street types, apartment numbers and <br/>P.O. boxes to ensure the accuracy of each element and standardize addresses <br/>according to postal authority rules. El StrikeIron tambi\u00e9n corrige errores ortogr\u00e1ficos en el nombre de la calle, <br/>valida extensiones de tipo de calle, estandariza los nombres de las ciudades y <br/> de los estados o provincias, y agrega abreviaciones de estados o provincias faltantes. El servicio web puede ser <br/> invocado por una direcci\u00f3n o como un proceso por lotes.</html>

EmailVerify30_Desc=<html>El servicio Web de verificaci\u00f3n de correo electr\u00f3nico "StrikeIron" determina la validez de la direcci\u00f3n o del domino <br/>del correo electr\u00f3nico instant\u00e1neamente. S\u00f3lo provea la direcci\u00f3n de correo electr\u00f3nico y este servicio Web <br/>devolver\u00e1 un valor verdadero o falso contactando a los propietarios de los servidores de correo electr\u00f3nico SMTP para validar <br/>una direcci\u00f3n sin enviar un correo electr\u00f3nico. </html>

IPAddressLookup_Desc=<html>Este servicio Web devuelve la direcci\u00f3n IP al entregarle el nombre de un servidor Web. <br/>Por ejemplo, www.anywebserver.com debe regresar 256.1.1.56.</html>

ReversePhoneLookup_Desc=<html>La b\u00fasqueda invertida de tel\u00e9fonos: Los servicios Web de 90 d\u00edas de exactitud proveen una interfaz de programaci\u00f3n <br/>para nombrar y direccionar datos asociados con cualquier n\u00famero telef\u00f3nico. Actualizado por las noches,<br/>esto asegura que est\u00e9 dentro de los \u00faltimos 90 d\u00edas.</html>

SalesandUseTaxComplete40_Desc=<html>Los servicios Web de ventas de sistemas de datos impositivos e impuestos de empleo proveen una interfaz program\u00e1tica para <br/>ventas en vivo y para datos de impuestos de empleo. Simplemente proporciona un c\u00f3digo postal de EUA o de Canad\u00e1 y lo hace coincidir para las ventas generales, y usado para los niveles de imuesto<br/>para un estado, condado, ciudad, MTA, SPD y m\u00e1s. El dato de impuesto es luego enviado<br/> inmediatamente en un servicio web basado en XML directamente a cualquier aplicaci\u00f3n, plataforma, <br/> producto o sitio web</html>

ZipCode_Desc=<html>El StrikeIron ZIP Code Information Web Service instant\u00e1neamente obtiene la ciudad, estado, condado, latitud, <br/>longitud y zona horaria para un c\u00f3digo postal de EE.UU o Canad\u00e1</html>

