# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

LAB_security_error=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fb\u30a8\u30e9\u30fc
LAB_security_warning=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8b66\u544a

SecurityCheck_NAME=C\u30e9\u30a4\u30d6\u30e9\u30ea\u95a2\u6570
SecurityCheck_DESCRIPTION=\u5b89\u5168\u3067\u306a\u3044C\u30e9\u30a4\u30d6\u30e9\u30ea\u95a2\u6570\u306e\u4f7f\u7528\u65b9\u6cd5\u3092\u78ba\u8a8d\u3057\u307e\u3059
DisableHint=\u30d2\u30f3\u30c8\u306e\u69cb\u6210

#AvoidFunctionUsage
FunctionUsageAudit.name={0}\u306e\u4f7f\u7528
FunctionUsageAudit.alternative=\n\u4ee3\u66ff\u65b9\u6cd5 {0}

#issues descriptions
FunctionUsageAudit.gets.description=\u3053\u306e\u95a2\u6570\u3067\u306f\u3001\u5165\u529b\u306e\u683c\u7d0d\u6642\u306b\u5883\u754c\u304c\u30c1\u30a7\u30c3\u30af\u3055\u308c\u307e\u305b\u3093\u3002\u3053\u306e\u95a2\u6570\u306f\u5b89\u5168\u306b\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002

FunctionUsageAudit.cftime.description=\u3053\u308c\u3089\u306e\u30eb\u30fc\u30c1\u30f3\u3067\u306f\u51fa\u529b\u30d0\u30c3\u30d5\u30a1\u306e\u5883\u754c\u304c\u30c1\u30a7\u30c3\u30af\u3055\u308c\u305a\u3001\u74b0\u5883\u5909\u6570CFTIME\u3092\u4f7f\u7528\u3057\u3066\u30e6\u30fc\u30b6\u30fc\u30c7\u30fc\u30bf\u304c\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059

FunctionUsageAudit.strcat.description=\u3053\u308c\u3089\u306e\u95a2\u6570\u3092\u6700\u5927\u30d0\u30c3\u30d5\u30a1\u30fb\u30b5\u30a4\u30ba\u306b\u5236\u9650\u3067\u304d\u307e\u305b\u3093\u3002\n\u3053\u308c\u3089\u306e\u95a2\u6570\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u5e38\u306b\u30ec\u30d3\u30e5\u30fc\u30a2\u306f\u305d\u306e\u30ed\u30b8\u30c3\u30af\u306b\u5f93\u3046\u3053\u3068\u3092\u5f37\u5236\u3055\u308c\u3001\u30bd\u30fc\u30b9\u30fb\u30b3\u30fc\u30c9\u306e\u8106\u5f31\u6027\u306e\u81ea\u52d5\u30b9\u30ad\u30e3\u30f3\u304c\u56de\u907f\u3055\u308c\u307e\u3059\u3002

FunctionUsageAudit.access.description=\u63d0\u4f9b\u3055\u308c\u308b\u60c5\u5831\u304c\u4f7f\u7528\u3059\u308b\u307e\u3067\u306b\u53e4\u304f\u306a\u3063\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u306e\u95a2\u6570\u306f\u6709\u7528\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\naccess()\u3068\u305d\u306e\u5f8c\u306b\u7d9a\u3051\u3066open()\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u89e3\u6c7a\u3067\u304d\u306a\u3044\u7af6\u5408\u72b6\u614b\u306b\u306a\u308a\u307e\u3059\u3002

FunctionUsageAudit.strncat.description=strncat()\u306f\u3001\u5b9b\u5148\u30d0\u30c3\u30d5\u30a1\u306e\u9069\u5207\u306a\u30b5\u30a4\u30ba\u3092\u8a08\u7b97\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u305f\u3081\u3001\u4f7f\u7528\u3059\u308b\u3053\u3068\u304c\u96e3\u3057\u3044\u3067\u3059

FunctionUsageAudit.strncpy.description=strncpy()\u3067\u306f\u3001\u5b9b\u5148\u30d0\u30c3\u30d5\u30a1\u306enull\u7d42\u4e86\u304c\u4fdd\u8a3c\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

FunctionUsageAudit.chmod.description=\u3053\u308c\u3089\u306e\u95a2\u6570\u306f\u30d1\u30b9\u540d\u306b\u4f5c\u7528\u3057\u3001\u7af6\u5408\u72b6\u614b\u306b\u306a\u308b\u50be\u5411\u304c\u3042\u308a\u307e\u3059\u3002\n\u901a\u5e38\u30d7\u30ed\u30b0\u30e9\u30e0\u3067chown/chmod\u3092\u547c\u3073\u51fa\u3059\u5fc5\u8981\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u73fe\u5728\u306euid(\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f\u524d\u306b\u3053\u308c\u306b\u5207\u66ff\u3048)\u304a\u3088\u3073umask\u304c\u512a\u5148\u3055\u308c\u307e\u3059\u3002

FunctionUsageAudit.alloca.description=\u8fd4\u3055\u308c\u305f\u30dd\u30a4\u30f3\u30bf\u304c\u30b9\u30bf\u30c3\u30af\u306e\u5883\u754c\u5185\u306b\u3042\u308b\u304b\u3069\u3046\u304b\u30c1\u30a7\u30c3\u30af\u3057\u307e\u305b\u3093 -\n1\u30da\u30fc\u30b8\u3088\u308a\u5927\u304d\u3044\u30e1\u30e2\u30ea\u30fc\u5272\u5f53\u3066\u306e\u5834\u5408\u3001\u30b9\u30bf\u30c3\u30af\u30fb\u30ac\u30fc\u30c9\u30fb\u30da\u30fc\u30b8\u3092\u8d85\u3048\u3066\u4ed6\u306e\u5272\u5f53\u3066\u6e08\u30da\u30fc\u30b8\u306b\u9054\u3057\u3001\u4e0a\u66f8\u304d\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

FunctionUsageAudit.drand48.description=\u3053\u308c\u306f\u8106\u5f31\u306a\u4e71\u6570\u30b8\u30a7\u30cd\u30ec\u30fc\u30bf\u3067\u3059\u3002\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u76ee\u7684\u3067\u306f\u6709\u7528\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002

FunctionUsageAudit.execvp.description=\u30e6\u30fc\u30b6\u30fc\u306e\u5b8c\u5168\u306a\u5236\u5fa1\u4e0b\u306b\u3042\u308bPATH\u74b0\u5883\u5909\u6570\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u691c\u7d22\u3057\u3066\u5b9f\u884c\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u3092\u898b\u3064\u3051\u308b\u305f\u3081\u3001\n\u3053\u308c\u3089\u306e\u95a2\u6570\u306f\u30e9\u30a4\u30d6\u30e9\u30ea\u307e\u305f\u306f\u6a29\u9650\u4ed8\u304d\u30b3\u30de\u30f3\u30c9\u304a\u3088\u3073\u30c7\u30fc\u30e2\u30f3\u3067\u4f7f\u7528\u3059\u308b\u306b\u306f\u5371\u967a\u3059\u304e\u307e\u3059\u3002

FunctionUsageAudit.sprintf.description=\u5178\u578b\u7684\u306a\u30d0\u30c3\u30d5\u30a1\u30fb\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u304c\u767a\u751f\u3057\u307e\u3059\u3002\u4f55\u3089\u304b\u306e\u7406\u7531\u3067\u3053\u308c\u3089\u306e\u95a2\u6570\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306f\u3001\n2\u3064\u76ee\u306e\u5f15\u6570\u304c\u30e6\u30fc\u30b6\u30fc\u5236\u5fa1\u3067\u306a\u304f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u3067\u78ba\u5b9f\u306b\u5b9b\u5148\u30d0\u30c3\u30d5\u30a1\u3092\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u3057\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002

FunctionUsageAudit.getlogin.description=getlogin()\u306b\u3088\u3063\u3066\u8fd4\u3055\u308c\u308b\u5024\u306f\u4fe1\u983c\u3067\u304d\u307e\u305b\u3093\u3002\u30e6\u30fc\u30b6\u30fc\u540d\u306b\u3064\u3044\u3066\u306f\u30d2\u30f3\u30c8\u306b\u3059\u304e\u307e\u305b\u3093\u3002

FunctionUsageAudit.getpass.description=\u5165\u529b\u306e\u6700\u521d\u306e8\u30d0\u30a4\u30c8\u306e\u307f\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u65b0\u898f\u30b3\u30fc\u30c9\u3067\u306e\u4f7f\u7528\u306f\u907f\u3051\u3066\u304f\u3060\u3055\u3044\u3002

FunctionUsageAudit.mktemp.description=\u4e00\u6642\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u304c\u3001mktemp()\u3067\u306e\u30c1\u30a7\u30c3\u30af\u3068\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308b\u5f8c\u7d9a\u306eopen()\u3068\u306e\u9593\u306b\n\u7af6\u5408\u72b6\u614b\u304c\u3042\u308b\u305f\u3081\u3001\u751f\u6210\u3055\u308c\u305f\u30d1\u30b9\u540d\u3092\u4f7f\u7528\u3059\u308b\u969b\u306f\u5b89\u5168\u304c\u4fdd\u8a3c\u3055\u308c\u307e\u305b\u3093\u3002

FunctionUsageAudit.popen.description=\u3053\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30b3\u30fc\u30eb\u306b\u306f\u5e38\u306b\u3001PATH\u3001IFS\u3001\u305d\u306e\u4ed6\u306e\u74b0\u5883\u5909\u6570\u3001\u304a\u3088\u3073\u7279\u6b8a\u6587\u5b57\u306e\u89e3\u91c8\u3092\u542b\u3080\u30b7\u30a7\u30eb\u304c\u95a2\u4e0e\u3057\u307e\u3059\u3002\nposix_spawn()\u3092\u4f7f\u7528\u3057\u3001\u5fc5\u8981\u306b\u5fdc\u3058\u3066waitpid()\u307e\u305f\u306fpipe()\u3092\u4f7f\u7528\u3057\u3066\u4ed6\u306e\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5b9f\u884c\u3057\u307e\u3059\u3002

FunctionUsageAudit.tempnam.description=\u3053\u306e\u95a2\u6570\u306f\u4e88\u6e2c\u4e0d\u53ef\u80fd\u306a\u30d5\u30a1\u30a4\u30eb\u540d\u306e\u751f\u6210\u306b\u9069\u3057\u3066\u3044\u307e\u305b\u3093\u3002\n\u30d5\u30a1\u30a4\u30eb\u540d\u306e\u751f\u6210\u3068open()\u306a\u3069\u3067\u306e\u305d\u306e\u4f7f\u7528\u3068\u306e\u9593\u306b\u7af6\u5408\u72b6\u614b\u304c\u3042\u308a\u307e\u3059

FunctionUsageAudit.truncate.description=\u3053\u306e\u95a2\u6570\u3067\u306f\u3001\u30d1\u30b9\u540d\u306e\u7af6\u5408\u72b6\u614b\u304c\u767a\u751f\u3059\u308b\u50be\u5411\u304c\u3042\u308a\u307e\u3059\u3002\n\u5b89\u5168\u306aopen()\u306e\u5f8cftruncate()\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002

FunctionUsageAudit.utmpname.description=\u30c7\u30d5\u30a9\u30eb\u30c8\u306eutmp\u304a\u3088\u3073utmpx\u30d5\u30a1\u30a4\u30eb\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002

FunctionUsageAudit.kvm_open.description=\u4e00\u6642\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u304c\u3001mktemp()\u3067\u306e\u30c1\u30a7\u30c3\u30af\u3068\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308b\u5f8c\u7d9a\u306eopen()\u3068\u306e\u9593\u306b\n\u7af6\u5408\u72b6\u614b\u304c\u3042\u308b\u305f\u3081\u3001\u751f\u6210\u3055\u308c\u305f\u30d1\u30b9\u540d\u3092\u4f7f\u7528\u3059\u308b\u969b\u306f\u5b89\u5168\u304c\u4fdd\u8a3c\u3055\u308c\u307e\u305b\u3093\u3002

FunctionUsageAudit.open.description=\u6a29\u9650\u4ed8\u304d\u30d7\u30ed\u30b0\u30e9\u30e0\u304b\u3089\u306e\u8aad\u53d6\u308a\u7528\u306b\u958b\u304f\u5834\u5408\u3001\u6a29\u9650\u3092\u524a\u9664\u3059\u308b\u304b\u3001\u6709\u52b9\u306auid\u3092\u5b9f\u969b\u306euid\u306b\u8a2d\u5b9a\u3057\u3001\u30e6\u30fc\u30b6\u30fc\u3068\u3057\u3066\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f\u3088\u3046\u306b\u3057\u307e\u3059\u3002\n\u66f8\u8fbc\u307f\u7528\u306b\u958b\u304f\u5834\u5408\u3001O_NOFOLLOW\u304a\u3088\u3073O_NOLINKS\u30d5\u30e9\u30b0\u3092\u4f7f\u7528\u3059\u308b\u304b\u3001O_CREAT|O_EXCL\u3092\u4f7f\u7528\u3057\u3066\u65e2\u5b58\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f\u306e\u3067\u306f\u306a\u304f\u3001\u65b0\u898f\u30d5\u30a1\u30a4\u30eb\u304c\u4f5c\u6210\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002\n\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f\u969b\u3001exec()\u30b3\u30fc\u30eb\u306e\u9593\u30d5\u30a1\u30a4\u30eb\u30fb\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf\u3092\u958b\u3044\u305f\u307e\u307e\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u304b\u691c\u8a0e\u3057\u307e\u3059\u3002

FunctionUsageAudit.dup.description=FD_CLOEXEC\u304c\u30af\u30ea\u30a2\u3055\u308c\u305f\u30d5\u30a1\u30a4\u30eb\u30fb\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf\u304c\u8fd4\u3055\u308c\u308b\u305f\u3081\u3001\u30d7\u30ed\u30b0\u30e9\u30e0\u3067exec()\u3092\u547c\u3073\u51fa\u3059\u3068\u30ea\u30fc\u30af\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u3089\u306e\u95a2\u6570\u306e\u76f4\u5f8c\u306bfcntl()\u3092\u547c\u3073\u51fa\u3059\n\u53e4\u3044\u30b3\u30fc\u30c9\u3067\u306f\u623b\u3063\u3066\u305d\u306e\u30d5\u30e9\u30b0\u3092\u8a2d\u5b9a\u3057\u3066\u3044\u307e\u3057\u305f\u304c\u3001\u30de\u30eb\u30c1\u30b9\u30ec\u30c3\u30c9\u30fb\u30b3\u30fc\u30c9(\u305d\u308c\u81ea\u4f53\u306f1\u3064\u306e\u30b9\u30ec\u30c3\u30c9\u306e\u307f\u3092\u5b9f\u884c\u3059\u308b\u304c\u3001\u4ed6\u306e\u30b9\u30ec\u30c3\u30c9\u3092\u5b9f\u884c\u3059\u308b\u30e9\u30a4\u30d6\u30e9\u30ea\u3068\u30ea\u30f3\u30af\n\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u542b\u3080)\u3067\u306f\u3001\u4ed6\u306e\u30b9\u30ec\u30c3\u30c9\u3068\u306e\u7af6\u5408\u3067\u30a6\u30a3\u30f3\u30c9\u30a6\u304c\u958b\u3044\u305f\u307e\u307e\u306b\u306a\u308a\u307e\u3059\u3002F_DUPFD_CLOEXEC\u304a\u3088\u3073F_DUP2FD_CLOEXEC\u3092\u6307\u5b9a\u3057\u305f\nfcntl\u547c\u51fa\u3057(Solaris 11\u4ee5\u4e0a\u306e\u30ea\u30ea\u30fc\u30b9\u3067\u4f7f\u7528\u53ef\u80fd)\u3067\u306f\u3001\u30a2\u30c8\u30df\u30c3\u30af\u64cd\u4f5c\u306b\u8907\u88fd\u3068\u30d5\u30e9\u30b0\u306e\u8a2d\u5b9a\u304c\u7d44\u307f\u5408\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u7af6\u5408\u306f\u3042\u308a\u307e\u305b\u3093\u3002

FunctionUsageAudit.fopen.description=\u3053\u306e\u65b9\u6cd5\u3067\u5b89\u5168\u306b\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u305f\u3060\u3057\u3001mkstemp()\u306e\u5f8c\u306a\u3069\u306b\u30d1\u30b9\u540d\u306e\u5b58\u5728\u304c\u78ba\u8a8d\u3067\u304d\u305f\u3089\u3001\n\u305d\u308c\u3092\u4f7f\u7528\u3057\u3066\u305d\u308c\u3089\u306e\u30d1\u30b9\u540d\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u305d\u308c\u4ee5\u5916\u306e\u5834\u5408\u3001open()\u3092\u5b89\u5168\u306b\u547c\u3073\u51fa\u3057\u305f\u5f8cfdopen()\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002

FunctionUsageAudit.lstat.description=\u3053\u306e\u95a2\u6570\u306f\u3001\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3059\u308b\u304b\u3069\u3046\u304b\u306e\u30c1\u30a7\u30c3\u30af\u306b\u306f\u9069\u3057\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u306e\u5f8c\u306bopen()\u304c\u7d9a\u304f\u3068\u3001\u89e3\u6c7a\u3067\u304d\u306a\u3044\u56fa\u6709\u306e\u7af6\u5408\u72b6\u614b\u304c\u767a\u751f\u3057\u307e\u3059\u3002

FunctionUsageAudit.bcopy.description=\u9577\u3055\u304c\u308f\u304b\u3063\u3066\u3044\u3066\u3082\u3001\u6587\u5b57\u5217\u306e\u30b3\u30d4\u30fc\u306b\u306f\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002

FunctionUsageAudit.catopen.description=\u30e9\u30a4\u30d6\u30e9\u30ea\u304a\u3088\u3073\u30d7\u30ed\u30b0\u30e9\u30e0\u3067\u30e6\u30fc\u30b6\u30fc\u304c\u6307\u5b9a\u3057\u305f\u30d1\u30b9\u540d\u306b\u5bfe\u3057\u3066catopen()\u3092\u547c\u3073\u51fa\u305b\u307e\u305b\u3093\u3002\n\u30e6\u30fc\u30b6\u30fc\u304c\u6307\u5b9a\u3057\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ab\u30bf\u30ed\u30b0\u3092\u5229\u7528\u3059\u308b\u3068\u3001\u7c21\u5358\u306b\u6a29\u9650\u4ed8\u304d\u30b3\u30fc\u30c9\u3092\u5206\u985e\u3067\u304d\u307e\u3059\u3002

FunctionUsageAudit.chdir.description=\u3053\u306e\u95a2\u6570\u306f\u30d1\u30b9\u540d\u306e\u7af6\u5408\u72b6\u614b\u3092\u8d77\u3053\u3057\u3084\u3059\u3044\u3067\u3059\u3002\u30de\u30eb\u30c1\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30ed\u30b0\u30e9\u30e0\u3067\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\n\u7af6\u5408\u72b6\u614b\u306b\u306a\u3089\u306a\u3044\u3088\u3046\u306b\u3059\u308b\u306b\u306f\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092open()\u3057\u3001fstat()\u3092\u4f7f\u7528\u3057\u3066\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u30c1\u30a7\u30c3\u30af\u3057\u305f\u5f8c\u3001fchdir()\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002

FunctionUsageAudit.chroot.description=chroot\u3055\u308c\u305f\u74b0\u5883\u306f\u4fdd\u8b77\u304c\u5341\u5206\u3067\u306f\u306a\u304f\u3001\u30d7\u30ed\u30b0\u30e9\u30e0\u306f\u7c21\u5358\u306b\u56de\u907f\u3067\u304d\u307e\u3059\u3002chroot()\u3057\u305f\u74b0\u5883\u3067\u6a29\u9650\u4ed8\u304d\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5b9f\u884c\u3057\u306a\u3044\u3053\u3068\u3001\n\u304a\u3088\u3073chroot()\u5f8c\u306e\u65b0\u3057\u3044\u30eb\u30fc\u30c8\u306e\u4e0b\u306e\u30dd\u30a4\u30f3\u30c8\u306bchdir()\u3057\u305f\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

FunctionUsageAudit.copylist.description=\u3053\u306e\u95a2\u6570\u3067\u306f\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304d\u307e\u3059\u3002\u5b89\u5168\u3067\u3042\u308b\u3068\u308f\u304b\u3063\u3066\u3044\u308b\u30d1\u30b9\u540d\u3092\u958b\u304f\u969b\u306b\u306e\u307f\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

FunctionUsageAudit.dlopen.description=dlopen\u306b\u6e21\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u306b\u306f\u3001\u5f8c\u3067\u5b9f\u884c\u6642\u30ea\u30f3\u30ab\u30fc\u306e\u30d1\u30b9\u3092\u4f7f\u7528\u3057\u3066\u898b\u3064\u304b\u308b\u975e\u4fee\u98fe\u30d1\u30b9\u540d\u3001\u307e\u305f\u306f\u30e6\u30fc\u30b6\u30fc\u5165\u529b(argv[0]\u3092\u542b\u3080)\n\u304b\u3089\u5c0e\u51fa\u3055\u308c\u305f\u3082\u306e\u3067\u306f\u306a\u3044\u5b8c\u5168\u30d1\u30b9\u540d\u306e\u307f\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30e6\u30fc\u30b6\u30fc\u304c\u6307\u5b9a\u3057\u305f\u5171\u6709\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u5b89\u5168\u306b\u958b\u304f\u65b9\u6cd5\u306f\u3042\u308a\u307e\u305b\u3093\u3002\n\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e_init()\u95a2\u6570\u306f\u3001dlopen()\u304b\u3089\u623b\u308b\u524d\u306b\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002

FunctionUsageAudit.execl.description=\u65b0\u3057\u3044\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u5b9f\u884c\u3059\u308b\u524d\u306b\u3001\u74b0\u5883\u304c\u7121\u5bb3\u5316\u3055\u308c\u3001\u4e0d\u8981\u306a\u30d5\u30a1\u30a4\u30eb\u30fb\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf\u304c\u9589\u3058\u3089\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

FunctionUsageAudit.fattach.description=\u958b\u304f\u524d\u306e\u30d1\u30b9\u540d\u3067\u306f\u306a\u304f\u3001\u958b\u3044\u305f\u5f8c\u306e\u30d5\u30a1\u30a4\u30eb\u30fb\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf\u3092\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059(fstat()\u3092\u4f7f\u7528)\u3002

FunctionUsageAudit.printf.description=\u30e6\u30fc\u30b6\u30fc\u6307\u5b9a\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u306e\u30ea\u30b9\u30af\u304c\u3042\u308a\u307e\u3059\u3002\n\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ab\u30bf\u30ed\u30b0\u304b\u3089\u751f\u6210\u3055\u308c\u305f\u5834\u5408\u306f\u3001NLSPATH\u306e\u64cd\u4f5c\u304a\u3088\u3073catopen()/catget()\u306e\u4f7f\u7528\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002

FunctionUsageAudit.snprintf.description=\u30e6\u30fc\u30b6\u30fc\u6307\u5b9a\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u306e\u30ea\u30b9\u30af\u304c\u3042\u308a\u307e\u3059\u3002\n\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ab\u30bf\u30ed\u30b0\u304b\u3089\u751f\u6210\u3055\u308c\u305f\u5834\u5408\u306f\u3001NLSPATH\u306e\u64cd\u4f5c\u304a\u3088\u3073catopen()/catget()\u306e\u4f7f\u7528\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\nsnprintf()\u304a\u3088\u3073vsnprintf()\u3067\u306f\u3001\u30d0\u30c3\u30d5\u30a1\u30fb\u30b5\u30a4\u30ba\u304c\u5341\u5206\u3060\u3063\u305f\u5834\u5408\u306b\u66f8\u304d\u8fbc\u307e\u308c\u305f\u3067\u3042\u308d\u3046\u6587\u5b57\u6570\u3092\u8fd4\u3057\u307e\u3059\u3002\n\u6ce8\u610f: \u3069\u306e\u5f15\u6570\u3082\u51fa\u529b\u30d0\u30c3\u30d5\u30a1\u3092\u6307\u3057\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

FunctionUsageAudit.swprintf.description=\u30e6\u30fc\u30b6\u30fc\u6307\u5b9a\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u306e\u30ea\u30b9\u30af\u304c\u3042\u308a\u307e\u3059\u3002\n\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ab\u30bf\u30ed\u30b0\u304b\u3089\u751f\u6210\u3055\u308c\u305f\u5834\u5408\u306f\u3001NLSPATH\u306e\u64cd\u4f5c\u304a\u3088\u3073catopen()/catget()\u306e\u4f7f\u7528\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\n\u6ce8\u610f: \u3069\u306e\u5f15\u6570\u3082\u51fa\u529b\u30d0\u30c3\u30d5\u30a1\u3092\u6307\u3057\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

FunctionUsageAudit.syslog.description=\u30e6\u30fc\u30b6\u30fc\u6307\u5b9a\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u306e\u30ea\u30b9\u30af\u304c\u3042\u308a\u307e\u3059\u3002\n\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u6587\u5b57\u5217\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ab\u30bf\u30ed\u30b0\u304b\u3089\u751f\u6210\u3055\u308c\u305f\u5834\u5408\u306f\u3001NLSPATH\u306e\u64cd\u4f5c\u304a\u3088\u3073catopen()/catget()\u306e\u4f7f\u7528\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002

FunctionUsageAudit.scanf.description=\u6587\u5b57\u5217\u3092\u30b9\u30ad\u30e3\u30f3\u3057\u3066\u3044\u308b\u3068\u304d\u306b\u3001\u6307\u5b9a\u3055\u308c\u305f\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306b\u6700\u5927\u306e\u30d0\u30c3\u30d5\u30a1\u9577\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\n\u7d42\u4e86NUL\u6587\u5b57\u5206\u3092\u8003\u616e\u3057\u3001\u5bfe\u5fdc\u3059\u308b\u30d0\u30c3\u30d5\u30a1\u306e\u30b5\u30a4\u30ba\u3092\u5c11\u306a\u304f\u3068\u30821\u30d0\u30a4\u30c8\u5927\u304d\u304f\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u3053\u3068\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002

FunctionUsageAudit.ftw.description=\u30b7\u30f3\u30dc\u30ea\u30c3\u30af\u30fb\u30ea\u30f3\u30af\u306b\u5f93\u3044\u3001\u30de\u30a6\u30f3\u30c8\u30fb\u30dd\u30a4\u30f3\u30c8\u3092\u8d85\u3048\u307e\u3059\u3002\n\u9069\u5207\u306a\u30d5\u30e9\u30b0(FTW_PHYS\u3068FTW_MOUNT\u306e\u7d44\u5408\u305b)\u3092\u8a2d\u5b9a\u3057\u3066\u3001nftw\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002

FunctionUsageAudit.getenv.description=\u74b0\u5883\u306f\u5b8c\u5168\u306b\u30e6\u30fc\u30b6\u30fc\u6307\u5b9a\u3067\u3059\u3002\u53ef\u80fd\u306a\u5834\u5408\u3001\u30e9\u30a4\u30d6\u30e9\u30ea\u3067getenv()\u306e\u4f7f\u7528\u3092\u907f\u3051\u307e\u3059\u3002\ngetenv()\u306b\u3088\u3063\u3066\u8fd4\u3055\u308c\u308b\u6587\u5b57\u5217\u306f\u6700\u5927NCARGS\u30d0\u30a4\u30c8\u9577\u3067\u3059(\u73fe\u5728\u306f32\u30d3\u30c3\u30c8\u74b0\u5883\u306e\u5834\u54081MB\u3067\u3059\u3002) \n\u74b0\u5883\u5909\u6570\u304b\u3089\u5c0e\u51fa\u3055\u308c\u308b\u30d1\u30b9\u540d\u306f\u4fe1\u983c\u3067\u304d\u307e\u305b\u3093\u3002\n\u3044\u304b\u306a\u308b*open()\u95a2\u6570(catopen()\u304a\u3088\u3073dlopen()\u3092\u542b\u3080)\u306e\u5165\u529b\u3068\u3057\u3066\u3082\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002

FunctionUsageAudit.mkdir.description=\u4f7f\u7528\u3059\u308b\u30d1\u30b9\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u3053\u306e\u95a2\u6570\u306f\u6700\u5f8c\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306esymlink\u306b\u5f93\u308f\u306a\u3044\u305f\u3081\u3001\u6bd4\u8f03\u7684\u5b89\u5168\u3067\u3059\u3002

FunctionUsageAudit.strccpy.description=\u3053\u308c\u3089\u306e\u95a2\u6570\u3092\u6700\u5927\u30d0\u30c3\u30d5\u30a1\u30fb\u30b5\u30a4\u30ba\u306b\u5236\u9650\u3067\u304d\u307e\u305b\u3093\u3002\n\u3053\u308c\u3089\u306e\u95a2\u6570\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u5e38\u306b\u30ec\u30d3\u30e5\u30fc\u30a2\u306f\u305d\u306e\u30ed\u30b8\u30c3\u30af\u306b\u5f93\u3046\u3053\u3068\u3092\u5f37\u5236\u3055\u308c\u3001\u30bd\u30fc\u30b9\u30fb\u30b3\u30fc\u30c9\u306e\u8106\u5f31\u6027\u306e\u81ea\u52d5\u30b9\u30ad\u30e3\u30f3\u304c\u56de\u907f\u3055\u308c\u307e\u3059\u3002

FunctionUsageAudit.umask.description=\u30e9\u30a4\u30d6\u30e9\u30ea\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\n\u30e6\u30fc\u30b6\u30fc\u304c\u6700\u3082\u3088\u304f\u77e5\u3063\u3066\u304a\u308a\u3001\u30e6\u30fc\u30b6\u30fc\u306eumask\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30de\u30eb\u30c1\u30b9\u30ec\u30c3\u30c9\u30fb\u30bb\u30fc\u30d5\u3067\u3082\u3042\u308a\u307e\u305b\u3093\u3002


