# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

OpenIDE-Module-Display-Category=Web Services
OpenIDE-Module-Long-Description=Declara\u00e7\u00e3o dos Web Services StrikeIron como componentes do Web service RESTful
OpenIDE-Module-Name=Servi\u00e7os StrikeIron

OpenIDE-Module-Short-Description=Componente de servi\u00e7o StrikeIron


AddressVerification60_Name=Verifica\u00e7\u00e3o de endere\u00e7o 40
EmailVerify50_Name=Verifica\u00e7\u00e3o de e-mail 30
IPAddressLookup_Name=Pesquisa de endere\u00e7o IP
ReversePhoneLookup_Name=Pesquisa reversa de telefone
SalesandUseTaxComplete5_Name=Imposto completo 40
ZipCode_Name=CEP

AddressVerification60_Desc=<html>O Web service inspeciona cada elemento de um endere\u00e7o para garantir a sua validade e, <br/>usando tecnologia de padroniza\u00e7\u00e3o de dados e correspond\u00eancia sofisticadas, atualiza os <br/>endere\u00e7os incorretos de acordo com os regras postais. O StrikeIron inspeciona <br/>n\u00fameros de casas, endere\u00e7os de rua, nomes de rua, tipos de rua, n\u00fameros de apartamento e <br/>caixas postais para garantir a precis\u00e3o de cada elemento e endere\u00e7os padronizados <br/>de acordo com as regras da autoridade postal. O StrikeIron tamb\u00e9m corrige <br/>erros de nome de rua, valida extens\u00f5es de tipo de rua, padroniza nomes de cidade e <br/>nomes de estado e acrescenta abrevia\u00e7\u00f5es de estado ausentes. O Web service pode ser <br/>chamado por um \u00fanico endere\u00e7o ou como um processo batch.</html>

EmailVerify50_Desc=<html>O Web service de verifica\u00e7\u00e3o de e-mail StrikeIron determina instantaneamente a validade de um endere\u00e7o de e-mail <br/>ou dom\u00ednio. Forne\u00e7a simplesmente um endere\u00e7o de e-mail e este Web service <br/>retornar\u00e1 verdadeiro ou falso, entrando em contato com os servidores SMTP dos donos de e-mail para validar <br/>um endere\u00e7o sem enviar um e-mail. </html>

IPAddressLookup_Desc=<html>Este Web service fornece o endere\u00e7o IP ao ser informado do nome de um servidor Web. <br/>Por exemplo, www.anywebserver.com retornaria 256.1.1.56.</html>

ReversePhoneLookup_Desc=<html>A pesquisa de telefone inversa: Web service de precis\u00e3o de 90 dias fornece uma interface program\u00e1tica <br/>para nomear e endere\u00e7ar dados associados a qualquer n\u00famero de telefone. Atualizado durante a noite, <br/>sua precis\u00e3o dura os \u00faltimos 90 dias de altera\u00e7\u00f5es.</html>

SalesandUseTaxComplete50_Desc=<html>As vendas de sistemas de dados de imposto StrikeIron e os Web Services de imposto de uso fornecem uma interface program\u00e1tica para <br/>vendas on-line e dados de imposto de uso. Simplesmente forne\u00e7a um CEP norte-americano ou c\u00f3digo postal canadense <br/>e ele ser\u00e1 comparado instantaneamente com as vendas gerais e os n\u00edveis de taxa de imposto de uso<br/>do estado, munic\u00edpio, cidade, MTA, SPD, etc. Os dados de imposto s\u00e3o fornecidos <br/>on-line atrav\u00e9s de um Web service baseado em XML diretamente em qualquer aplica\u00e7\u00e3o, plataforma, <br/>produto ou Web site.</html>

ZipCode_Desc=<html>O Web service de informa\u00e7\u00f5es de CEP StrikeIron recupera instantaneamente a cidade, estado, munic\u00edpio, latitude, <br/>longitude e fuso hor\u00e1rio de um determinado CEP norte-americano ou c\u00f3digo postal canadense.</html>

