<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>Exemples de formulaires de l''interface graphique</title>
<!--      Copyright (c) 2007 Sun Microsystems, Inc. All rights reserved. -->
<!--     Use is subject to license terms.-->
        <link rel="stylesheet" type="text/css" href="netbeans.css" media="screen">

</head>
<body>
<br>
<h1 align="">Description de l'exemple de formulaire de l''interface graphique</h1>
<p>

Ce projet contient trois formulaires visuels qui sont con&ccedil;us avec le g&eacute;n&eacute;rateur d''interface graphique. </p>
<p><strong>Pour ouvrir un exemple de formulaire dans le g&eacute;n&eacute;rateur d''interface graphique :</strong></p>
<ol>
  <li>Dans la fen&ecirc;tre Projets de l''IDE, naviguer vers le noeud de paquetage par d&eacute;faut &agrave; l'int&eacute;rieur de <br>
    R&eacute;pertoire des paquetages de source.</li>
  <br>
  <li>Double cliquer sur le noeud de l''exemple de formulaire que vous voulez voir.
    <p>L''IDE lance le g&eacute;n&eacute;rateur d''interface graphique et affiche le formulaire choisi.
  </p></li>
</ol>

<br>

<h2>&Eacute;diteur de contact</h2>
<p>Ce formulaire complexe ressemble aux boites de dialogue utilis&eacute;es pour afficher et &eacute;diter l''information d''une base de donn&eacute;es. Ce exemple illustre la large gamme de fonctionnalit&eacute;s du g&eacute;n&eacute;rateur d''interface graphique comme l''alignement, l''ancrage, le dimensionnement, l''indexation et l''auto-dimensionnement du runtime. Pour regarder un tutoriel d&eacute;taill&eacute; incluant les d&eacute;monstrations flash qui montre comment concevoir ce formulaire, voir <a href="http://netbeans.org/kb/60/java/quickstart-gui.html">Concevoir un interface graphique utilisateur Swing dans l''EDI Netbeans </a>.</p>

<br>

<h2>Antenne Pr&eacute;f&eacute;rences</h2>
<p>Cet exemple illustre un type de formulaire bas&eacute; table g&eacute;n&eacute;ralement utilis&eacute; pour afficher  une information relative &agrave; des groupes visuellement coh&eacute;rent. Les fonctionnalit&eacute;s avanc&eacute;es du g&eacute;n&eacute;rateur d''interface graphique vous permettent de grouper et dimensionner les composants non-adjacents ( tels que les &eacute;tiquettes, les zones de textes et les boutons) toujours sans avoir &agrave; fusionner les cellules manuellement.
</p>

<br>

<h2>Rechercher</h2>
<p>Ce formulaire simple illustre une mise en place simple souvent utilis&eacute;e dans diverses applications n&eacute;cessitant une fonctionnalit&eacute; de recherche basique. Le fonctionnalit&eacute;s de dimensionnement et d''alignement du g&eacute;n&eacute;rateur d''interface graphique vous permettent de construire rapidement de tels formulaires en assurant qu''on traduise de fa&ccedil;on pr&eacute;visible.
</p>

</body>
</html>
