OpenIDE-Module-Display-Category=Base de donn\u00e9es
OpenIDE-Module-Long-Description=Ce module fournit \u00e0 NetBeans des fonctionnalit\u00e9s sp\u00e9cifiques aux bases de donn\u00e9es MySQL.  Ceci inclut la gestion de base d'un serveur local et toute autre fonctionnalit\u00e9 que nous pensons importante.
OpenIDE-Module-Name=Prise en charge des bases de donn\u00e9es MySQL
OpenIDE-Module-Short-Description=Fournit \u00e0 NetBeans une prise en charge sp\u00e9cifique pour MySQL

#Installer
MSG_RegisterMySQL=Recherche d'un serveur de base de donn\u00e9es MySQL local

#ServerNode
# Run states
DISCONNECTED=(d\u00e9connect\u00e9)
CONNECTED=
CONFIGERR=(erreur de configuration)

LBL_ServerDisplayName=Serveur MySQL \u00e0 {0} [{1}] {2}
LBL_ServerShortDescription=Instance de serveur MySQL sur {0} [utilisateur {1}] {2}
LBL_ServerShortDescriptionError=Erreur dans la configuration MySQL: {0}

MSG_UnableToGetDatabaseList=Impossible de r\u00e9cup\u00e9rer la liste des bases de donn\u00e9es depuis le serveur MySQL.

#DatabaseNode
LBL_DBNodeShortDescription=Base de donn\u00e9es MySQL {0}

#DatabaseUtils
MSG_JDBCDriverNotRegistered=Le pilote JDBC pour MySQL n'est pas enregistr\u00e9
MSG_UnableToLoadJDBCDriver=Impossible de charger le pilote JDBC
MSG_NotEnoughInformationToConnect=Les informations fournies pour se connecter au serveur MySQL sont insuffisantes.  Veuillez v\u00e9rifier les propri\u00e9t\u00e9s MySQL et r\u00e9essayer

#PropertiesAction
LBL_PropertiesAction=Propri\u00e9t\u00e9s...

#RegisterServerAction
LBL_RegisterServerAction=Enregistrer un serveur MySQL...

#RefreshServerAction
LBL_RefreshServerAction=Rafra\u00eechir

#CreateDatabaseAction
LBL_CreateDatabaseAction=Cr\u00e9er une base de donn\u00e9es...

#DeleteDatabaseAction
MSG_ErrorDeletingDatabase=Impossible de d\u00e9truire la base de donn\u00e9es {0}

#ConnectAction
LBL_ConnectAction=Se connecter...

#Utils
MSG_SeeErrorLog=Consulter le log des erreurs pour plus d'informations

#DatabaseUtils
ERR_MySQLCommunicationFailure=Impossible de communiquer avec le serveur MySQL.  Veuillez v\u00e9rifier qu'il est lanc\u00e9 et que votre h\u00f4te et le port sont correctement renseign\u00e9s.
MSG_ErrorDialogTitle=Erreur

MSG_ConnectingToServer=Essai de connexion au serveur MySQL
MSG_ReconnectingToServer=Reconnexion au serveur MySQL
MSG_UnableToConnect=Impossible de se connecter au serveur MySQL.  Veuillez v\u00e9rifier vos param\u00e8tres dans les Propri\u00e9t\u00e9s puis r\u00e9essayer.

#ConnectServerAction
LBL_ConnectServerAction=Se connecter

#DisconnectServerAction
LBL_DisconnectServerAction=Se d\u00e9connecter

#StartAction
LBL_StartAction=D\u00e9marrer
MSG_UnableToStartServer=Impossible de d\u00e9marrer le serveur MySQL.  Veuillez v\u00e9rifier vos param\u00e8tres et r\u00e9essayer.
MSG_NoStopPath=Le chemin de la commande de d\u00e9marrage de MySQL n'est pas d\u00e9fini.  Voulez-vous \u00e9diter les propri\u00e9t\u00e9s du serveur pour d\u00e9finir ce chemin?

#StopAction
LBL_StopAction=Arr\u00eater
MSG_ServerStopped=Le serveur a \u00e9t\u00e9 arr\u00eat\u00e9
MSG_UnableToStopServer=Erreur dans l'arr\u00eat du serveur MySQL
MSG_NoStartPath=Le chemin de la commande de d\u00e9marrage de MySQL n'est pas d\u00e9fini.  Voulez-vous \u00e9diter les propri\u00e9t\u00e9s du serveur pour d\u00e9finir ce chemin?

#AdministerAction
LBL_AdministerAction=Ex\u00e9cuter l'outil d'administration
MSG_NoAdminPath=Le chemin/l'URL de l'outil d'administration MySQL n'est pas d\u00e9fini.  Voulez-vous \u00e9diter les propri\u00e9t\u00e9s du serveur pour d\u00e9finir ce chemin?
MSG_ErrorStartingAdminTool=Il s'est produit une erreur dans le d\u00e9marrage de l'outil d'administration

#ServerInstance
MSG_NoSuchSample=Le nom {0} n'est pas reconnu comme nom d'une base de donn\u00e9es d'exemple.
MSG_ErrorLoadingSampleSQL=Impossible de charger le SQL pour l''exemple {0}: {1}
MSG_ErrorExecutingSampleSQL=Erreur dans l''ex\u00e9cution du SQL pour l''exemple {0}: {1}
MSG_AdminCommandNotSet=Le chemin de la commande admin n'est pas d\u00e9fini.  Veuillez utiliser le dialogue Propri\u00e9t\u00e9s MySQL pour d\u00e9finir ce chemin.
MSG_InvalidAdminCommand=La commande admin {0} n''est pas une URL ni un chemin valide.  Choisissez Propri\u00e9t\u00e9s et s\u00e9lectionnez l'onglet Admin pour ajuster le chemin.
MSG_InvalidStartCommand=La commande de d\u00e9marrage {0} n''est pas un fichier valide.  Choisissez Propri\u00e9t\u00e9s et s\u00e9lectionnez l'onglet Admin pour ajuster le chemin.
MSG_InvalidStopCommand=La commande d''arr\u00eat {0} n''est pas un fichier valide.  Choisissez Propri\u00e9t\u00e9s et s\u00e9lectionnez l'onglet Admin pour ajuster le chemin.
LBL_MySQLOutputTab=Commandes du serveur MySQL
LBL_StoppingMySQLServer=Arr\u00eat du serveur MySQL

