# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.
#
# Contributor(s):
#
# Portions Copyrighted 2008 Sun Microsystems, Inc.

ACT_OPEN_FILE_START=O arquivo afetado foi aberto.
ACT_start_validate=A constru\u00e7\u00e3o prim\u00e1ria foi iniciada.
ACT_validate=Constru\u00e7\u00e3o Prim\u00e1ria
# {0} - full directory path
build_details=Executar constru\u00e7\u00e3o prim\u00e1ria em {0}
# {0} - directory name of reactor
build_label=Principal {0}
# {0} - directory basename
build_title=Construir {0}
# {0} - jdk platform id
DESC_No_such_JDK=N\u00e3o h\u00e1 uma Plataforma Java com o valor "{0}" definido no IDE atual. A plataforma padr\u00e3o ser\u00e1 usada. Para corrigir, introduza uma Plataforma Java com o nome fornecido ou altere a Plataforma Java usada do projeto.
ERR_MissingApisupportModule=Sem suporte aos Projetos de M\u00f3dulos do NetBeans Maven
ERR_MissingJ2eeModule=Sem suporte a Maven Java EE
ERR_NonLocal=Alguns artefatos de depend\u00eancia n\u00e3o est\u00e3o no reposit\u00f3rio local.
ERR_NoParent=O arquivo POM pai n\u00e3o est\u00e1 acess\u00edvel. O projeto pode estar configurado de forma impr\u00f3pria.
ERR_Participant=Participante(s) da constru\u00e7\u00e3o personalizada encontrados
ERR_SystemScope=N\u00e3o foi localizada uma depend\u00eancia de escopo do 'sistema'. A funcionalidade autocompletar c\u00f3digo foi afetada.
LBL_Problems=&Problemas:
LBL_Description=&Descri\u00e7\u00e3o:
# {0} - jdk platform id
MGS_No_such_JDK=N\u00e3o existe tal Plataforma Java: {0}
MSG_MissingApisupportModule=O m\u00f3dulo de Projetos do M\u00f3dulo Maven NetBeans n\u00e3o foi encontrado em sua instala\u00e7\u00e3o. Isso significa que todas as funcionalidades da Plataforma NetBeans (por exemplo, assistentes de API, aplica\u00e7\u00f5es de Plataforma em execu\u00e7\u00e3o) n\u00e3o foram encontrados. A causa mais prov\u00e1vel \u00e9 que a parte de suporte geral ao desenvolvimento da Plataforma tamb\u00e9m n\u00e3o tenha sido encontrada. V\u00e1 para Ferramentas/Plugins e instale os plugins relacionados ao desenvolvimento do NetBeans.
MSG_MissingJ2eeModule=O m\u00f3dulo de suporte do Maven Java EE n\u00e3o foi encontrado em sua instala\u00e7\u00e3o. Isso significa que todas as funcionalidades relacionadas ao EE (como Implanta\u00e7\u00e3o, modelos de Arquivo) n\u00e3o foram encontradas. A causa mais prov\u00e1vel \u00e9 que a parte de suporte geral ao Java EE tamb\u00e9m n\u00e3o tenha sido encontrada. V\u00e1 para Ferramentas/Plugins e instale os plugins relacionados ao Java EE.
# {0} - list of artifacts
MSG_NonLocal=Seu projeto tem depend\u00eancias n\u00e3o resolvidas localmente. A funcionalidade autocompletar c\u00f3digo do IDE n\u00e3o incluir\u00e1 classes dessas depend\u00eancias ou das depend\u00eancias transitivas (a n\u00e3o ser que estejam entre os projetos abertos).\nFa\u00e7a download das depend\u00eancias ou instale-as manualmente, se n\u00e3o estiverem dispon\u00edveis remotamente.\n\nOs artefatos s\u00e3o:\n {0}
# {0} - Maven coordinates
MSG_NoParent=O POM pai com o id {0} n\u00e3o foi localizado nos c\u00f3digos-fonte ou no reposit\u00f3rio local. Verifique se a tag <relativePath> est\u00e1 presente e correta, a vers\u00e3o do POM pai nos c\u00f3digos-fonte coincide com a vers\u00e3o definida. \nSe o pai estiver dispon\u00edvel apenas atrav\u00e9s de um reposit\u00f3rio remoto, verifique se o reposit\u00f3rio que o est\u00e1 hospedando est\u00e1 definido no POM atual.
MSG_Participant=O IDE n\u00e3o executar\u00e1 nenhum c\u00f3digo de extens\u00e3o de terceiros durante o carregamento do projeto Maven.\nEsses c\u00f3digos podem ter influ\u00eancia significativa no desempenho do (re)carregamento do modelo Maven com a pr\u00f3pria base de c\u00f3digo do IDE. por outro lado, o modelo carregado pode ser incompleto se sua participa\u00e7\u00e3o. Nesse projeto, descobrimos os seguintes participantes da constru\u00e7\u00e3o externa:\n{0}
MSG_SystemScope=H\u00e1 uma depend\u00eancia de escopo do 'sistema' no projeto, mas o caminho para o bin\u00e1rio n\u00e3o \u00e9 v\u00e1lido.\nVerifique se o caminho \u00e9 absoluto e aponta para um bin\u00e1rio existente.
TXT_Artifact_Not_Found=Artefato N\u00e3o Localizado
TXT_Artifact_Resolution_problem=Problema na Resolu\u00e7\u00e3o\u00b7do Artefato
TXT_Cannot_Load_Project=N\u00e3o \u00e9 poss\u00edvel carregar o projeto corretamente
TXT_Cannot_read_model=Erro ao ler o modelo de projeto
TXT_No_Res=Nenhuma resolu\u00e7\u00e3o para o problema
TXT_NoMsg=Exce\u00e7\u00e3o lan\u00e7ada ao carregar projeto do maven em {0}. Consulte messages.log para obter mais informa\u00e7\u00f5es.
TXT_OPEN_FILE=Abrir Arquivo

