# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

MSG_Deployment_Failed=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Deployment_Completed=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002
MSG_Deployment_Failed_With_Message=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Deployment_Failed_Timeout=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Deployment_Failed_Interrupted=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Deploying={0}\u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059
MSG_SearchingTargets=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u691c\u7d22\u4e2d: {0}

MSG_Failed_No_Target=\u6307\u5b9a\u3055\u308c\u305f\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u4e00\u90e8\u304c\u30b5\u30fc\u30d0\u30fc\u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002

MSG_Redeployment_Started=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Redeployment_Failed=\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Redeployment_Completed=\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002
MSG_Redeployment_Failed_With_Message=\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Redeployment_Failed_Timeout=\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Redeployment_Failed_Interrupted=\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Redeploying={0}\u3092\u518d\u30c7\u30d7\u30ed\u30a4\u3057\u307e\u3059
MSG_Redeployment_Failed_Modules=\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u4e00\u90e8\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u518d\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

MSG_Undeployment_Failed=\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Undeployment_Completed=\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002
MSG_Undeployment_Failed_With_Message=\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Undeployment_Failed_Timeout=\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Undeployment_Failed_Interrupted=\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Undeploying={0}\u3092\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059
MSG_Undeployment_Started=\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002

MSG_Start_Started=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u8d77\u52d5\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Starting={0}\u3092\u8d77\u52d5\u4e2d
MSG_Start_Failed_With_Message=\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Start_Failed_Timeout=\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Start_Failed_Interrupted=\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Start_Failed=\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Start_Completed=\u8d77\u52d5\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002

MSG_Stop_Started=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u505c\u6b62\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Stopping={0}\u3092\u505c\u6b62\u4e2d
MSG_Stop_Failed_With_Message=\u505c\u6b62\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Stop_Failed_Timeout=\u505c\u6b62\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Stop_Failed_Interrupted=\u505c\u6b62\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Stop_Failed=\u505c\u6b62\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Stop_Completed=\u505c\u6b62\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002

MSG_Application_Start_Failed=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u8d77\u52d5\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u8cc7\u683c\u60c5\u5831\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_Application_Stop_Failed=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u505c\u6b62\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u8cc7\u683c\u60c5\u5831\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

MSG_Waiting_For_Url=\u30b5\u30fc\u30d0\u30fc\u304c\u30e2\u30b8\u30e5\u30fc\u30eb{0}\u3092\u8d77\u52d5\u3059\u308b\u306e\u3092\u5f85\u3063\u3066\u3044\u307e\u3059...
MSG_Application_Started_Already=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u81ea\u52d5\u30c7\u30d7\u30ed\u30a4\u306b\u3088\u3063\u3066\u3059\u3067\u306b\u8d77\u52d5\u3055\u308c\u3066\u3044\u307e\u3059\u3002

MSG_CheckingMissingDrivers=\u5b58\u5728\u3057\u306a\u3044JDBC\u30c9\u30e9\u30a4\u30d0\u306e\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u5b9a\u7fa9\u3092\u78ba\u8a8d\u3057\u3066\u3044\u307e\u3059...
MSG_DeployingJDBCDrivers=JDBC\u30c9\u30e9\u30a4\u30d0\u3092{0}\u306b\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059
MSG_DeployingJDBCDriversFailed=\u8b66\u544a: JDBC\u30c9\u30e9\u30a4\u30d0\u3092{0}\u306b\u30c7\u30d7\u30ed\u30a4\u3067\u304d\u307e\u305b\u3093\u3002\n{1}\u30d5\u30a9\u30eb\u30c0\u3078\u306e\u66f8\u8fbc\u307f\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_JDBCDriversDeployed=JDBC\u30c9\u30e9\u30a4\u30d0\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002

MSG_Datasource_Started=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u3092\u958b\u59cb\u3057\u307e\u3057\u305f\u3002
MSG_Datasource_Deploying=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9{0}\u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059
MSG_Datasource_Failed_With_Message=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Datasource_Failed_Timeout=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Datasource_Failed_Interrupted=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Datasource_Failed=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Datasource_Completed=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002

MSG_Module_Started={0}\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u3092\u958b\u59cb\u3057\u307e\u3057\u305f\u3002
MSG_Module_Deploying={0} {1}\u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059
MSG_Module_Failed_With_Message={0}\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {1}
MSG_Module_Failed_Timeout={0}\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Module_Failed_Interrupted={0}\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Module_Failed={0}\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {1}
MSG_Module_Completed={0}\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002

MSG_Module_Datasource=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9
MSG_Module_JMS=JMS\u30ea\u30bd\u30fc\u30b9

MSG_Library_Started=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Library_Failed=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Library_Completed=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002
MSG_Library_Failed_With_Message=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
MSG_Library_Failed_Timeout=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u304c\u7d4c\u904e\u3057\u307e\u3057\u305f\u3002
MSG_Library_Failed_Interrupted=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u304c\u5272\u8fbc\u307f\u3055\u308c\u307e\u3057\u305f\u3002
MSG_Library_Deploying=\u30e9\u30a4\u30d6\u30e9\u30ea{0}\u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059

MSG_Enabling_JPA2=JPA 2\u30b5\u30dd\u30fc\u30c8\u3092\u6709\u52b9\u306b\u3057\u3066\u3044\u307e\u3059
MSG_Disabling_JPA2=JPA 2\u30b5\u30dd\u30fc\u30c8\u3092\u7121\u52b9\u306b\u3057\u3066\u3044\u307e\u3059

ERR_UndeployAndRedeploy=\u73fe\u5728\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u30a2\u30fc\u30ab\u30a4\u30d6\u3068\u3057\u3066\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u3092\u5229\u7528\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30a2\u30f3\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u304b\u3089\u518d\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u304f\u3060\u3055\u3044\u3002

