# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

OpenIDE-Module-Display-Category=An\u00e0lisis
OpenIDE-Module-Name=Analitzador de Java (Suport projectes Java SE)
OpenIDE-Module-Long-Description=Extensi\u00f3 per a l'analitzador de NetBeans que proporciona suport per l'an\u00e0lisi de projectes J2SE.

J2SEProjectTypeProfiler_ModifyBuildScriptCaption=Habilitar l''an\u00e0lisi de {0}
J2SEProjectTypeProfiler_ModifyBuildScriptMsg=<html><b>L''analitzador no est\u00e0 integrat al projecte {0}.<br>Cliqueu a Acceptar per realitzar la integraci\u00f3.</b><br><br>Com a part del proc\u00e9s d'integraci\u00f3, l'script de construcci\u00f3 del projecte ser\u00e0 modificat.<br>El fitxer original ser\u00e0 resguardat com {1}.<br><br>Nota: Podeu desfer la integraci\u00f3 de l''analitzador tot invocant des de la barra de men\u00fa<br>principal: An\u00e0lisi | Comandes Avan\u00e7ades | Des-integrar analitzador.</html>
J2SEProjectTypeProfiler_RegenerateBuildScriptMsg=L''script de construcci\u00f3 {0} ha estat modificat.\nAquest necessita ser regenerat per a continuar amb l'an\u00e0lisi.\n\nVoleu continuar?
J2SEProjectTypeProfiler_CannotFindBuildScriptMsg=No es pot trobar el fitxer del projecte {0}.
J2SEProjectTypeProfiler_CannotBackupBuildScriptMsg=L'script de construcci\u00f3 del projecte no pot ser resguardat. Encara voleu continuar?
J2SEProjectTypeProfiler_ModifyBuildScriptManuallyMsg=El fitxer del projecte {0} no pot modificar-se autom\u00e0ticament per a l''an\u00e0lisi. Hi heu d''inserir manualment la seg\u00fcent cl\u00e0usula d''importaci\u00f3\:\n{1}\nRealitzeu aquest canvi i torneu a iniciar un altre cop l''an\u00e0lisi.
J2SEProjectTypeProfiler_ProjectCategory=Projecte
J2SEProjectTypeProfiler_ListenersCategory=Escoltadors AWT i Swing
J2SEProjectTypeProfiler_PaintersCategory=Dibuixants AWT i Swing
J2SEProjectTypeProfiler_IoCategory=E/S Java
J2SEProjectTypeProfiler_FilesCategory=Fitxers
J2SEProjectTypeProfiler_SocketsCategory=Sockets

JavaApplicationIntegrationProvider_Title=Aplicaci\u00f3 Java
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteStep3Message=Executeu l''aplicaci\u00f3 utilitzant {0}. Quan s''inicii l''aplicaci\u00f3, proporcioneu el seg\u00fcent valor extra d''inici a la comanda <code>java</code>\:<br><code>{1}</code><br>{2}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteStep4Message=S'iniciar\u00e0 la MVJ, per\u00f2 no continuar\u00e0 amb l'execuci\u00f3 del servidor fins que no connecteu l'analitzador.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteHintMessage=Podeu utilitzar la comanda <code>{0}</code> en comptes de la comanda <code>java</code> per a executar l''aplicaci\u00f3 en mode d'an\u00e0lisi. Comproveu l'script per a qualsevol modificaci\u00f3 addicional d'acord amb la configuraci\u00f3 del vostre sistema.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDirectStep1Message=Executeu l''aplicaci\u00f3 utilitzant {0}. Quan s''inicii l''aplicaci\u00f3, proporcionar el seg\u00fcent valor extra d''inici a la comanda <code>java</code>\:<br><code>{1}</code>
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDirectStep2Message=S'iniciar\u00e0 la MVJ, per\u00f2 no continuar\u00e0 amb l'execuci\u00f3 del servidor fins que no connecteu l'analitzador.
# HTML-formatted
JavaApplicationIntegrationProvider_DynamicWarningMessage=Assegureu-vos que el vostre IDE estigui utilitzant {0}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDynamicStep1Message=Iniciar l''aplicaci\u00f3 utilitzant {0}. 
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDynamicStep2Message=Quan s'estigui executant l'aplicaci\u00f3, cliqueu al bot\u00f3 Adjuntar per a seleccionar el proc\u00e9s del servidor a adjuntar-ho.

JavaAppletIntegrationProvider_Title=Mini-aplicaci\u00f3 Java
JavaAppletIntegrationProvider_AppletWorkDirWindowsMessage=El directori de treball de la mini-aplicaci\u00f3 dep\u00e8n del tipus del vostre navegador. Per a Internet Explorer utilitzeu <%USERPROFILE%>\\Desktop, per Mozilla i Firefox utilitzeu el directori d'instal\u00b7laci\u00f3 del navegador, per a Opera utilitzeu el cam\u00ed on estigui situada la p\u00e0gina html que llan\u00e7a la mini-aplicaci\u00f3.
JavaAppletIntegrationProvider_AppletWorkDirUnixesMessage=Normalment el directori de treball de la mini-aplicaci\u00f3 \u00e9s la localitzaci\u00f3 des d'on el navegador web va iniciar l'execuci\u00f3 de la mini-aplicaci\u00f3.
# HTML-formatted
JavaAppletIntegrationProvider_OperaRemoteAttachWarningMessage=Degut a que el navegador web d'Opera utilitza per a executar mini-aplicacions o b\u00e9 un JRE empaquetat o b\u00e9 un JRE est\u00e0ndard, en lloc d'utilitzar una extensi\u00f3 Java, i a dem\u00e9s tampoc se li poden passar arguments, aquest no pot utilitzar-se per a analitzar remotament mini-aplicacions.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep3Message=Tanqueu totes les finestres i pestanyes del navegador web remot.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep4WindowsMessage=Obriu el panell de control Java des del panell de control de Windows. Obriu la pestanya Java i cliqueu a Visualitzar en l''\u00e0rea de prefer\u00e8ncies de l''entorn d''execuci\u00f3 de mini-aplicacions Java. S'obre el di\u00e0leg de prefer\u00e8ncies de l'entorn d'execuci\u00f3 Java. Cliqueu dues vegades a a cel\u00b7la dels par\u00e0metres de l''entorn d''execuci\u00f3 Java i afegiu la seg\u00fcent cadena de text\:<br><code>{0}</code><br>Si <code>&lt;remote&gt;</code> cont\u00e9 espais, tota la cadena de text ha d''anar entre cometes. Tanqueu el di\u00e0leg utilitzant el bot\u00f3 d'Acceptar i despr\u00e9s en el panell de control de Java cliqueu Acceptar o Aplicar.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep4UnixesMessage=Obriu el panell de control Java del JRE que executar\u00e0 l'an\u00e0lisi de la mini-aplicaci\u00f3 utilitzant la comanda <code>&lt;$JAVA_HOME&gt;/jre/bin/ControlPanel</code>. Obriu la pestanya Java i cliqueu a Visualitzar en l''\u00e0rea de prefer\u00e8ncies de l''entorn d''execuci\u00f3 de mini-aplicacions Java. S''obre el di\u00e0leg de les prefer\u00e8ncies de l''entorn d''execuci\u00f3 Java. Cliqueu dues vegades a a cel\u00b7la dels par\u00e0metres de l''entorn d''execuci\u00f3 Java i afegiu la seg\u00fcent cadena de text\:<br><code>{0}</code><br>Tanqueu el di\u00e0leg utilitzant el bot\u00f3 d''Acceptar, i despr\u00e9s en el panell de control Java cliqueu Acceptar o Aplicar.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep5Message=Iniciar la mini-aplicaci\u00f3 en el navegador web remot. S'obre la finestra del navegador per\u00f2 la mini-aplicaci\u00f3 no s'iniciar\u00e0 fins que connecteu amb l'analitzador.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStopAppletMessage=La MVJ de la mini-aplicaci\u00f3 continuar\u00e0 executant-se fins que l'atureu utilitzant l'acci\u00f3 de separar de l'analitzador o fins que totes les pestanyes del navegador web remot estiguin tancades.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteRestoreSettingsMessage=Haureu de restablir el valor original de la cel\u00b7la dels par\u00e0metres de l'entorn d'execuci\u00f3 de Java en el sistema remot, per a ser capa\u00e7os d'executar les mini-aplicacions sense an\u00e0lisi.
# HTML-formatted
JavaAppletIntegrationProvider_OperaDirectAttachWarningMessage=Degut a que el navegador web d'Opera utilitza per a executar mini-aplicacions o b\u00e9 un JRE empaquetat o b\u00e9 un JRE est\u00e0ndard, en lloc d'utilitzar una extensi\u00f3 Java, i a dem\u00e9s tampoc se li poden passar arguments, aquest no pot utilitzar-se per a analitzar mini-aplicacions utilitzant l'adjunci\u00f3 directa.
# HTML-formatted
JavaAppletIntegrationProvider_ManualLocalStep1Message=Tanqueu totes les finestres i totes les pestanyes del vostre navegador web.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2WindowsMessage=Obriu el panell de control Java Control des del panell de control de Windows. Obriu la pestanya Java i cliqueu a Visualitzar en l''\u00e0rea de prefer\u00e8ncies de l''entorn d''execuci\u00f3 de mini-aplicacions Java. S''obre el di\u00e0leg de les prefer\u00e8ncies de l''entorn d''execuci\u00f3 Java. Cliqueu dues vegades a a cel\u00b7la dels par\u00e0metres de l''entorn d''execuci\u00f3 Java i afegiu la seg\u00fcent cadena de text\:<br><code>{0}</code><br>Tanqueu el di\u00e0leg utilitzant el bot\u00f3 d''Acceptar, i despr\u00e9s en el panell de control Java cliqueu Acceptar o Aplicar.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2UnixesMessage=Obriu el panell de control Java del JRE que executar\u00e0 l''an\u00e0lisi de la mini-aplicaci\u00f3 utilitzant la comanda <code>&lt;$JAVA_HOME&gt;/jre/bin/ControlPanel</code>. Obriu la pestanya Java i cliqueu a Visualitzar en l''\u00e0rea de prefer\u00e8ncies de l''entorn d''execuci\u00f3 de mini-aplicacions Java. S''obre el di\u00e0leg de les prefer\u00e8ncies de l''entorn d''execuci\u00f3 Java. Cliqueu dues vegades a a cel\u00b7la dels par\u00e0metres de l''entorn d''execuci\u00f3 Java i afegiu la seg\u00fcent cadena de text\:<br><code>{0}</code><br>Tanqueu el di\u00e0leg utilitzant el bot\u00f3 d''Acceptar, i despr\u00e9s en el panell de control Java cliqueu Acceptar o Aplicar.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2MacMessage=Obrir el Java Preferences.app localitzat en el directori <code>/Applications/Utilities/Java</code>. Obriu la pestanya General i cliqueu en l''\u00e0rea dels par\u00e0metres de l''entorn d''execuci\u00f3 de Java, i inseriu la seg\u00fcent cadena de text\:<br><code>{0}</code><br>Clique al bot\u00f3 de Desar i sortiu de les prefer\u00e8ncies d''aplicacions Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep3Message=Inicieu la mini-aplicaci\u00f3 al navegador. S'obre la finestra del navegador per\u00f2 la mini-aplicaci\u00f3 no s'iniciar\u00e0 fins que connecteu amb l'analitzador.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStopAppletMessage=La MVJ de la mini-aplicaci\u00f3 continuar\u00e0 executant-se fins que l'atureu utilitzant l'acci\u00f3 de separar de l'analitzador o fins que totes les pestanyes del navegador web estiguin tancades.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectRestoreSettingsMessage=Haureu de restablir el valor original de la cel\u00b7la dels par\u00e0metres de l'entorn d'execuci\u00f3 de Java per a ser capa\u00e7os d'executar les mini-aplicacions sense an\u00e0lisi.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep2WindowsMessage=Obriu el panell de control Java des del panell de control de Windows i assegureu-vos que {0} s''utilitzi per a executar la mini-aplicaci\u00f3 analitzada.<br><br>Nota\: El navegador web Opera no utilitza l'extensi\u00f3 Java per a executar mini-aplicacions Java. Vegeu la documentaci\u00f3 en l\u00ednia d'Opera per a les instruccions de com canviar el JRE utilitzat per a executar mini-aplicacions.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep2UnixesMessage=Assegureu-vos que el vostre navegador tingui establer {0} per a executar l''an\u00e0lisi de la mini-aplicaci\u00f3.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep3Message=Iniciar la mini-aplicaci\u00f3 en el navegador web. Quan s'estigui executant la mini-aplicaci\u00f3, cliqueu a Adjuntar per a seleccionar el proc\u00e9s de la mini-aplicaci\u00f3 a adjuntar-ho.

# new keys
JavaApplicationIntegrationProvider_WorkDirMessage=El directori de reball ser\u00e0 el directori des del qual s'iniciar\u00e0 l'aplicaci\u00f3
NBProfiler/Categories/IO=E/S
NBProfiler/Categories/IO/Files=Fitxers
NBProfiler/Categories/IO/Socket=Socket
NBProfiler/Categories/UI=Interf\u00edcie d'usuari
NBProfiler/Categories/UI/Java2D=Java 2D
NBProfiler/Categories/UI/Listeners=Escoltadors
NBProfiler/Categories/UI/Painters=Dibuixants

