# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 2009-2011 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.
#
# Contributor(s):
#
# Portions Copyrighted 2009-2010 Sun Microsystems, Inc.

MSG_SampleNotSupported=Non foi pos\u00edbel crear un exemplo: non se admite o exemplo "{0}"
MSG_CreatingSampleDBProgressLabel=Creando a base de datos MySQL {0}
MSG_TestFailed=Probar para ver se a conexi\u00f3n MySQL est\u00e1 libre de erros: {0}
MSG_ConnectionLost=Perdeuse a conexi\u00f3n ao servidor MySQL.  Puido rematarse o tempo de conexi\u00f3n, puido perderse a conexi\u00f3n de rede, ou puido aparse o servidor.
MSG_QueryReconnect=Quere tentar reconectarse ao servidor?
MSG_ServerNoLongerRunning=Semella que o servidor SQL non se est\u00e1 executando.  Pode que se detivera ou que se perdera a conexi\u00f3n de rede.  Comproba o estado do servidor MySQL e rein\u00edciao se \u00e9 necesario.
MSG_ServerStillRunning=Semella que a orde Deter non se executou correctamente ou non rematou, polo que o servidor MySQL parece que se est\u00e1 executando.  O servidor a\u00ednda se est\u00e1 apagando, ou prec\u00edsase que axuste as configuraci\u00f3ns para a orde deter, ou pode que sexa preciso deter o servidor manualmente.\n\nQuere agardar a que o servidor se inicie ou prefire modificar as configuraci\u00f3ns da orde deter?
MSG_ConnectFailedAfterStart=Foi impos\u00edbel conectar ao servidor MySQL despois de inicialo: {0}.
MSG_DatabaseCommandFailed=The database command {0} failed with the following exception: {1}
MSG_InvalidPortNumber=O n\u00famero de porto {0} \u00e9 incorrecto.  Edite as propiedades MySQL e cambie o n\u00famero de porto.
MSG_UnknownHost=Equipo desco\u00f1ecido: {0}  Puido caerse a rede ou vostede estabeleceu un nome de equipo incorrecto.
MSG_StartingMySQL=Iniciando servidor MySQL...
MSG_StoppingMySQL=Detendo servidor MySQL...
MSG_ReconnectFailed=Foi impos\u00edbel conectar ao servidor MySQL:\n\n{0}.\n\nPode ser que o servidor non se estea executando ou que as s\u00faas propiedades da conexi\u00f3n MySQL non se estabeleceran correctamente.  Quere editar as propiedades da s\u00faa conexi\u00f3n MySQL?
MSG_ServerDoesNotAppearToHaveStarted=Foi impos\u00edbel conectar ao servidor MySQL despois do inicio: {0}.\n\nIt could still be starting up, or you may need to change your settings for the start command or your connection settings.\n\nDo you want to edit your MySQL properties or keep waiting for the server to start up?
MSG_UnableToReconnectServerNotRunning=Unable to connect to the MySQL server because it is does not appear to be running at the configured host ({0}) and port ({1}).  Please check that the server is running and that your configuration settings are correct.
MSG_ReconnectingToMySQL=Volvendo a conectar ao servidor MySQL
MSG_WaitingForServerToStart=Agardando a que o servidor MySQL inicie
MSG_WaitingForServerToStop=Agardando a que o servidor MySQL se dete\u00f1a
MSG_CantStartServerIsAlreadyRunning=Foi impos\u00edbel iniciar o servidor MySQL porque semella que xa se est\u00e1 executando no equipo {0}, porto {1}.  Tentando conectar ao servidor. Tam\u00e9n \u00e9 pos\u00edbel que outro proceso estea escoitando neste porto.
MSG_CheckStart=Cambiaron as configuraci\u00f3ns para iniciar MySQL.  Quere iniciar o servidor MySQL agora?
MSG_UnableToStopServer=Produciuse un erro mentres tentaba deter o servidor MySQL
MSG_UnableToStartServer=Produciuse un erro mentres tentaba iniciar o servidor MySQL
MSG_NoSampleWithoutInnoDB=O exemplo require o motor de almacenamento InnoDB, e este motor non est\u00e1 activado no servidor.  Active InnoDB e tente de novo.
StartManager.CancelButton=Cancelar
StartManager.CancelButtonA11yDesc=Cancelar o inicio do servidor MySQL
StartManager.KeepWaitingButton=Continuar agardando
StartManager.KeepWaitingButtonA11yDesc=Continuar agardando a que o servidor se inicie
StartManager.PropsButton=Editar as propiedades MySQL
StartManager.PropsButtonA11yDesc=Editar as propiedades da orde iniciar para o servidor MySQL
StartManager.ServerNotRunningTitle=Non se est\u00e1 executando o servidor MySQL

StopManager.CancelButton=Cancelar
StopManager.CancelButtonA11yDesc=Cancelar a detenci\u00f3n do servidor MySQL
StopManager.KeepWaitingButton=Continuar agardando
StopManager.KeepWaitingButtonA11yDesc=Continuar agardando a que o servidor se dete\u00f1a
StopManager.PropsButton=Editar a orde Deter
StopManager.PropsButtonA11yDesc=Editar a propiedade da orde Deter para o servidor MySQL
StopManager.ServerStillRunningTitle=O servidor MySQL a\u00ednda se est\u00e1 executando

MSG_UnableToConnect=Non \u00e9 pos\u00edbel estabelecer a conexi\u00f3n a {0} para o usuario {1}
MySQLOptions_AdminPassword=Contrasinal do administrador para o servidor MySQL rexistrado

