# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

#Question to show user to find out whether start second instance of NetBeans  or not
MSG_AlreadyRunning=\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u3001\u30e6\u30fc\u30b6\u30fc\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u4f7f\u7528\u3057\u3066\u3059\u3067\u306b\u52d5\u4f5c\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u524d\u56de\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u6b63\u3057\u304f\u7d42\u4e86\u3057\u306a\u304b\u3063\u305f\u304b\u3001\u5225\u306e\u30b3\u30f3\u30d4\u30e5\u30fc\u30bf\u3067\u5225\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u52d5\u4f5c\u3057\u3066\u3044\u3066\n\u540c\u3058\u30e6\u30fc\u30b6\u30fc\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u304b\u306e\u3044\u305a\u308c\u304b\u3067\u3059\u3002\n\n\u540c\u3058\u30e6\u30fc\u30b6\u30fc\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u4f7f\u7528\u3057\u3066\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u5225\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u52d5\u4f5c\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001\n\u30e6\u30fc\u30b6\u30fc\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u58ca\u308c\u306a\u3044\u3088\u3046\u306b\u3001\u300c\u53d6\u6d88\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u5225\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u52d5\u4f5c\u3057\u3066\u3044\u306a\u3044\u3053\u3068\u304c\u78ba\u5b9f\u306a\u5834\u5408\u306f\u300cOK\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u7d9a\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_AlreadyRunningTitle=\u8b66\u544a
MSG_CannotWrite=\u6307\u5b9a\u3057\u305f\u30e6\u30fc\u30b6\u30fc\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002\n\u3053\u308c\u306f\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u6b63\u3057\u3044\u52d5\u4f5c\u3092\u59a8\u3052\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u91cd\u5927\u306a\u554f\u984c\u3067\u3059\u3002\n{0}\u304c\u66f8\u8fbc\u307f\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u524d\u306e\u30a8\u30e9\u30fc\u3092\u7121\u8996\u3057\u3066\u7d9a\u884c\u3059\u308b\u5834\u5408\u306f\u300cOK\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_CannotWriteTitle=\u8b66\u544a

EXC_not_a_module={0}\u306f\u6709\u52b9\u306aNetBeans\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002

# bootstrap manifest
OpenIDE-Module-Name=\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7
OpenIDE-Module-Display-Category=\u30a4\u30f3\u30d5\u30e9\u30b9\u30c8\u30e9\u30af\u30c1\u30e3
OpenIDE-Module-Short-Description=NetBeans\u30d9\u30fc\u30b9\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30b3\u30a2\u30fb\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u3002
OpenIDE-Module-Long-Description=\u3053\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4ed6\u306e\u3059\u3079\u3066\u306e\u90e8\u5206\u3092\u30ed\u30fc\u30c9\u3059\u308b\u521d\u671f\u30a4\u30f3\u30d5\u30e9\u30b9\u30c8\u30e9\u30af\u30c1\u30e3\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u7121\u52b9\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

MSG_InstallJava7=Java 7 Standard Edition\u3088\u308a\u3082\u53e4\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u306eJava\u3067\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002\nJava 7 Standard Edition\u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306e\u3082\u306e\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u304b\u3001\u3042\u308b\u3044\u306f\n--jdkhome\u5207\u66ff\u3048\u3092\u4f7f\u7528\u3057\u3066\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u793a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_NeedsJava7=Java 7 Standard Edition\u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306e\u3082\u306e\u304c\u5fc5\u8981\u3067\u3059

