OpenIDE-Module-Display-Category=Base de datos
OpenIDE-Module-Long-Description=Este m\u00f3dulo proporciona funcionalidades de base de datos espec\u00edficas de MYSQL para NetBeans.  Isto incl\u00fae unha xesti\u00f3n b\u00e1sica do servidor local e calquera outra funcionalidade que nos pensemos que vale a pena especificar.
OpenIDE-Module-Name=Compatibilidade para a base de datos MySQL
OpenIDE-Module-Short-Description=Forn\u00e9celle a NetBeans compatibilidade espec\u00edfica para MySQL

#Installer
MSG_RegisterMySQL=Buscando un servidor de base de datos local

#ServerNode
# Run states
DISCONNECTED=(desconectado)
CONNECTED=
CONFIGERR=(erro de configuraci\u00f3n)

LBL_ServerDisplayName=Servidor de MySQL en {0} [{1}] {2}
LBL_ServerShortDescription=Instancia do servidor MySQL en {0} [usuario {1}] {2}
LBL_ServerShortDescriptionError=Produc\u00edronse erros na configuraci\u00f3n de MySQL: {0}

MSG_UnableToGetDatabaseList=Foi impos\u00edbel obter a lista de bases de datos desde o servidor MySQL

#DatabaseNode
LBL_DBNodeShortDescription=Base de datos MySQL {0}

#DatabaseUtils
MSG_JDBCDriverNotRegistered=O controlador JDBC para MySQL non est\u00e1 rexistrado
MSG_UnableToLoadJDBCDriver=Non se puido cargar o controlador de JDBC
MSG_NotEnoughInformationToConnect=Non se proporcionou informaci\u00f3n suficiente para conectar ao servidor MySQL.  Comprobe as propiedades de MySQL e t\u00e9nteo de novo.

#PropertiesAction
LBL_PropertiesAction=Propiedades...

#RegisterServerAction
LBL_RegisterServerAction=Rexistrar servidor MySQL...

#RefreshServerAction
LBL_RefreshServerAction=Actualizar

#CreateDatabaseAction
LBL_CreateDatabaseAction=Crear base de datos...

#DeleteDatabaseAction
MSG_ErrorDeletingDatabase=Foi impos\u00edbel borrar a base de datos {0}

#ConnectAction
LBL_ConnectAction=Conectar...

#Utils
MSG_SeeErrorLog=Consulte o rexistro de erros para m\u00e1is detalles

#DatabaseUtils
ERR_MySQLCommunicationFailure=Foi impos\u00edbel contactar co servidor MySQL.  Comprobe que se est\u00e1 executando e que o seu equipo e portos est\u00e1n configurados correctamente.
MSG_ErrorDialogTitle=Erro

MSG_ConnectingToServer=Tentando conectar ao servidor MySQL
MSG_ReconnectingToServer=Volvendo a conectar co servidor MySQL
MSG_UnableToConnect=Non \u00e9 pos\u00edbel conectar co servidor MySQL  Comprobe as configuraci\u00f3ns en Propiedades e t\u00e9nteo de novo.

#ConnectServerAction
LBL_ConnectServerAction=Conectar

#DisconnectServerAction
LBL_DisconnectServerAction=Desconectar

#StartAction
LBL_StartAction=Iniciar
MSG_UnableToStartServer=Foi impos\u00edbel iniciar o servidor MySQL.  Comprobe as s\u00faas configuraci\u00f3ns e t\u00e9nteo de novo.
MSG_NoStopPath=O cami\u00f1o \u00e1 orde de inicio de MySQL non est\u00e1 configurado.  Quere editar as propiedades do servidor para configurar este cami\u00f1o?

#StopAction
LBL_StopAction=Deter
MSG_ServerStopped=Det\u00edvose o servidor
MSG_UnableToStopServer=Produciuse un erro ao deter o servidor MySQL
MSG_NoStartPath=O cami\u00f1o \u00e1 orde de inicio de MySQL non est\u00e1 configurado.  Quere editar as propiedades do servidor para configurar este cami\u00f1o?

#AdministerAction
LBL_AdministerAction=Executar ferramenta de administraci\u00f3n
MSG_NoAdminPath=O cami\u00f1o/URL \u00e1 ferramenta de administraci\u00f3n de MySQL non est\u00e1 estabelecido.  Quere editar as propiedades do servidor para configurar este cami\u00f1o?
MSG_ErrorStartingAdminTool=Produciuse erro ao iniciar a ferramenta de administraci\u00f3n

#ServerInstance
MSG_NoSuchSample=Non se reco\u00f1ece o nome {0} como nome de base de datos de exemplo.
MSG_ErrorLoadingSampleSQL=Non \u00e9 pos\u00edbel cargar o SQL para o exemplo {0}: {1}
MSG_ErrorExecutingSampleSQL=Produciuse un erro ao executar o SQL para o exemplo {0}: {1}
MSG_AdminCommandNotSet=Non est\u00e1 configurado o cami\u00f1o a orde de administraci\u00f3n.  Empregue o di\u00e1logo de propiedades de MySQL para estabelecer o cami\u00f1o.
MSG_InvalidAdminCommand=A orde de administraci\u00f3n {0} non \u00e9 un URL ou ficheiro correcto.  Seleccione Propiedades e no separador Administraci\u00f3n axuste o cami\u00f1o.
MSG_InvalidStartCommand=A orde de inicio {0} non \u00e9 un ficheiro correcto.  Seleccione Propiedades e no separador Administraci\u00f3n axuste o cami\u00f1o.
MSG_InvalidStopCommand=A orde para deter {0} non \u00e9 un ficheiro correcto.  Seleccione Propiedades e no separador Administraci\u00f3n axuste o cami\u00f1o.
LBL_MySQLOutputTab=Ordes do servidor MySQL
LBL_StoppingMySQLServer=Detendo o servidor de MySQL

