# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

OpenIDE-Module-Display-Category=\uc6f9 \uc11c\ube44\uc2a4
OpenIDE-Module-Long-Description=RESTful \uc6f9 \uc11c\ube44\uc2a4 \ucef4\ud3ec\ub10c\ud2b8\ub85c StrikeIron \uc6f9 \uc11c\ube44\uc2a4 \uc124\uba85
OpenIDE-Module-Name=StrikeIron \uc11c\ube44\uc2a4

OpenIDE-Module-Short-Description=StrikeIron \uc11c\ube44\uc2a4 \ucef4\ud3ec\ub10c\ud2b8
#StrikeIron_Name=StrikeIron

AddressVerification40_Name=\uc8fc\uc18c \uac80\uc99d 40
EmailVerify30_Name=\uc774\uba54\uc77c \uac80\uc99d 30
IPAddressLookup_Name=IP \uc8fc\uc18c \ucc3e\uc544\ubcf4\uae30
ReversePhoneLookup_Name=\uc5ed \uc804\ud654\ubc88\ud638 \uc870\ud68c
SalesandUseTaxComplete40_Name=\uc138\uae08 \uc644\ub8cc 40
ZipCode_Name=\uc6b0\ud3b8\ubc88\ud638

AddressVerification40_Desc=<html>\uc6f9 \uc11c\ube44\uc2a4\ub294 \uc720\ud6a8\uc131\uc744 \ud655\uc778\ud558\uae30 \uc704\ud574\uc11c <br/>\uc815\uad50\ud55c \uac80\uc0c9 \ubc0f \ub370\uc774\ud130 \ud45c\uc900\ud654 \uae30\uc220\uc744 \uc0ac\uc6a9\ud558\uc5ec \ubaa8\ub4e0 \uc694\uc18c\ub97c \uac80\uc0ac\ud558\uace0,<br/>\uc694\uad6c \uc0ac\ud56d\uc5d0 \ub530\ub77c \uc798\ubabb\ub41c \uc8fc\uc18c\ub97c \uc5c5\ub370\uc774\ud2b8\ud569\ub2c8\ub2e4 StrikeIron\uc740 \uac01 \uc694\uc18c\uc758 \uc815\ud655\uc131\uc744 \ud655\uc778\ud558\uace0 <br/>\uc6b0\ud3b8 \uad8c\ud55c \uaddc\uce59\uc5d0 \ub530\ub77c \uc8fc\uc18c\ub97c \ud45c\uc900\ud654\ud558\uae30 \uc704\ud574 \uc8fc\uc18c<br/> \ubc88\uc9c0, \uac70\ub9ac \ubc29\ud5a5, \uac70\ub9ac \uc774\ub984, \uac70\ub9ac \uc720\ud615, \uc544\ud30c\ud2b8 \ubc88\uc9c0 \uc218 \ubc0f <br/>\uc0ac\uc11c\ud568 \ubc88\ud638\ub97c \uac80\uc0ac\ud569\ub2c8\ub2e4. StrikeIron\uc740 \uc798\ubabb\ub41c \uac70\ub9ac \uc774\ub984\uc744 \uc815\uc815\ud558\uace0,<br/>\uac70\ub9ac \uc720\ud615 \ud655\uc7a5\uc744 \uac80\uc99d\ud558\uba70,<br/>\ub3c4\uc2dc \uc774\ub984 \ubc0f \uc8fc \uc774\ub984\uc744 \ud45c\uc900\ud654\ud558\uace0,<br/>\ub204\ub77d\ub41c \uc8fc \uc57d\uc5b4\ub97c \ubcf4\ucda9\ud569\ub2c8\ub2e4. \uc6f9 \uc11c\ube44\uc2a4\ub294 \ub2e8\uc77c \uc8fc\uc18c\ub098 <br/>\ubc30\uce58 \uc791\uc5c5\uc73c\ub85c \ud638\ucd9c\ub420 \uc218 \uc788\uc2b5\ub2c8\ub2e4.</html>

EmailVerify30_Desc=<html>StrikeIron \uc774\uba54\uc77c \uc778\uc99d \uc6f9 \uc11c\ube44\uc2a4\ub294 \uc989\uc2dc \uc774\uba54\uc77c<br/>\uc8fc\uc18c \ub610\ub294 \ub3c4\uba54\uc778\uc758 \uc720\ud6a8\uc131\uc744 \uacb0\uc815\ud569\ub2c8\ub2e4. \uac04\ub2e8\ud788 \uc774\uba54\uc77c \uc8fc\uc18c\ub97c \uc81c\uacf5\ud558\uace0 \ud574\ub2f9 \uc6f9 \uc11c\ube44\uc2a4\ub294 <br/>\uc774\uba54\uc77c\uc744 \ubcf4\ub0b4\uc9c0 \uc54a\uace0\ub3c4 \uc8fc\uc18c\ub97c \uac80\uc99d\ud558\uae30 \uc704\ud574 <br/>\uc774\uba54\uc77c \uc18c\uc720\uc790 SMTP \uc11c\ubc84\uc5d0 \uc811\uadfc\ud558\uc5ec true\ub098 false\ub97c \ubc18\ud658\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. </html>

IPAddressLookup_Desc=<html>\ud574\ub2f9 \uc6f9 \uc11c\ube44\uc2a4\ub294 \uc6f9 \uc11c\ubc84 \uc774\ub984\uc774 \ubd80\uc5ec\ub420 \ub54c IP \uc8fc\uc18c\ub97c \uc81c\uacf5\ud569\ub2c8\ub2e4. <br/>\uc608\ub97c \ub4e4\uc5b4, www.anywebserver.com\uc740 256.1.1.56\uc744 \ubc18\ud658\ud569\ub2c8\ub2e4</html>

ReversePhoneLookup_Desc=<html>\uc5ed \uc804\ud654\ubc88\ud638 \uc870\ud68c: 90\uc77c \uc815\ud655\ub3c4 \uc6f9 \uc11c\ube44\uc2a4\ub294 \ubaa8\ub4e0 \uc804\ud654 \ubc88\ud638\uc5d0 \uc5f0\uacb0\ub41c <br/>\uc774\ub984\uacfc \uc8fc\uc18c \ub370\uc774\ud130\uc5d0 \ud504\ub85c\uadf8\ub798\ubc0d \uc778\ud130\ud398\uc774\uc2a4\ub97c \uc81c\uacf5\ud569\ub2c8\ub2e4. \ubc24\ub9c8\ub2e4 \uc5c5\ub370\uc774\ud2b8\ub418\ub294\ub370, <br/>\ud574\ub2f9 \uc815\ud655\ub3c4\ub294 \ubcc0\uacbd \ud6c4 \uc9c0\ub09c 90\uc77c \uc774\ub0b4\uc785\ub2c8\ub2e4.</html>

SalesandUseTaxComplete40_Desc=<html>StrikeIron \uc138\uae08 \ub370\uc774\ud130 \uc2dc\uc2a4\ud15c \uc138\uc77c\uc988 \ubc0f \uc138\uc74c \uc6f9 \uc11c\ube44\uc2a4 \uc0ac\uc6a9\uc740 <br/>\uc2e4\uc81c \uc138\uc77c\uc988\uc640 \uc138\uae08 \ub370\uc774\ud130 \uc0ac\uc6a9\uc5d0 \ud504\ub85c\uadf8\ub798\ubc0d \uc778\ud130\ud398\uc774\uc2a4\ub97c \uc81c\uacf5\ud569\ub2c8\ub2e4 \uac04\ub2e8\ud788 \ubbf8\uad6d \uc6b0\ud3b8\ubc88\ud638\ub098 \uce90\ub098\ub2e4 \uc6b0\ud3b8\ubc88\ud638\ub294 \uacf5\uae09\ub418\uba70, <br/>\ubc14\ub85c \uc8fc, \uce74\uc6b4\ud2f0, MTA, SPD \ub4f1\uc744 \uc704\ud55c\uc77c\ubc18 \uc138\uc77c\uc988\uc640 \uc138\uc728 \ub808\ubca8 \uc0ac\uc6a9\uc5d0 \uc77c\uce58\ub429\ub2c8\ub2e4. \uc138\uae08 \ub370\uc774\ud130\ub294 \uc2e4\uc81c XML \uae30\ubc18 \uc6f9 \uc11c\ube44\uc2a4\ub97c \ud1b5\ud574 <br/>\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8, \ud50c\ub7ab\ud3fc, \uc81c\ud488, \ub610\ub294 \uc6f9 \uc0ac\uc774\ud2b8\uc5d0 <br/>\uc9c1\uc811 \uc2e4\uc2dc\uac04\uc73c\ub85c \uc804\ub2ec\ub429\ub2c8\ub2e4.</html>

ZipCode_Desc=StrikeIron \uc6b0\ud3b8 \ubc88\ud638 \ucf54\ub4dc \uc815\ubcf4 \uc6f9 \uc11c\ube44\uc2a4\ub294  <br/>\uc8fc\uc5b4\uc9c4 \ubbf8\uad6d \uc6b0\ud3b8\ubc88\ud638\ub098 \uce90\ub098\ub2e4 \uc6b0\ud3b8\ubc88\ud638\uc5d0 \ub300\ud55c <br/>\ub3c4\uc2dc,\uc8fc,\uce74\uc6b4\ud2b8,\uc704\ub3c4, \uacbd\ub3c4 \ubc0f \uc2dc\uac04\ub300\ub97c \uc989\uc2dc \uac80\uc0c9\ud569\ub2c8\ub2e4 </html>

