# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

OpenIDE-Module-Display-Category=Analizando
OpenIDE-Module-Name=El analizador Java (Java se proyectos soporte)
OpenIDE-Module-Long-Description=Complemento para el analizador NetBeans proporcionar soporte t\u00e9cnico para la generaci\u00f3n de perfiles J2SE proyectos.

J2SEProjectTypeProfiler_ModifyBuildScriptCaption=Habilitar de creaci\u00f3n de perfiles de {0}
J2SEProjectTypeProfiler_ModifyBuildScriptMsg=<html><b> Profiler no est\u00e1 integrado con el proyecto  {0}.<br>Presione ACEPTAR para realizar la integraci\u00f3n</b><br><br>Como parte de la integraci\u00f3n, se modificar\u00e1 el script de generaci\u00f3n de proyecto.<br>El archivo original se copiar\u00e1n como {1}.<br><br>Nota: puede deshacer la integraci\u00f3n de generador de profiles en cualquier momento invocando<br>Profile | comandos avanzados | Profiler Unintegrate desde el men\u00fa principal.</html>
J2SEProjectTypeProfiler_RegenerateBuildScriptMsg=Se ha modificado el script de generaci\u00f3n de {0}. \nEs necesario regenerar par proceder con la creaci\u00f3n de profiling. \n\nDesea continuar?
J2SEProjectTypeProfiler_CannotFindBuildScriptMsg=No se puede encontrar el archivo de proyecto {0}.
J2SEProjectTypeProfiler_CannotBackupBuildScriptMsg=No se puede realizar una copia la secuencia de comandos de generaci\u00f3n del proyecto. \u00bfTodav\u00eda desea continuar?
J2SEProjectTypeProfiler_ModifyBuildScriptManuallyMsg=El archivo de proyecto {0} no puede modificarse autom\u00e1ticamente para la generaci\u00f3n de perfiles. Necesita manualmente insertar la siguiente cl\u00e1usula de importaci\u00f3n en la \:\n{1}\n por favor realizar este cambio ye inicie profiling de nuevo.
J2SEProjectTypeProfiler_ProjectCategory=Proyecto
J2SEProjectTypeProfiler_ListenersCategory=escuchadores AWT & Swing 
J2SEProjectTypeProfiler_PaintersCategory=Painters Swing & AWT
J2SEProjectTypeProfiler_IoCategory=Java E/S
J2SEProjectTypeProfiler_FilesCategory=Archivos
J2SEProjectTypeProfiler_SocketsCategory=Enchufes (sockets)

JavaApplicationIntegrationProvider_Title=aplicaci\u00f3n Java 
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteStep3Message=ejecutando la aplicaci\u00f3n utilizando {0}. Al iniciar la aplicaci\u00f3n, proporcionar la opci\u00f3n de inicio adicionales para  <code>Java</code> comando \:<br><code>{1}</code><br>El {2}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteStep4Message=El JVM se inicia, pero no continuar\u00e1 con la ejecuci\u00f3n de la aplicaci\u00f3n hasta que se conecta el generador de perfiles.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteHintMessage=Puede utilizar comando <code> {0} </code> en lugar del comando <code> Java </code> para ejecutar la aplicaci\u00f3n en modo de generaci\u00f3n de perfiles. Compruebe la secuencia de comandos para cualquier modificaci\u00f3n adicional en de acuerdo con la configuraci\u00f3n del sistema.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDirectStep1Message=ejecutando la aplicaci\u00f3n utilizando {0}. Al iniciar la aplicaci\u00f3n, proporcionar la opci\u00f3n de inicio adicionales para  <code>Java</code> commando\:<br><code>{1}</code>
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDirectStep2Message=El JVM se inicia, pero no continuar\u00e1 con la ejecuci\u00f3n de la aplicaci\u00f3n hasta que se conecta el generador de perfiles.
# HTML-formatted
JavaApplicationIntegrationProvider_DynamicWarningMessage=asegurese que el IDE este usando {0}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDynamicStep1Message=Inicie la aplicaci\u00f3n utilizar {0}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDynamicStep2Message=Cuando se est\u00e1 ejecutando la aplicaci\u00f3n, haga clic en Asociar para seleccionar el proceso de la aplicaci\u00f3n para adjuntar a.

JavaAppletIntegrationProvider_Title=Java Applet
JavaAppletIntegrationProvider_AppletWorkDirWindowsMessage=Directorio de trabajo subprograma depende su tipo de explorador Web. Para usar Internet Explorer utilice <%USERPROFILE%>\\Desktop, para  Mozilla y Firefox utilice el directorio de instalaci\u00f3n del navegador, para Opera use la ruta donde se encuentra la p\u00e1gina html lanzada en la ubicaci\u00f3n del applet.
JavaAppletIntegrationProvider_AppletWorkDirUnixesMessage=Directorio de trabajo subprograma normalmente es la ubicaci\u00f3n desde donde se inici\u00f3 el explorador Web que ejecuta el subprograma.
# HTML-formatted
JavaAppletIntegrationProvider_OperaRemoteAttachWarningMessage=Puesto que incluye el explorador Web utiliza opera o JRE est\u00e1ndar para ejecutar subprogramas en lugar del complemento de Java y sin argumentos se puede pasar a \u00e9l, no se puede utilizarse para la generaci\u00f3n de perfiles subprogramas de forma remota.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep3Message=Cierre todas las ventanas y las fichas del explorador Web remoto.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep4WindowsMessage=Abra el Panel de control Java desde el Panel de control de Windows. Abra la Ficha Java y, a continuaci\u00f3n, haga clic en Ver en \u00e1rea de configuraci\u00f3n en tiempo de ejecuci\u00f3n de subprograma Java. Se abre el cuadro de di\u00e1logo Configuraci\u00f3n en tiempo de ejecuci\u00f3n de Java. Haga doble clic en la celda de los par\u00e1metros de Java Runtime e inserte la siguiente cadena\:<br><code>{0}</code><br>Si <code>&lt;remote&gt;</code> contiene espacios deber\u00e1 estar encerrado todo entre comillias dobles. Cerrar la ventana de di\u00e1logo usando el bot\u00f3n Aceptar y luego hacer clic en Aceptar o Aplicar en el panel de Control de Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep4UnixesMessage=Abra el Panel de control Java DE LA JRE que se ejecutar\u00e1  subprograma  perfil utilizando <code> &LT; $ JAVA_HOME &gt; / JRE / bin / ControlPanel </code> comando Abra la Ficha Java y, a continuaci\u00f3n, haga clic en Ver en el \u00e1rea Configuraci\u00f3n en tiempo de ejecuci\u00f3n de subprograma Java. Se abre el cuadro de di\u00e1logo Configuraci\u00f3n en tiempo de ejecuci\u00f3n de Java. Haga doble clic en la celda de par\u00e1metros Java Runtime e insertar despu\u00e9s de la cadena\:<br><code>{0}</code><br>Cerrar el cuadro de di\u00e1logo con el bot\u00f3n Aceptar y, a continuaci\u00f3n, haga clic en Aceptar o aplicar en el panel de control de Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep5Message=Inicie el subprograma en el explorador Web remoto. Abre la ventana del explorador pero el subprograma no se iniciar\u00e1 hasta que se conecta el generador de perfiles.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStopAppletMessage=El subprograma JVM se mantenga ejecutar hasta que detenga \u00e9l mediante la acci\u00f3n del analizador desasociar o hasta que se cierren todas las ventanas y las fichas del explorador Web remoto.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteRestoreSettingsMessage=Se debe recuperar el valor de celda par\u00e1metros en tiempo de ejecuci\u00f3n Java original para poder ejecutar subprogramas sin la generaci\u00f3n de perfiles en el sistema remoto.
# HTML-formatted
JavaAppletIntegrationProvider_OperaDirectAttachWarningMessage=Puesto que incluye el explorador Web utiliza opera o JRE est\u00e1ndar para ejecutar subprogramas en lugar del complemento de Java y sin argumentos se puede pasar a \u00e9l, no puede utilizarse para la generaci\u00f3n de perfiles subprogramas mediante directa de datos adjuntos.
# HTML-formatted
JavaAppletIntegrationProvider_ManualLocalStep1Message=Cierre todas las ventanas y las fichas de su explorador Web.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2WindowsMessage=Abra el Panel de control Java desde el Panel de control de Windows. Abra la Ficha Java y, a continuaci\u00f3n, haga clic en Ver en el \u00e1rea Configuraci\u00f3n en tiempo de ejecuci\u00f3n de subprograma Java. Se abre el cuadro de di\u00e1logo Configuraci\u00f3n en tiempo de ejecuci\u00f3n de Java. Haga doble clic en la celda de par\u00e1metros Java Runtime e insertar despu\u00e9s de la cadena\:<br><code>{0}</code><br>Cerrar el cuadro de di\u00e1logo con el bot\u00f3n Aceptar y, a continuaci\u00f3n, haga clic en Aceptar o aplicar en el panel de control de Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2UnixesMessage=Abra el Panel de control Java de  JRE que se ejecute el subprograma perfil mediante <code> &LT; $ JAVA_HOME &gt; / JRE / bin / ControlPanel </code> comando. Abra la Ficha Java y, a continuaci\u00f3n, haga clic en Ver en el \u00e1rea Configuraci\u00f3n en tiempo de ejecuci\u00f3n de subprograma Java. Se abre el cuadro de di\u00e1logo Configuraci\u00f3n en tiempo de ejecuci\u00f3n de Java. Haga doble clic en la celda de par\u00e1metros Java Runtime e insertar despu\u00e9s de la cadena\:<br><code>{0}</code><br>Cerrar el cuadro de di\u00e1logo con el bot\u00f3n Aceptar y, a continuaci\u00f3n, haga clic en Aceptar o aplicar en el panel de control de Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2MacMessage=Abra Preferences.app de Java situado en el directorio <code>/Applications/Utilities/Java</code>. Abra la ficha General y la haga clic en el \u00e1rea de par\u00e1metros de Java Applet Runtime e inserte la siguiente cadena \:<br><code>{0}</code><br> Haga clic en el bot\u00f3n Guardar y salga de la aplicaci\u00f3n de las preferencias de Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep3Message=Inicie el applet en el explorador Web. Abre la ventana del explorador pero el subprograma no se iniciar\u00e1 hasta que se conecta el generador de perfiles.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStopAppletMessage=El applet JVM se mantendra en ejecuci\u00f3n  hasta que detenga \u00e9l mediante la acci\u00f3n del analizador desasociar o hasta que se cierren todas las ventanas y las fichas del explorador Web.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectRestoreSettingsMessage=Se debe recuperar el valor de celda par\u00e1metros en tiempo de ejecuci\u00f3n Java original para poder ejecutar subprogramas sin la generaci\u00f3n de perfiles.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep2WindowsMessage=Abra el panel de control de Java desde el panel de control de Windows y aseg\u00farese de que {0} pueda ser usado para ejecutar el applet profiled.<br><br> Nota \:El navegador web opera no utiliza Java plug-in para ejecutar applets. Consulte la  documentaci\u00f3n en pantalla de Opera para obtener instrucciones acerca de c\u00f3mo cambiar el JRE se utiliza para ejecutar applets. 
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep2UnixesMessage=Aseg\u00farese de que el explorador tiene {0} configurado para ejecutarse el perfil del applet.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep3Message=Inicie el applet en el explorador Web. Cuando se est\u00e1 ejecutando el subprograma, haga clic en Asociar al seleccionar el proceso de subprograma para adjuntar a.

# new keys
JavaApplicationIntegrationProvider_WorkDirMessage=Directorio de trabajo es el directorio desde el que se iniciar\u00e1 la aplicaci\u00f3n
NBProfiler/Categories/IO=E/S
NBProfiler/Categories/IO/Files=Archivos
NBProfiler/Categories/IO/Socket=Enchufe (socket)
NBProfiler/Categories/UI=UI
NBProfiler/Categories/UI/Java2D=Java 2D
NBProfiler/Categories/UI/Listeners=Escuchadores
NBProfiler/Categories/UI/Painters=Dise\u00f1adores

