# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008, 2016 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.
#
# Contributor(s):
netbeans-Title=NetBeans ${nb.display.version.long}

jdk-netbeans-Title=Oracle JDK e NetBeans IDE

netbeans-title=NetBeans ${nb.display.version.short}
netbeans-tooltip=NetBeans IDE
netbeans-description=NetBeans IDE

glassfish-title=GlassFish Server Open Source Edition ${glassfish.display.version}

glassfish-description=O GlassFish Server ${glassfish.display.version} fornece um servidor para desenvolvimento e implanta\u00e7\u00e3o das aplica\u00e7\u00f5es HTML5 din\u00e2micas escal\u00e1veis da Plataforma Java Enterprise Edition (JavaEE). As principais funcionalidades incluem compatibilidade, modularidade e desenvolvimento iterativo r\u00e1pido do Java EE 7.


tomcat-title=Instala\u00e7\u00e3o do Apache Tomcat {display-version}
tomcat-description=Container Web de c\u00f3digo-fonte aberto para especifica\u00e7\u00f5es do Java Servlet e do JSP.
tomcat-tooltip=Apache Tomcat

javase-title=Java SE
javase-description=Ferramentas essenciais para programa\u00e7\u00e3o em Java, incluindo editor, depurador, gerador de perfis, suporte \u00e0 refatora\u00e7\u00e3o e uma ferramenta de design GUI de arrastar e soltar (anteriormente conhecida como Project Matisse).
javase-tooltip=Java SE

cpp-title=C/C++
cpp-tooltip=C/C++
cpp-description=Ferramentas para desenvolvimento de aplica\u00e7\u00f5es C e C++. Inclui projetos modelo, suporte a projetos existentes, editor avan\u00e7ado, suporte a depura\u00e7\u00e3o e assistente para gerenciamento de configura\u00e7\u00f5es.

baseide-title=IDE Base
baseide-description=Componentes principais de um ambiente de desenvolvimento integrado.
baseide-tooltip=IDE Base

javaee-tooltip=Java EE
javaee-description=Ferramentas para cria\u00e7\u00e3o de aplica\u00e7\u00f5es Java web e corporativas compat\u00edveis com especifica\u00e7\u00f5es Java EE 6. Inclui suporte a servlets, JSPs, bibliotecas de tags, Java server Faces, Java Persistence API, Enterprise Java Beans, Web services do JAX-WS e do RESTful, Spring e Struts.
javaee-title=Java EE

ruby-title=Ruby
ruby-tooltip=Ruby
ruby-description=Conjunto completo de ferramentas para a cria\u00e7\u00e3o de aplica\u00e7\u00f5es Ruby e Ruby on Rail. Inclui interpretador JRuby, framework Ruby on Rails, editor potente, depurador, gerenciador de gem e interatividade com o shell do Ruby. Suporta f\u00e1cil cria\u00e7\u00e3o, modifica\u00e7\u00e3o e execu\u00e7\u00e3o de aplica\u00e7\u00f5es Ruby on Rails.

groovy-title=Groovy
groovy-tooltip=Groovy
groovy-description=Proporciona suporte para a linguagem Groovy e para o framework Grails.

php-title=PHP
php-tooltip=PHP
php-description=Ferramentas para desenvolvimento de aplica\u00e7\u00f5es PHP, incluindo editor PHP e depurador, gerenciamento de projeto, integra\u00e7\u00e3o com servidor Apache, suporte para MySQL e outros bancos de dados, upload e download de FTP, suporte a JavaScript e outras funcionalidades.

webcommon-title=HTML5
webcommon-tooltip=Ferramentas para desenvolver Aplica\u00e7\u00f5es Web HTML5.
webcommon-description=Ferramentas para desenvolvimento de Aplica\u00e7\u00f5es Web HTML5. Inclui o tipo de projeto da Aplica\u00e7\u00e3o HTML5, o inspetor de p\u00e1ginas e um editor de estilo CSS visual, o editor para HTML, CSS e JavaScript, al\u00e9m de um depurador JavaScript.

extide-title=IDE Estendido



soa-title=SOA
soa-tooltip=SOA
soa-description=Ferramentas para a cria\u00e7\u00e3o de aplica\u00e7\u00f5es como parte de uma Arquitetura Orientada a Servi\u00e7os (SOA). Fornece suporte abrangente a BPEL. Inclui editor gr\u00e1fico, depurador e suporte a refatora\u00e7\u00e3o.

javafx-title=Plug-in do JavaFX
javafx-description=Plug-in JavaFX para NetBeans IDE
javafx-tooltip=Plug-in do JavaFX

javame-title=Java ME
javame-description=Conjunto completo de ferramentas para cria\u00e7\u00e3o de aplica\u00e7\u00f5es Java Micro Edition para telefone celulares e dispositivos port\u00e1teis. Inclui designer visual, Assistente de conex\u00e3o de Web services e ferramentas para tratamento de problemas de fragmenta\u00e7\u00e3o de dispositivo.
javame-tooltip=Java ME

ergonomics-title=Funcionalidades sob Demanda
ergonomics-tooltip=Funcionalidades sob Demanda
ergonomics-description=Fornece melhor tempo de resposta e uma inicializa\u00e7\u00e3o mais r\u00e1pida ao ativar as funcionalidades instaladas somente quando elas s\u00e3o necess\u00e1rias. \u00c9 o equil\u00edbrio perfeito entre riqueza de funcionalidades e baixo consumo de mem\u00f3ria/CPU. Caso a mem\u00f3ria/CPU n\u00e3o seja um recurso limitado na sua m\u00e1quina, sinta-se \u00e0 vontade para desativar este item e obter de uma s\u00f3 vez toda a funcionalidade do NetBeans IDE.

MEMORY_WARNING_MSG=Voc\u00ea possui menos de 512 MB de RAM.
MEMORY_WARNING_TITLE=Advert\u00eancia de Mem\u00f3ria

ERR_INVALID_VERSION_TITLE=Erro de Vers\u00e3o Incorreta do Mac OS
ERR_INVALID_VERSION_MSG=Este software pode ser instalado somente em um sistema baseado em Mac OS X v10.4 e posterior.

ERR_NO_JAVA_TITLE=Nenhum Java localizado
ERR_NO_JAVA_MSG=O NetBeans IDE n\u00e3o pode ser instalado. Esse software pode ser instalado com o Java 8 ou mais recente. Fa\u00e7a download e instale a atualiza\u00e7\u00e3o mais recente do Java 8 em http://www.oracle.com/technetwork/java/javase/downloads/index.html e reinicie a instala\u00e7\u00e3o do NetBeans.

ERR_NO_JDK_TITLE=Nenhum JDK Encontrado
ERR_NO_JDK_MSG=O NetBeans IDE n\u00e3o pode ser instalado. O Java (JRE) foi encontrado no computador, mas \u00e9 necess\u00e1rio o JDK 8 ou mais recente. Fa\u00e7a download e instale a atualiza\u00e7\u00e3o mais recente do JDK 8 em http://www.oracle.com/technetwork/java/javase/downloads/index.html e reinicie a instala\u00e7\u00e3o do NetBeans.

ERR_OLDER_JAVA8_TITLE=Vers\u00e3o Java necess\u00e1ria n\u00e3o localizada
ERR_OLDER_JAVA8_MSG=O NetBeans IDE n\u00e3o pode ser instalado. Esse software pode ser instalado com o Java 8 ou mais recente. Fa\u00e7a download e instale a atualiza\u00e7\u00e3o mais recente do Java 8 em http://www.oracle.com/technetwork/java/javase/downloads/index.html e reinicie a instala\u00e7\u00e3o do NetBeans.

