# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

OpenIDE-Module-Display-Category=Webdienste
OpenIDE-Module-Long-Description=Deklaration der StrikeIron-Webdienste als RESTful-Webdienstkomponenten 
OpenIDE-Module-Name=StrikeIron-Dienste

OpenIDE-Module-Short-Description=StrikeIron-Dienstkomponente
#StrikeIron_Name=StrikeIron

AddressVerification40_Name=Addressenverifikation 40
EmailVerify30_Name=E-Mail-Verfifikation 30
IPAddressLookup_Name=IP-Adressaufl\u00f6sung
ReversePhoneLookup_Name=Umgekehrte Telefonnummernsuche
SalesandUseTaxComplete40_Name=Steuer Komplett 40
ZipCode_Name=Postleitzahl

AddressVerification40_Desc=<html>Der Webdienst untersucht jedes Element einer Adresse umd die G\u00fcltigkeit zu pr\u00fcfen.<br/>Dabei wird ein differnziertes Suchsystem mit standardisierten Technologie zur\u00fcckgegriffen und letztendlich<br/>eine ung\u00fcltige Adresse f\u00fcr die postalischen Anforderungen korrigiert. StrikeIron untersucht Hausnummern<br/>, Strassenrichtungen, Strassennamen, Strassentypen, Wohnungsnummern und<br>Postf\u00e4cher, um die Korrektheit jedes Element sicherzustellen. Am Ende wird die Adresse<br/>entsprechend den postalischen Anforderungen standartisiert. StrikeIron korrigiert auch Fehelr in Strassennamen<br>, validiert die Erweiterungen von Strassentypen, standardisiert Stadtnamen und<br> Namen von Bundesstaaten und f\u00fcgt fehlende Abk\u00fcrzungen f\u00fcr Bundesstaaten hinzu. Der Dienst kann f\u00fcr eine einzelne Adresse<br>aber auch als Stapelverarbeitung aufgerufen werden.</html>

EmailVerify30_Desc=<html>Der Dienst f\u00fcr die E-Mail-Verifikation pr\u00fcft umgehend die G\u00fcltigkeit einer E-Mail-Adresse<br>oder einer Domain. Es reicht die E-Mailadresse anzugeben und dieser Dienst<br>liefert "true" oder "false" indem es den SMTP-Server der Adrese abfragt, ohne<br>wirklich eine Mail zu senden. </html>

IPAddressLookup_Desc=<html>Dieser Dienst liefert die IP-Adresse f\u00fcr den Namen eines Webservers. <br/>F\u00fcr www.anywebserver.com w\u00fcrde z.B. 256.1.1.56. geliefert.</html>

ReversePhoneLookup_Desc=<html>Umgekehrte Telefonnummernsuche: Der Webdienst (auf 90 Tage genau) liefert eine programmatische Schnittstelle<br>umzu jeder Telefonnummer Namen und Adresse zu finden. Sie wird jede Nacht aktualisiert<br>und ist \u00fcber 90 Tage genau.</html>

SalesandUseTaxComplete40_Desc=<html>Der StrikeIron-Dienst "Tax Data Systems Sales and Use Tax" liefert eine programmatorische Schnittstelle<br> zu Liververk\u00e4ufen und der Nutzung von Steuerdaten. Es reicht eine PLZ der USA oder Kanadas anzugeben<br>und diese wird umgehend auf die allgemeinen Verk\u00e4ufe, und Verbrauchssteuern f\u00fcr den Bundesstaat,<br>den Kreis, die Stadt, MTA, SPD und anderes angebildet. Die Steuerdaten werden dann \u00fcber<br>einen XML-basierten Webdienst direkt in beliebige Anwendungen, Plattformen, Produkte<br>und Webseiten geliefert.</html>

ZipCode_Desc=<html>Der StrikeIron-Dienst f\u00fcr Postleitzahlen liefert f\u00fcr eine Postleitzahl der USA oder Kanadas umgehend den Bundesstaat, den Kreis, den L\u00e4ngen- und Breitengrad, sowie die Zeitzone.</html>

