# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.


CHECKOUT_ACSD_Completed_Dialog = \u3053\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u3067\u306f\u3001SVN\u304b\u3089\u6b63\u3057\u304f\u30bd\u30fc\u30b9\u3092\u30c1\u30a7\u30c3\u30af\u30fb\u30a2\u30a6\u30c8\u3057\u305f\u3042\u3068\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3067\u304d\u307e\u3059\u3002
EXPORT_ACSD_Completed_Dialog = \u3053\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u3067\u306f\u3001SVN\u304b\u3089\u6b63\u3057\u304f\u30bd\u30fc\u30b9\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u305f\u3042\u3068\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3067\u304d\u307e\u3059\u3002
CLONE_ACSD_Completed_Dialog = \u3053\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u3067\u306f\u3001\u5916\u90e8\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089\u6b63\u3057\u304f\u30bd\u30fc\u30b9\u3092\u30af\u30ed\u30fc\u30f3\u3057\u305f\u3042\u3068\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3067\u304d\u307e\u3059\u3002

CHECKOUT_BK3001=<html><b>\u30c1\u30a7\u30c3\u30af\u30a2\u30a6\u30c8\u5b8c\u4e86</b><p>\n\u4ee5\u4e0b\u306b\u9032\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u3059: <ul><li>\u65e2\u5b58\u306eNetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f<li>\u30c1\u30a7\u30c3\u30af\u30a2\u30a6\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3059\u308b</ul>
EXPORT_BK3001=<html><b>\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u5b8c\u4e86</b><p>\n\u6b21\u306b\u9032\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u3059: <ul><li>\u65e2\u5b58\u306eNetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u59cb\u3001\u307e\u305f\u306f<li>\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002</ul>
CLONE_BK3001=<html><b>\u30af\u30ed\u30fc\u30f3\u5b8c\u4e86</b><p>\n\u6b21\u306b\u9032\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u3059: <ul><li>\u65e2\u5b58\u306eNetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u59cb\u3001\u307e\u305f\u306f<li>\u30af\u30ed\u30fc\u30f3\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002</ul>

CHECKOUT_BK3008=\u30c1\u30a7\u30c3\u30af\u30a2\u30a6\u30c8\u5b8c\u4e86
EXPORT_BK3008=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u5b8c\u4e86
CLONE_BK3008=\u30af\u30ed\u30fc\u30f3\u5b8c\u4e86

CHECKOUT_BK3009=<html>{0}\u500b\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u30c1\u30a7\u30c3\u30af\u30fb\u30a2\u30a6\u30c8\u3055\u308c\u307e\u3057\u305f\u3002<p>\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304d\u307e\u3059\u304b?
EXPORT_BK3009=<html>{0}\u500b\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002<p>\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304d\u307e\u3059\u304b?
CLONE_BK3009=<html>{0}\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u30af\u30ed\u30fc\u30f3\u3055\u308c\u307e\u3057\u305f\u3002<p>\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304d\u307e\u3059\u304b?

CHECKOUT_BK3010=<html>\u30c1\u30a7\u30c3\u30af\u30fb\u30a2\u30a6\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089IDE\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3057\u307e\u3059\u304b?
EXPORT_BK3010=<html>\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089IDE\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3057\u307e\u3059\u304b?
CLONE_BK3010=<html>\u30af\u30ed\u30fc\u30f3\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089IDE\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3057\u307e\u3059\u304b?

CHECKOUT_BK3011=<html>{0}\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u30c1\u30a7\u30c3\u30af\u30fb\u30a2\u30a6\u30c8\u3055\u308c\u307e\u3057\u305f\u3002<p>\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304d\u307e\u3059\u304b?
EXPORT_BK3011=<html>{0}\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002<p>\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304d\u307e\u3059\u304b?
CLONE_BK3011=<html>{0}\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u30af\u30ed\u30fc\u30f3\u3055\u308c\u307e\u3057\u305f\u3002<p>\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304d\u307e\u3059\u304b?

CHECKOUT_TT_OpenProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d4\u30c3\u30ab\u30fc\u3078\u884c\u304d\u3001\u30c1\u30a7\u30c3\u30af\u30fb\u30a2\u30a6\u30c8\u3055\u308c\u305f\u30bd\u30fc\u30b9\u304b\u3089\u958b\u304f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u9078\u629e
EXPORT_TT_OpenProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d4\u30c3\u30ab\u30fc\u3078\u884c\u304d\u3001\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u305f\u30bd\u30fc\u30b9\u304b\u3089\u958b\u304f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u9078\u629e
CLONE_TT_OpenProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d4\u30c3\u30ab\u30fc\u3078\u884c\u304d\u3001\u30af\u30ed\u30fc\u30f3\u3055\u308c\u305f\u30bd\u30fc\u30b9\u304b\u3089\u958b\u304f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u9078\u629e\u3057\u307e\u3059

CHECKOUT_TT_CreateProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30a6\u30a3\u30b6\u30fc\u30c9\u3067\u3001\u30c1\u30a7\u30c3\u30af\u30fb\u30a2\u30a6\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210
EXPORT_TT_CreateProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30a6\u30a3\u30b6\u30fc\u30c9\u3067\u3001\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210
CLONE_TT_CreateProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30a6\u30a3\u30b6\u30fc\u30c9\u3067\u3001\u30af\u30ed\u30fc\u30f3\u3057\u305f\u30bd\u30fc\u30b9\u304b\u3089\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210

ACSN_ProjectOutlineView=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d3\u30e5\u30fc
ACSD_ProjectOutlineView=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u8868\u793a

BK3002=\u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044
BK3003=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f...
BK3004=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210...
BK3005=\u9589\u3058\u308b(&C)
BK3012=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f

TT_Close=\u30c0\u30a4\u30a2\u30ed\u30b0\u3092\u9589\u3058\u308b

OpenProjectsPanel.cbOpenRequired.text=\u5fc5\u9808\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f(&R)
LBL_ButtonOpen=\u958b\u304f
LBL_OpenPanelLabel=\u958b\u3044\u3066\u3044\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
LBL_ButtonCancel=\u53d6\u6d88
OpenProjectsPanel.cbOpenRequired.TTtext=\u4f9d\u5b58\u6027\u3082\u958b\u304f
OpenProjectsPanel.jLabel1.text=\u9078\u629e\u3057\u305f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304d\u307e\u3059:

LBL_Path=\u30d1\u30b9
LBL_PathDesc=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30ed\u30fc\u30ab\u30eb\u30fb\u30d1\u30b9
CheckoutCompletedPanel.cbOpenInFavorites=\u304a\u6c17\u306b\u5165\u308a\u3067\u30bd\u30fc\u30b9\u3092\u958b\u304f(&F)
CLONE_CheckoutCompletedPanel.cbOpenInFavorites.TT=\u304a\u6c17\u306b\u5165\u308a\u30d3\u30e5\u30fc\u3067\u30af\u30ed\u30fc\u30f3\u3057\u305f\u30bd\u30fc\u30b9\u3092\u958b\u304f
EXPORT_CheckoutCompletedPanel.cbOpenInFavorites.TT=\u304a\u6c17\u306b\u5165\u308a\u30d3\u30e5\u30fc\u3067\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u3092\u958b\u304f
CHECKOUT_CheckoutCompletedPanel.cbOpenInFavorites.TT=\u304a\u6c17\u306b\u5165\u308a\u30d3\u30e5\u30fc\u3067\u30c1\u30a7\u30c3\u30af\u30fb\u30a2\u30a6\u30c8\u3057\u305f\u30bd\u30fc\u30b9\u3092\u958b\u304f

