# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

TOOLTIP_HelpBar=\u30d8\u30eb\u30d7\u30fb\u30d0\u30fc\u306f\u3001GUI\u30c7\u30b6\u30a4\u30f3\u306e\u305f\u3081\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30d2\u30f3\u30c8\u3092\u8868\u793a\u3057\u307e\u3059\u3002

# General messages shown in select mode
select_1=\u30b3\u30f3\u30c6\u30ca\u306e\u30ec\u30a4\u30a2\u30a6\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30cb\u30e5\u30fc\u306e\u300c\u30ec\u30a4\u30a2\u30a6\u30c8\u3092\u8a2d\u5b9a\u300d\u30b5\u30d6\u30e1\u30cb\u30e5\u30fc\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
select_2=\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30cb\u30e5\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3001\u9078\u629e\u3057\u305f\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3067\u4f7f\u7528\u53ef\u80fd\u306a\u4fbf\u5229\u306a\u30a2\u30af\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30bb\u30b9\u3057\u307e\u3059\u3002
select_3=\u30d5\u30a9\u30fc\u30e0\u306e\u30c7\u30b6\u30a4\u30f3\u3092\u30c6\u30b9\u30c8\u3059\u308b\u306b\u306f\u3001\u30c4\u30fc\u30eb\u30d0\u30fc\u306e\u300c\u30c7\u30b6\u30a4\u30f3\u306e\u30d7\u30ec\u30d3\u30e5\u30fc\u300d\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
select_4=\u9818\u57df\u5185\u306e\u8907\u6570\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u9078\u629e\u3059\u308b\u306b\u306f\u3001[Shift]\u3092\u62bc\u3057\u306a\u304c\u3089\u30de\u30a6\u30b9\u3092\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u4e0a\u3067\u30c9\u30e9\u30c3\u30b0\u3057\u307e\u3059\u3002
select_5=\u30ca\u30d3\u30b2\u30fc\u30bf\u3067\u30eb\u30fc\u30c8\u30fb\u30ce\u30fc\u30c9\u3092\u9078\u629e\u3057\u3066\u3001\u30d5\u30a9\u30fc\u30e0\u306e\u69d8\u3005\u306a\u4fbf\u5229\u306a\u8a2d\u5b9a\u306b\u30a2\u30af\u30bb\u30b9\u3057\u307e\u3059(\u300c\u30d7\u30ed\u30d1\u30c6\u30a3\u300d\u5185)\u3002
select_6=\u300c\u30ca\u30d3\u30b2\u30fc\u30bf\u300d\u30a6\u30a3\u30f3\u30c9\u30a6\u306f\u3001\u958b\u3044\u3066\u3044\u308b\u30d5\u30a9\u30fc\u30e0\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30c4\u30ea\u30fc\u69cb\u9020\u3092\u8868\u793a\u3057\u307e\u3059\u3002
select_7=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u8907\u6570\u56de\u8ffd\u52a0\u3059\u308b\u306b\u306f\u3001\u30d1\u30ec\u30c3\u30c8\u3067\u30af\u30ea\u30c3\u30af\u3057\u3066\u9078\u629e\u3057\u3001[Shift]\u3092\u62bc\u3057\u306a\u304c\u3089\u30c7\u30b6\u30a4\u30f3\u30fb\u30ad\u30e3\u30f3\u30d0\u30b9\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002
select_8=\u300c\u30c4\u30fc\u30eb\u300d>\u300c\u30d1\u30ec\u30c3\u30c8\u300d>\u300cSwing/AWT\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u300d\u30e1\u30cb\u30e5\u30fc\u9805\u76ee\u304b\u3089\u30d1\u30ec\u30c3\u30c8\u306e\u5185\u5bb9\u3092\u5909\u66f4\u3067\u304d\u307e\u3059\u3002

# Connect mode messages
connectSource=\u30a4\u30d9\u30f3\u30c8\u3092\u751f\u6210\u3059\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u9078\u629e\u3057\u307e\u3059\u3002
connectTarget=\u30a4\u30d9\u30f3\u30c8\u3092\u53d7\u4fe1\u3059\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u9078\u629e\u3057\u307e\u3059\u3002
connectWizard=\u63a5\u7d9a\u306e\u8a73\u7d30\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

# Moving/resizing messages
alignHorizontalLeading=\u5225\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u5de6\u5074\u306b\u4f4d\u7f6e\u63c3\u3048\u3057\u307e\u3059\u3002
alignHorizontalTrailing=\u5225\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u53f3\u5074\u306b\u4f4d\u7f6e\u63c3\u3048\u3057\u307e\u3059\u3002
alignVerticalLeading=\u5225\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0a\u90e8\u306b\u4f4d\u7f6e\u63c3\u3048\u3057\u307e\u3059\u3002
alignVerticalTrailing=\u5225\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0b\u90e8\u306b\u4f4d\u7f6e\u63c3\u3048\u3057\u307e\u3059\u3002
alignVerticalBaseline=\u5225\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30d9\u30fc\u30b9\u30e9\u30a4\u30f3\u306b\u4f4d\u7f6e\u63c3\u3048\u3057\u307e\u3059\u3002
nextToContainerHorizontalLeading=\u30b3\u30f3\u30c6\u30ca\u306e\u5de6\u306e\u5883\u754c\u304b\u3089\u512a\u5148\u306e\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToContainerHorizontalTrailing=\u30b3\u30f3\u30c6\u30ca\u306e\u53f3\u306e\u5883\u754c\u304b\u3089\u512a\u5148\u306e\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToContainerVerticalLeading=\u30b3\u30f3\u30c6\u30ca\u306e\u4e0a\u306e\u5883\u754c\u304b\u3089\u512a\u5148\u306e\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToContainerVerticalTrailing=\u30b3\u30f3\u30c6\u30ca\u306e\u4e0b\u304b\u3089\u512a\u5148\u306e\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToRelatedHorizontalLeading=\u5de6\u5074\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u512a\u5148\u306e\u5c0f\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToUnrelatedHorizontalLeading=\u5de6\u5074\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u512a\u5148\u306e\u4e2d\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToSeparateHorizontalLeading=\u5de6\u5074\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u512a\u5148\u306e\u9577\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToRelatedHorizontalTrailing=\u53f3\u5074\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u512a\u5148\u306e\u5c0f\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToUnrelatedHorizontalTrailing=\u53f3\u5074\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u512a\u5148\u306e\u4e2d\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToSeparateHorizontalTrailing=\u53f3\u5074\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u512a\u5148\u306e\u9577\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToRelatedVerticalLeading=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0a\u304b\u3089\u512a\u5148\u306e\u5c0f\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToUnrelatedVerticalLeading=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0a\u304b\u3089\u512a\u5148\u306e\u4e2d\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToSeparateVerticalLeading=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0a\u304b\u3089\u512a\u5148\u306e\u9577\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToRelatedVerticalTrailing=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0b\u304b\u3089\u512a\u5148\u306e\u5c0f\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToUnrelatedVerticalTrailing=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0b\u304b\u3089\u512a\u5148\u306e\u4e2d\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
nextToSeparateVerticalTrailing=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u4e0b\u304b\u3089\u512a\u5148\u306e\u4e2d\u8ddd\u96e2\u306b\u5408\u308f\u305b\u307e\u3059\u3002
indent=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u30a4\u30f3\u30c7\u30f3\u30c8\u3057\u307e\u3059\u3002
generalPosition=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u305d\u308c\u306e\u4f4d\u7f6e\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002
generalResizing=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u5927\u304d\u3055\u3092\u5909\u66f4\u3057\u307e\u3059\u3002
gapResizing=\u30ae\u30e3\u30c3\u30d7\u3092\u30b5\u30a4\u30ba\u5909\u66f4\u3057\u307e\u3059\u3002
unplacedComponent1=\u30b3\u30d4\u30fc\u307e\u305f\u306f\u633f\u5165\u3055\u308c\u305f\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8 - \u307e\u3060\u30ec\u30a4\u30a2\u30a6\u30c8\u306b\u914d\u7f6e\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
unplacedComponent2=\u30de\u30a6\u30b9\u3092\u4f7f\u3063\u3066\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u79fb\u52d5\u3057\u3066\u914d\u7f6e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
unplacedComponents1=\u30b3\u30d4\u30fc\u307e\u305f\u306f\u633f\u5165\u3055\u308c\u305f\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8 - \u307e\u3060\u30ec\u30a4\u30a2\u30a6\u30c8\u306b\u914d\u7f6e\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
unplacedComponents2=\u30de\u30a6\u30b9\u3092\u4f7f\u3063\u3066\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u79fb\u52d5\u3057\u3066\u914d\u7f6e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# Clickable layout gaps
layoutGaps=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u9593\u306e\u30ae\u30e3\u30c3\u30d7\u306f\u3001\u30de\u30a6\u30b9\u7d4c\u7531\u3067\u9078\u629e\u3057\u3066\u8abf\u6574\u3057\u305f\u308a\u3001\u30c0\u30a4\u30a2\u30ed\u30b0\u3067\u7de8\u96c6\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
selectedLayoutGaps_1=\u9078\u629e\u3057\u305f\u30ae\u30e3\u30c3\u30d7\u3092\u30de\u30a6\u30b9\u7d4c\u7531\u3067\u30b5\u30a4\u30ba\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u30b5\u30a4\u30ba\u5909\u66f4\u30cf\u30f3\u30c9\u30eb\u3092\u30c9\u30e9\u30c3\u30b0\u3059\u308b\u304b\u3001\u30de\u30a6\u30b9\u30fb\u30db\u30a4\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
selectedLayoutGaps_2=\u30ae\u30e3\u30c3\u30d7\u3092\u30c0\u30d6\u30eb\u30af\u30ea\u30c3\u30af\u3059\u308b\u304b\u3001\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30cb\u30e5\u30fc\u304b\u3089\u300c\u30ec\u30a4\u30a2\u30a6\u30c8\u30fb\u30b9\u30da\u30fc\u30b9\u3092\u7de8\u96c6\u300d\u3092\u8d77\u52d5\u3057\u3001\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u7528\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u3092\u8868\u793a\u3057\u307e\u3059\u3002
selectedLayoutGaps_3=\u30ae\u30e3\u30c3\u30d7\u3092\u9078\u629e\u3057\u306b\u304f\u3044\u5834\u5408\u306f\u3001\u96a3\u63a5\u3059\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u4e0a\u3067\u300c\u30ec\u30a4\u30a2\u30a6\u30c8\u30fb\u30b9\u30da\u30fc\u30b9\u3092\u7de8\u96c6\u300d\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30cb\u30e5\u30fc\u30fb\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u8d77\u52d5\u3057\u307e\u3059\u3002
selectedLayoutGaps_4=\u65b0\u3057\u3044\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u633f\u5165\u3059\u308b\u5834\u6240\u3092\u78ba\u4fdd\u3059\u308b\u306a\u3069\u306e\u5834\u5408\u306f\u3001\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u79fb\u52d5\u3059\u308b\u306e\u3067\u306f\u306a\u304f\u30ae\u30e3\u30c3\u30d7\u3092\u8abf\u6574\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# Layout managers
absoluteLayout=[{0}\u3001{1}]\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u914d\u7f6e\u3057\u307e\u3059\u3002
borderLayout={0}\u9818\u57df\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u914d\u7f6e\u3057\u307e\u3059\u3002
boxLayout={0}\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u914d\u7f6e\u3057\u307e\u3059\u3002
flowLayout={0}\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u914d\u7f6e\u3057\u307e\u3059\u3002
gridLayout={0}\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u914d\u7f6e\u3057\u307e\u3059\u3002
toolbarLayout={0}\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u914d\u7f6e\u3057\u307e\u3059\u3002
splitPaneLayout={0}\u9818\u57df\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u914d\u7f6e\u3057\u307e\u3059\u3002
jscrollPaneLayout=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092JScrollPane\u306b\u8ffd\u52a0\u3057\u307e\u3059\u3002
scrollPaneLayout=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092ScrollPane\u306b\u8ffd\u52a0\u3057\u307e\u3059\u3002
tabbedPaneLayout=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092JTabbedPane\u306e\u30bf\u30d6\u3068\u3057\u3066\u8ffd\u52a0\u3057\u307e\u3059\u3002
cardLayout=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092CardLayout\u306e\u30ab\u30fc\u30c9\u3068\u3057\u3066\u8ffd\u52a0\u3057\u307e\u3059\u3002

# Selection
tabbedPaneEmpty=\u30b3\u30f3\u30c6\u30ca\u307e\u305f\u306f\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u8ffd\u52a0\u3057\u3066\u3001\u30bf\u30d6\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
tabbedPaneOne=2\u3064\u76ee\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u307e\u305f\u306f\u30b3\u30f3\u30c6\u30ca\u3092\u8ffd\u52a0\u3057\u3066\u30012\u3064\u76ee\u306e\u30bf\u30d6\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
tabbedPane_1=\u30bf\u30d6\u306e\u30c6\u30ad\u30b9\u30c8\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u30bf\u30d6\u3092\u30c0\u30d6\u30eb\u30fb\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002
tabbedPane_2=\u30bf\u30d6\u306e\u9806\u756a\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u30ca\u30d3\u30b2\u30fc\u30bf\u5185\u3067\u30c9\u30e9\u30c3\u30b0\u30fb\u30a2\u30f3\u30c9\u30fb\u30c9\u30ed\u30c3\u30d7\u3057\u307e\u3059\u3002
buttonGroup=JRadioButtons\u306e\u6392\u4ed6\u7684\u30b0\u30eb\u30fc\u30d7\u3092\u4f5c\u6210\u3059\u308b\u306b\u306f\u3001ButtonGroup\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3068buttonGroup\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
designThisContainer=\u3053\u306e\u30b3\u30f3\u30c6\u30ca\u306b\u30d5\u30a9\u30fc\u30ab\u30b9\u3059\u308b\u306b\u306f\u3001\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30e1\u30cb\u30e5\u30fc\u304b\u3089\u300c\u3053\u306e\u30b3\u30f3\u30c6\u30ca\u3092\u30c7\u30b6\u30a4\u30f3\u300d\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
comboBoxModel=JComboBox\u306e\u5185\u5bb9\u3092\u7de8\u96c6\u3059\u308b\u306b\u306f\u3001\u30e2\u30c7\u30eb\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
listModel=JList\u306e\u5185\u5bb9\u3092\u7de8\u96c6\u3059\u308b\u306b\u306f\u3001\u30e2\u30c7\u30eb\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
tableModel=JTable\u306e\u5185\u5bb9\u3092\u7de8\u96c6\u3059\u308b\u306b\u306f\u3001\u30e2\u30c7\u30eb\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
scrollPaneEmpty=\u30b9\u30af\u30ed\u30fc\u30eb\u30fb\u30da\u30a4\u30f3\u306e\u30d3\u30e5\u30fc\u3068\u3057\u3066\u6a5f\u80fd\u3059\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
scrollPane=\u30d3\u30e5\u30fc\u3092\u9078\u629e\u3059\u308b\u306b\u306f\u3001\u30b9\u30af\u30ed\u30fc\u30eb\u30fb\u30da\u30a4\u30f3\u3092\u3075\u305f\u305f\u3073\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002

# Other
missingMenubar=\u30e1\u30cb\u30e5\u30fc\u30fb\u30d0\u30fc\u304c\u306a\u3044\u30d5\u30a9\u30fc\u30e0\u306b\u30e1\u30cb\u30e5\u30fc\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u8ffd\u52a0\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

