# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

# BrokenServerSupport
LBL_Resolve_Missing_Server_Title=\u4e0d\u8db3\u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u554f\u984c\u3092\u89e3\u6c7a
ACSD_Resolve_Missing_Server=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u9078\u629e\u3057\u307e\u3059\u3002\u9069\u5207\u306a\u30b5\u30fc\u30d0\u30fc\u304c\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u3067\u9069\u5207\u306a\u30b5\u30fc\u30d0\u30fc\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LBL_BrokenServerCustomizer_Close=\u9589\u3058\u308b

MSG_Broken_Server_Title=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f

# BrokenDatasourceSupport
LBL_Resolve_Missing_Datasources_Title=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u89e3\u6c7a
LBL_BrokenDatasourcesCustomizer_Close=\u9589\u3058\u308b
ACSD_Resolve_Missing_Datasources=\u4e0b\u306e\u300c\u89e3\u6c7a\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u3092\u89e3\u6c7a\u3067\u304d\u307e\u3059
ACSD_BrokenDatasourcesCustomizer_Close=\u9589\u3058\u308b
MSG_Broken_Datasources_Title=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f

# BrokenReferencesAlertPanel
MSG_Broken_References=1\u3064\u307e\u305f\u306f\u8907\u6570\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30ea\u30bd\u30fc\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u53f3\u30af\u30ea\u30c3\u30af\u3057\u3001\u300c\u53c2\u7167\u306e\u554f\u984c\u3092\u89e3\u6c7a\u300d\u3092\u9078\u629e\u3057\u3066\u554f\u984c\u3092\u89e3\u6c7a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_Broken_References_Again=\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4eca\u5f8c\u3082\u8868\u793a 
MSG_Broken_References_Title=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f
MSG_Broken_References_OK=OK

# BrokenServerAlertPanel
ACSN_BrokenServersAlertPanel=\u5b58\u5728\u3057\u306a\u3044\u30b5\u30fc\u30d0\u30fc\u30fb\u30d1\u30cd\u30eb

ACSN_BrokenServersAlertPanel_notAgain=\u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044

MSG_Broken_Server=<html>1\u3064\u4ee5\u4e0a\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30b5\u30fc\u30d0\u30fc\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002<br>\u300c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u300d\u30a6\u30a3\u30f3\u30c9\u30a6\u3067\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u53f3\u30af\u30ea\u30c3\u30af\u3057\u3001<br>\u300c\u4e0d\u8db3\u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u554f\u984c\u3092\u89e3\u6c7a\u300d\u3092\u9078\u629e\u3057\u3066\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
MSG_Broken_Server_Again=\u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044(&D)

# BrokenDataSourceAlertPanel
ACSN_BrokenDatasourcesAlertPanel=\u58ca\u308c\u3066\u3044\u308b\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u30fb\u30d1\u30cd\u30eb

ACSN_BrokenDatasourcesAlertPanel_notAgain=\u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044

MSG_Broken_Datasources=<html>1\u3064\u4ee5\u4e0a\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u3001\u767b\u9332\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002<br>\u300c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u300d\u30a6\u30a3\u30f3\u30c9\u30a6\u3067\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u53f3\u30af\u30ea\u30c3\u30af\u3057\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u306e\u767b\u9332\u3092\u652f\u63f4\u3059\u308b<br><b>\u300c\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u554f\u984c\u3092\u89e3\u6c7a\u300d</b>\u3092\u9078\u629e\u3057\u307e\u3059\u3002</html>
MSG_Broken_Datasources_Again=\u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044(&D)
MSG_Broken_Datasources_Register_Driver=\u30c9\u30e9\u30a4\u30d0\u3092{0}\u306b\u767b\u9332\u3057\u3001\u300cOK\u300d\u3092\u62bc\u3057\u3066\u7d9a\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_Broken_Datasources_Missing_Driver={0}\u306b\u767b\u9332\u3055\u308c\u305f\u30c9\u30e9\u30a4\u30d0\u306f\u3042\u308a\u307e\u305b\u3093\u3002

# NoSelectedServerWarning
LBL_NoSuitableServerWarning_jLabel2=\u73fe\u5728\u9069\u5207\u306a\u30b5\u30fc\u30d0\u30fc\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u554f\u984c\u304c\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b5\u30fc\u30d0\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u3067\u9069\u5207\u306a\u30b5\u30fc\u30d0\u30fc\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LBL_NoSelectedServerWarning_jLabel1=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30b5\u30fc\u30d0\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u3001\u524a\u9664\u3055\u308c\u3066\u3044\u307e\u3059\u3002
LBL_NoSelectedServerWarning_listLabel=\u4f7f\u7528\u53ef\u80fd\u306a{0}\u4e92\u63db\u306e\u30b5\u30fc\u30d0\u30fc:
LBL_AddServer=\u30b5\u30fc\u30d0\u30fc\u306e\u8ffd\u52a0(&A)...
ACSN_AddServer=\u300c\u30b5\u30fc\u30d0\u30fc\u306e\u8ffd\u52a0\u300d\u30dc\u30bf\u30f3

LBL_SelectDatasource=\u89e3\u6c7a\u3059\u308b\u306b\u306f\u3001\u4e0b\u306e\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u540d\u3092\u9078\u629e\u3057\u3001\u300c\u63a5\u7d9a\u306e\u8ffd\u52a0\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002
LBL_MissingDatabaseConnectionWarning=\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u308b\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
LBL_AddDatabaseConnection=\u63a5\u7d9a\u306e\u8ffd\u52a0(&A)...
ACSN_BrokenDatasourceAlertPanel=\u58ca\u308c\u3066\u3044\u308b\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u30fb\u30d1\u30cd\u30eb


ACSN_AddDatabaseConnection=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u306e\u8ffd\u52a0

LBL_NoSuitableDatabaseConnectionWarning_jLabel2=LBL_MissingDatabaseConnectionWarning
MSG_Broken_Server_Libraries=<html>1\u3064\u4ee5\u4e0a\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u5fc5\u8981\u306a\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u304c\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002<br>\u300c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u300d\u30a6\u30a3\u30f3\u30c9\u30a6\u3067\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u53f3\u30af\u30ea\u30c3\u30af\u3057\u3001<br><b>\u300c\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u554f\u984c\u3092\u89e3\u6c7a\u300d</b>\u3092\u9078\u629e\u3057\u3066\u3001\u8a73\u7d30\u3092\u8868\u793a\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
MSG_Broken_Server_Libraries_Again=\u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044(&D)
ACSN_BrokenServerLibrariesAlertPanel_notAgain=\u4eca\u5f8c\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8868\u793a\u3057\u306a\u3044

ACSN_BrokenServerLibrariesAlertPanel=\u58ca\u308c\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d1\u30cd\u30eb

LBL_BrokenServerLibrariesCustomizer_Close=\u9589\u3058\u308b
MSG_Broken_Server_Libraries_Title=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f


LBL_Resolve_Broken_Server_Library_Title=\u4e0d\u8db3\u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u554f\u984c\u3092\u89e3\u6c7a
MSG_Resolve_Broken_Server_Library_Fix_Message=\u4e0d\u8db3\u3057\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u30b5\u30fc\u30d0\u30fc\u306b\u30c7\u30d7\u30ed\u30a4\u3067\u304d\u307e\u3059\u3002\u4e0d\u8db3\u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u30c7\u30d7\u30ed\u30a4\u3057\u307e\u3059\u304b(\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u304c\u5fc5\u8981\u306b\u306a\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059)?

