# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

template_app=Java\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
template_existing=\u65e2\u5b58\u306e\u30bd\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308bJava\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
template_library=Java\u30af\u30e9\u30b9\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea
Templates/Project/Standard=Java
#New project wizard


#1st panel
LBL_NWP1_ProjectName_Label=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u540d(&N):

LBL_NWP1_ProjectLocation_Label=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240(&L):

LBL_NWP1_BrowseLocation_Button=\u53c2\u7167(&O)...

LBL_NWP1_CreatedProjectFolder_Lablel=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0(&D):






LBL_NWP1_SelectProjectLocation=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240\u3092\u9078\u629e
TXT_NameAndLoc=\u540d\u524d\u3068\u5834\u6240
TXT_NewJavaApp=Java\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
TXT_NewJavaLib=Java\u30af\u30e9\u30b9\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea
TXT_JavaExtSourcesProjectLocation=\u65e2\u5b58\u306e\u30bd\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308bJava\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
ACSD_NewJavaApp=\u65b0\u898fJava\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210
ACSD_NewJavaLib=Java\u30af\u30e9\u30b9\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u65b0\u898f\u4f5c\u6210\u3057\u307e\u3059
ACSD_JavaExtSourcesProjectLocation=\u65e2\u5b58\u306e\u30bd\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308bJava\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u65b0\u898f\u4f5c\u6210\u3057\u307e\u3059




LAB_ConfigureProject=\u540d\u524d\u3068\u5834\u6240
LAB_ConfigureSourceRoots=\u65e2\u5b58\u306e\u30bd\u30fc\u30b9
LAB_PanelIncludesExcludes=\u542b\u3081\u308b/\u9664\u5916\u3059\u308b
LAB_IteratorName={0}/{1}
ERROR_IllegalMainClassName=\u30e1\u30a4\u30f3\u30fb\u30af\u30e9\u30b9\u540d\u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
MSG_IllegalProjectLocation=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u304c\u6709\u52b9\u306a\u30d1\u30b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
MSG_ProjectInRootNotSupported=\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u306e\u30eb\u30fc\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u3067\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u4f5c\u6210\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

#PanelSourceFolders
CTL_AddSourceRoot=\u30bd\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0\u3092\u53c2\u7167
CTL_AddTestRoot=\u30c6\u30b9\u30c8\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0\u3092\u53c2\u7167
LBL_SourceDirectoriesLabel=\u30bd\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u307e\u305f\u306fJUnit\u30c6\u30b9\u30c8\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u542b\u3080\u30d5\u30a9\u30eb\u30c0\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
MSG_IllegalProjectName=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u540d\u304c\u6709\u52b9\u306a\u30d5\u30a9\u30eb\u30c0\u540d\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
MSG_ProjectFolderExists=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u3001\u7a7a\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
MSG_ProjectFolderReadOnly=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
MSG_ProjectFolderInvalid=\u3059\u3067\u306b{0}\u3092\u542b\u3080\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u914d\u7f6e\u3067\u304d\u307e\u305b\u3093\u3002
# #47611: old project metadata was deleted, but the IDE still has a "live" project there
# (should not be an error in the future: see #42422)
MSG_ProjectFolderHasDeletedProject=<html>\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u306f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8{0}\u306b\u3088\u3063\u3066\u7ba1\u7406\u3055\u308c\u3066\u3044\u307e\u3059\u3002<br>\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3059\u308b\u4ee3\u308f\u308a\u306b\u3001\u305d\u308c\u3092\u958b\u304d\u307e\u3059\u3002\u4e07\u304c\u4e00\u30d7\u30ed\u30b8\u30a7\u30af\u30c8{0}\u3092\u524a\u9664\u3057\u3066\u3057\u307e\u3063\u305f\u5834\u5408\u306f\u3001IDE\u3092\u518d\u8d77\u52d5\u3057\u3066\u30d5\u30a9\u30eb\u30c0\u3092\u518d\u5229\u7528\u3057\u307e\u3059\u3002
MSG_ProjectMightAlreadyExists=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u3059\u3067\u306b\u5b58\u5728\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059(\u30e1\u30e2\u30ea\u30fc\u5185\u306e\u307f)
TXT_NetBeansProject=NetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
TXT_BuildXML="build.xml"\u30d5\u30a1\u30a4\u30eb
TXT_BuildFolder="build"\u30d5\u30a9\u30eb\u30c0
MSG_IllegalSources=\u30bd\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0{0}\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
MSG_IllegalTests=\u30c6\u30b9\u30c8\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0{0}\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
MSG_IllegalProjectFolder=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u306f\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u542b\u3080\u30d5\u30a9\u30eb\u30c0\u306e\u5916\u306b\u5b58\u5728\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
MSG_WrongBuildScriptName=\u7121\u52b9\u306a\u30d3\u30eb\u30c9\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u540d






LBL_ProjectNameAndLocationLabel=\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u540d\u524d\u3068\u5834\u6240\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
CTL_SourceRoots=\u30bd\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0:

CTL_TestRoots=\u30c6\u30b9\u30c8\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0:













TXT_RootOwnedByProject={0} ({1}\u304c\u6240\u6709)


ACSN_createMainCheckBox=\u30e1\u30a4\u30f3\u30fb\u30af\u30e9\u30b9\u3092\u4f5c\u6210

ACSD_createMainCheckBox=\u30c1\u30a7\u30c3\u30af\u30dc\u30c3\u30af\u30b9\u3092\u9078\u629e\u3059\u308b\u3068\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u30e1\u30a4\u30f3\u30fb\u30af\u30e9\u30b9\u304c\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002

LBL_createMainCheckBox=\u30e1\u30a4\u30f3\u30fb\u30af\u30e9\u30b9\u306e\u4f5c\u6210(&C)







ACSN_projectNameLabel=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u540d

ACSD_projectNameLabel=\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u540d\u524d

ACSN_projectLocationLabel=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240:

ACSD_projectLocationLabel=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30eb\u30fc\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u306e\u5834\u6240

ACSN_browseButton=\u53c2\u7167

ACSD_browseButton=\u300c\u53c2\u7167\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240\u30c1\u30e5\u30fc\u30b6\u304c\u958b\u304d\u307e\u3059\u3002





LBL_NWP1_BrowseLocation_Button1=\u53c2\u7167(&W)...

LBL_NWP1_BrowseLocation_Button2=\u53c2\u7167(&R)...
ACSN_jLabel3=\u65e2\u5b58\u306eJava\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u542b\u3080\u30d5\u30a9\u30eb\u30c0\u3092\u9078\u629e\u3057\u307e\u3059\u3002



ACSN_jLabel4=\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u540d\u524d\u3068\u5834\u6240\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002













LBL_NWP1_BrowseLocation_Button3=\u53c2\u7167(&O)...

ASCN_mainClassTextFiled=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30e1\u30a4\u30f3\u30fb\u30af\u30e9\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

ACSN_jLabel2=\u30c6\u30b9\u30c8\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0

ACSD_jLabel2=\u30c6\u30b9\u30c8\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30eb\u30fc\u30c8\u3092\u542b\u3080\u30d5\u30a9\u30eb\u30c0\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

ACSN_jLabel1=\u30bd\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0

ACSD_jLabel1=\u30bd\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30eb\u30fc\u30c8\u3092\u542b\u3080\u30d5\u30a9\u30eb\u30c0\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002













MSG_FoundClassFiles=<html><p><strong>\u6307\u5b9a\u3055\u308c\u305f\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d5\u30a9\u30eb\u30c0\u306b\u306f\u3001\u30b3\u30f3\u30d1\u30a4\u30eb\u6e08\u306e\u30af\u30e9\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb(*.class)\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002</strong></p><br><p>IDE\u306b\u3088\u3063\u3066"build"\u30d5\u30a9\u30eb\u30c0\u306b\u30b3\u30f3\u30d1\u30a4\u30eb\u3057\u305f\u30af\u30e9\u30b9</p><p>\u30d5\u30a1\u30a4\u30eb\u304c\u751f\u6210\u3055\u308c\u308b\u305f\u3081\u3001\u65e2\u5b58\u306e\u30b3\u30f3\u30d1\u30a4\u30eb\u6e08\u30af\u30e9\u30b9</p><p>\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b\u3053\u3068\u3092\u63a8\u5968\u3057\u307e\u3059\u3002</p><br><p>\u30af\u30e9\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u4eca\u524a\u9664\u3057\u307e\u3059\u304b?</p></html>
MSG_FoundClassFiles_Title=\u65e2\u5b58\u306e\u30bd\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u65b0\u898fJava\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
TXT_DeleteOption=\u524a\u9664
TXT_KeepOption=\u7121\u8996
TXT_CancelOption=\u53d6\u6d88





CTL_AddFolder=\u30d5\u30a9\u30eb\u30c0\u306e\u8ffd\u52a0...

CTL_RemoveFolder=\u9664\u53bb





# NewJ2SEProjectWizardIterator progress bar
LBL_NewJ2SEProjectWizardIterator_WizardProgress_ReadingProperties=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u8aad\u307f\u53d6\u3063\u3066\u3044\u307e\u3059
LBL_NewJ2SEProjectWizardIterator_WizardProgress_CreatingProject=\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059
LBL_NewJ2SEProjectWizardIterator_WizardProgress_PreparingToOpen=\u958b\u304f\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u6e96\u5099\u4e2d
LBL_PanelOptions_Browse_Button=\u53c2\u7167(&W)...
LBL_PanelOptions_SharableProject_Checkbox=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u683c\u7d0d\u7528\u306b\u5c02\u7528\u30d5\u30a9\u30eb\u30c0\u3092\u4f7f\u7528(&U)
LBL_PanelOptions_Location_Label=\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a9\u30eb\u30c0(&I):
LBL_Browse_Libraries_AcceptedFiles=*.properties\u30d5\u30a1\u30a4\u30eb
WARN_PanelOptionsVisual.absolutePath=<html>\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a9\u30eb\u30c0\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u7d76\u5bfe\u30d1\u30b9\u304c\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u6709\u52b9\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002<html>
WARN_PanelOptionsVisual.relativePath=<html>\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a9\u30eb\u30c0\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u76f8\u5bfe\u30d1\u30b9\u304c\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u6709\u52b9\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002<html>
ACSD_browseLibraries=\u4f5c\u6210\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u5b9a\u7fa9\u304c\u3042\u308b\u30d5\u30a9\u30eb\u30c0\u3092\u53c2\u7167\u3057\u307e\u3059
ACSD_sharableProject=\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30fb\u30d0\u30a4\u30ca\u30ea\u3078\u306e\u30d1\u30b9\u3092\u7ba1\u7406\u3059\u308b\u3053\u3068\u3067\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u3068\u5171\u6709\u53ef\u80fd\u306b\u3057\u307e\u3059\u3002
ACSD_LibrariesLocation=\u30e9\u30a4\u30d6\u30e9\u30ea\u5b9a\u7fa9\u30d5\u30a1\u30a4\u30eb\u306e\u5834\u6240\u3092\u542b\u3080\u30d5\u30a9\u30eb\u30c0\u3002
MSG_BuildScriptName=\u30d3\u30eb\u30c9\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u540d(&S):
AD_BuildScriptName=\u30e1\u30a4\u30f3\u306e\u30d3\u30eb\u30c9\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d
HINT_LibrariesFolder=<html>\u8907\u6570\u306e\u30e6\u30fc\u30b6\u30fc\u3068\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u540c\u3058\u30b3\u30f3\u30d1\u30a4\u30eb\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u5171\u6709\u3067\u304d\u307e\u3059(\u8a73\u7d30\u306f\u30d8\u30eb\u30d7\u3092\u53c2\u7167)\u3002
TXT_MoveRootDescription=\u30bd\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u3068\u30c6\u30b9\u30c8\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u4e21\u65b9\u3092\u3001\u3042\u308b\u30ea\u30b9\u30c8\u304b\u3089\u307b\u304b\u306e\u30ea\u30b9\u30c8\u306b\u30c9\u30e9\u30c3\u30b0\u30c9\u30ed\u30c3\u30d7\u3067\u304d\u307e\u3059\u3002
TXT_SearchingClassFiles=\u30af\u30e9\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u691c\u7d22\u3057\u3066\u3044\u307e\u3059...
ERR_DistFolder="dist"\u30d5\u30a9\u30eb\u30c0\u306f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u5185\u306b\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
ImportFoldersPanel.message.text=jLabel1


TXT_BuildArtifactName=\u30d3\u30eb\u30c9\u30fb\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306e\u540d\u524d(&N):

TXT_BuildArtifactFile=\u4f5c\u6210\u3055\u308c\u308b\u30d5\u30a9\u30eb\u30c0(&F):

MSG_ImportFolders=<html>"dist"\u30d5\u30a9\u30eb\u30c0\u306f{0}\u306b\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002<br>\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f7f\u7528\u3059\u308b\u305f\u3081\u306b\u4f5c\u6210\u3055\u308c\u308b\u30d3\u30eb\u30c9\u30fb\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306e\u30d5\u30a9\u30eb\u30c0\u306e\u65b0\u3057\u3044\u540d\u524d\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002<br>\u3053\u306e\u30d5\u30a9\u30eb\u30c0\u304c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u5185\u306b\u5b58\u5728\u3057\u3066\u3044\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002
TITLE_ImportProjectFolders=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240
LBL_SetFolders=OK
AN_SetFolders=OK


