# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

#Question to show user to find out whether start second instance of NetBeans  or not
MSG_AlreadyRunning=An instance of the program seems to be already running with your user directory.\nEither a previous session of the program did not exit correctly, or another instance\nof the program is running on a different computer and using the same user directory.\n\n\u0dc0\u0dd9\u0db1\u0dad\u0dca \u0dc0\u0dd0\u0da9\u0dc3\u0da7\u0dc4\u0db1\u0dca \u0dc0\u0dcf\u0dbb\u0dba\u0d9a\u0dd4\u0dad\u0dca \u0d91\u0d9a\u0db8 \u0db4\u0dbb\u0dd2\u0dc1\u0dd3\u0dbd\u0d9a directory \u0db7\u0dcf\u0dc0\u0dd2\u0dad \u0d9a\u0dbb\u0dba\u0dd2 \u0db1\u0db8\u0dca, \u0d9a\u0dbb\u0dd4\u0dab\u0dcf\u0d9a\u0dbb \nCancel \u0d91\u0db6\u0dd3\u0db8 \u0db8\u0d9c\u0dd2\u0db1\u0dca \u0d91\u0db8 \u0db4\u0dbb\u0dd2\u0dc1\u0dd3\u0dbd\u0d9a directory \u0d91\u0d9a \u0daf\u0dd6\u0dc2\u0dca\u200d\u0dba\u0dc0\u0dd3\u200d\u0db8 \u0dc0\u0dbd\u0d9a\u0dcf\u0dbd\u0db1\u0dca\u0db1. \u0dc0\u0dd9\u0db1\u0dad\u0dca \u0dc0\u0dd0\u0da9\u0dc3\u0da7\u0dc4\u0db1\u0dca \u0dc0\u0dcf\u0dbb\u0dba\u0d9a\u0dd4\u0dad\u0dca\n\u0d94\u0db6\u0d9c\u0dda \u0db4\u0dbb\u0dd2\u0dc1\u0dd3\u0dbd\u0d9a directory \u0d91\u0d9a \u0db7\u0dcf\u0dc0\u0dd2\u0dad \u0db1\u0ddc\u0d9a\u0dbb\u0db1 \u0db6\u0dc0\u0da7 \u0dc3\u0dc4\u0dad\u0dd2\u0d9a \u0db1\u0db8\u0dca \u0db4\u0db8\u0db1\u0d9a\u0dca OK \u0d94\u0db6\u0db1\u0dca\u0db1.
MSG_AlreadyRunningTitle=\u0d85\u0dc0\u0dc0\u0dcf\u0daf\u0dba\u0dba\u0dd2
MSG_CannotWrite=An instance of the program cannot access specified user directory.\nThis is a serious problem that may prevent the program to function properly.\nMake sure {0} is writable.\n\nClick OK to continue in spite of previous error.
MSG_CannotWriteTitle=\u0d85\u0dc0\u0dc0\u0dcf\u0daf\u0dba\u0dba\u0dd2

EXC_not_a_module={0} \u0dc0\u0dbd\u0d82\u0d9c\u0dd4 NetBeans \u0d92\u0d9a\u0d9a\u0dba\u0d9a\u0dca \u0db1\u0ddc\u0dc0\u0dda.

# bootstrap manifest
OpenIDE-Module-Name=\u0d9a\u0dca\u200d\u0dbb\u0db8\u200d\u0dbd\u0dda\u0d9b\u0d9a\u0dba\u0d9a\u0dca \u0db4\u0dbb\u0dd2\u0d9c\u0dab\u0d9a\u0dba\u0d9a\u0da7 \u0db4\u0dca\u200d\u0dbb\u0dc0\u0dda\u0dc1\u0dab\u0dba \u0d9a\u0dd2\u0dbb\u0dd3\u0db8
OpenIDE-Module-Display-Category=\u0dba\u0da7\u0dd2\u0dad\u0dbd \u0dc0\u0dca\u200d\u0dba\u0dd4\u0dc4\u0dba
OpenIDE-Module-Short-Description=The core bootstrap of NetBeans-based applications.
OpenIDE-Module-Long-Description=This module provides the initial infrastructure that loads all other parts of the application. \u0d91\u0dba \u0d85\u0d9a\u0dbb\u0dca\u0db8\u0db1\u0dca\u200d\u0dba \u0d9a\u0dc5\u0db1\u0ddc\u0dc4\u0dd0\u0d9a\u0dd2\u0dba.

MSG_InstallJava6=Java 6 Standard Edition \u0da7 \u0dc0\u0da9\u0dcf \u0db4\u0dc4\u0dc5 JDK \u0d91\u0d9a \u0db8\u0dad \u0daf\u0dd2\u0dc0\u0dc0\u0dd3\u0db8 \u0d9a\u0dc5 \u0db1\u0ddc\u0dc4\u0dd0\u0d9a. \u0d9a\u0dbb\u0dd4\u0dab\u0dcf\u0d9a\u0dbb Java 6 Standard Edition \u0dc4\u0ddd \u0d8a\u0da7 \u0d89\u0dc4\u0dc5 JDK \u0d91\u0d9a\u0dca\u0d9a \u0db7\u0dcf\u0dc0\u0dd2\u0dad \u0d9a\u0dbb\u0db1\u0dca\u0db1. \u0db1\u0dd0\u0dad\u0dc4\u0ddc\u0dad\u0dca --jdkhome\n\u0dc0\u0dd2\u0d9a\u0dbd\u0dca\u0db4\u0dba \u0db7\u0dcf\u0dc0\u0dd2\u0dad \u0d9a\u0dbb \u0dc3\u0dca\u0dae\u0dcf\u0db4\u0dd2\u0dad directory \u0d91\u0d9a\u0da7 \u0dba\u0ddc\u0db8\u0db1\u0dca\u0db1.
MSG_NeedsJava6=Java 6 \u0dc4\u0ddd \u0d8a\u0da7 \u0d89\u0dc4\u0dc5 Standard Edition \u0d91\u0d9a\u0dca\u0d9a \u0d85\u0dc0\u0dc1\u0dca\u200d\u0dba\u0dba\u0dd2.

