# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.
#
# Contributor(s):
#
# Portions Copyrighted 2008 Sun Microsystems, Inc.

ERR_Project_validation=Modellvalidierung des Projektes fehlgeschlagen.

ERR_SystemScope=Eine Abh\u00e4ngigkeit auf Systemebene wurde gefunden. Die Vervollst\u00e4ndigung ist davon betroffen. 

MSG_SystemScope=Es existiert eine Systemabh\u00e4ngigkeit im Projekt, aber der Pfad zur Bin\u00e4rdatei ist ung\u00fcltig.\nBitte sicherstellen, da\u00df der Pfad absolut ist und auf eine existierende Bin\u00e4rdatei verweist.

ERR_NonLocal=Einige Abh\u00e4ngigkeitsartefakte befinden sich nicht im lokalen Repositorium.

MSG_NonLocal=Das Projekt hat Abh\u00e4ngigkeiten, die im lokalen Repositorium nicht gel\u00f6st sind. Die Vervollst\u00e4ndigung wird keine Klassen aus diesen Abh\u00e4ngigkeiten oder ihren transitiven Abh\u00e4ngigkeiten anbieten (es sei denn, sie befinden sich in einem der offenen Projekte).\nBitte die Abh\u00e4ngigkeiten herunterladen oder manuell installieren, wenn sie remote nicht verf\u00fcgbar sind.\n\nDie Artefakte sind\:\n {0}

ERR_NoParent=Auf die Datei der Wurzel-POM kann nicht zugegriffen werden. Das Projekt ist eventuell nicht korrekt eingestellt.

MSG_NoParent=Die Wurzel-POM mit der ID {0} wurde weder in den Quellen noch im lokalen Repositorium gefunden. Bitte sicherstellen, da\u00df <relativePath> vorhanden und richtig ist und die Version der Wurzel-POM ind den Quellen mit der definierten Version \u00fcbereinstimmt. \nWenn die Wurzel nur \u00fcber ein Remoterepositorium verf\u00fcgbar ist, bitte sicherstellen, da\u00df dieses Repositorium in der aktuellen POM definiert ist.

ACT_OpenPom=pom.xml \u00f6ffnen

LBL_Problems=&Probleme\:

LBL_Description=&Beschreibung\:

BTN_Correct=Korrekt

ACT_DownloadDeps=Downloadabh\u00e4ngigkeiten

ERR_MissingJ2eeModule=Unterst\u00fctzungmodul f\u00fcr J2EE f\u00fcr Maven fehlt
MSG_MissingJ2eeModule=In dieser Installation fehlt das Unterst\u00fctzungmodul f\u00fcr J2EE f\u00fcr Maven. Das bedeutet, dass s\u00e4mtliche Funktionen, die f\u00fcr die J2EE-Entwicklung relevant sind (z.B. Dateivorlagen oder Deployment), ebenfalls fehlen. Wahrscheinlich liegt es daran, da\u00df auch die allgemeine J2EE-Unterst\u00fctzung fehlt. Bitte unter Extras|Plug-Ins die f\u00fcr J2EE ben\u00f6tigten Plug-Ins installieren.

ERR_MissingApisupportModule=Das Module zur NetBeans-Unterst\u00fctzung f\u00fcr Mavenentwicklung fehlt
MSG_MissingApisupportModule=In dieser Installation fehlt das API-Unterst\u00fctzungmodul f\u00fcr Maven. Das bedeutet, dass s\u00e4mtliche Funktionen, die f\u00fcr die NetBeans-Entwicklung relevant sind (z.B. Dateivorlagen oder Plattform-Anwendungen), ebenfalls fehlen. Wahrscheinlich liegt es daran, dass ein Teil der allgemeinen API Unterst\u00fctzung ebenfalls fehlt. Bitte Extras|Plug-Ins aufrufen, um die Plug-Ins f\u00fcr die NetBeans-Entwicklung zu installieren.

ACT_validate=Neu validieren

