AnnotationPostContruct.description=@PostConstruct\u6ce8\u91c8\u306e\u4f7f\u7528\u65b9\u6cd5\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\u623b\u308a\u5024\u3001\u30af\u30e9\u30b9\u5f53\u305f\u308a\u306e\u5358\u4e00\u6027\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u306a\u3069\u3002
AnnotationPostContruct.display.name=\u6ce8\u91c8@PostConstruct
AnnotationPostContruct_thrown_checked_exceptions=@PostConstruct\u3068\u3044\u3046\u6ce8\u91c8\u304c\u4ed8\u3044\u305f\u30e1\u30bd\u30c3\u30c9\u3067\u306f\u78ba\u8a8d\u6e08\u4f8b\u5916\u3092\u30b9\u30ed\u30fc\u3067\u304d\u307e\u305b\u3093\u3002
AnnotationPostContruct_too_much_annotations=@PostConstruct\u3068\u3044\u3046\u6ce8\u91c8\u304c\u4ed8\u3044\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u8907\u6570\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
AnnotationPostContruct_wrong_parameters=@PostConstruct\u3068\u3044\u3046\u6ce8\u91c8\u304c\u4ed8\u3044\u305f\u30e1\u30bd\u30c3\u30c9\u306b\u306f\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002\u305f\u3060\u3057\u3001InvocationContext\u30b5\u30d6\u30af\u30e9\u30b9\u3092\u30d1\u30e9\u30e1\u30fc\u30bf\u3068\u3057\u3066\u4f7f\u7528\u3059\u308bEJB\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u306e\u5834\u5408\u3092\u9664\u304d\u307e\u3059\u3002
AnnotationPostContruct_wrong_return_type=@PostConstruct\u3068\u3044\u3046\u6ce8\u91c8\u304c\u4ed8\u3044\u305f\u30e1\u30bd\u30c3\u30c9\u306e\u623b\u308a\u578b\u306fvoid\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
AsynchronousMethodInvocation.description=@Asynchronous\u306e\u4f7f\u7528\u65b9\u6cd5\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304a\u3088\u3073\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u30fb\u30bf\u30a4\u30d7\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u30c6\u30b9\u30c8\u3057\u307e\u3059\u3002
AsynchronousMethodInvocation.display.name=\u975e\u540c\u671f\u30e1\u30bd\u30c3\u30c9\u306e\u547c\u51fa\u3057
AsynchronousMethodInvocation.err.asynchronous.in.ejb31=JavaEE 6 Lite\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u30bf\u30fc\u30b2\u30c3\u30c8\u3068\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u306f\u3001\u975e\u540c\u671f\u30e1\u30bd\u30c3\u30c9\u306e\u547c\u51fa\u3057\u306f\u3067\u304d\u307e\u305b\u3093
BeanHasDifferentLBIandRBI.display.name=\u30ed\u30fc\u30ab\u30eb\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3068\u30ea\u30e2\u30fc\u30c8\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306e\u4f75\u7528
BeanHasDifferentLBIandRBI.err=\u540c\u3058\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u304c\u3001Bean\u306e\u30ed\u30fc\u30ab\u30eb\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3068\u30ea\u30e2\u30fc\u30c8\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306e\u4e21\u65b9\u306b\u306a\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
BeanImplementsBI.display.name=Bean\u306f\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3057\u3066\u3044\u307e\u305b\u3093
BeanImplementsBI.err=Bean\u30af\u30e9\u30b9\u304c\u305d\u306e\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3059\u308b\u3053\u3068\u3092\u304a\u85a6\u3081\u3057\u307e\u3059
BMnotPartOfRBIandLBI.display.name=\u30ed\u30fc\u30ab\u30eb\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3068\u30ea\u30e2\u30fc\u30c8\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306e\u30e1\u30bd\u30c3\u30c9\u5b9a\u7fa9
BMnotPartOfRBIandLBI.err=\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u306b\u30ed\u30fc\u30ab\u30eb\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3068\u30ea\u30e2\u30fc\u30c8\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u304c\u3042\u308b\u5834\u5408\u306f\u3001\u4e21\u65b9\u306e\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306b\u5171\u901a\u306e\u4efb\u610f\u306e\u30e1\u30bd\u30c3\u30c9\u304c\u306a\u3044\u3088\u3046\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
BusinessMethodExposed.display.name=\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3067\u516c\u958b\u3055\u308c\u306a\u3044\u30e1\u30bd\u30c3\u30c9\u3002
BusinessMethodExposed.hint=\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3067\u30e1\u30bd\u30c3\u30c9\u304c\u516c\u958b\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
HasNoArgContructor.display.name=EJB Bean\u5185\u306e\u5f15\u6570\u306a\u3057\u306e\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf
HasNoArgContructor.err=EJB\u30af\u30e9\u30b9\u306b\u306f\u3001public\u307e\u305f\u306fprotected\u306e\u5f15\u6570\u3092\u3068\u3089\u306a\u3044\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u5fc5\u8981\u3067\u3059\u3002
LegalModifiers.BeanClassMustBePublic=EJB\u30af\u30e9\u30b9\u306fpublic\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
LegalModifiers.BeanClassNotBeAbstract=EJB\u30af\u30e9\u30b9\u306fabstract\u3067\u3042\u3063\u3066\u306f\u306a\u308a\u307e\u305b\u3093
LegalModifiers.BeanClassNotBeFinal=EJB\u30af\u30e9\u30b9\u306ffinal\u3067\u3042\u3063\u3066\u306f\u306a\u308a\u307e\u305b\u3093
LegalModifiers.desc=\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308bEJB Bean\u306b\u6b63\u3057\u3044\u4fee\u98fe\u5b50(public\u3067\u3042\u308a\u3001final\u307e\u305f\u306fabstract\u3067\u306a\u3044)\u304c\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002
LegalModifiers.display.name=EJB Bean\u5185\u306e\u4fee\u98fe\u5b50
LocalAnnotatedBeanHasLBI.display.name=\u672a\u5b8c\u306eLBI\u30bb\u30c3\u30b7\u30e7\u30f3Bean
LocalAnnotatedBeanHasLBI.err=\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u306b@Local\u306e\u6ce8\u91c8\u304c\u4ed8\u3044\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u30ed\u30fc\u30ab\u30eb\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u304c\u5fc5\u8981\u3067\u3059\u3002
PersistentTimerInEjbLite.desc=\u6301\u7d9a\u30bf\u30a4\u30de\u30fc(@Schedule\u6ce8\u91c8)\u306fEJB 3.2 Lite\u306e\u5834\u5408\u306f\u4f7f\u7528\u3067\u304d\u305a\u3001\u30bf\u30a4\u30de\u30fc\u306fEJB 3.1 Lite\u3092\u30bf\u30fc\u30b2\u30c3\u30c8\u3068\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5185\u3067\u306f\u4e00\u5207\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
PersistentTimerInEjbLite.display.name=EJB Lite\u5185\u306e\u6301\u7d9a\u30bf\u30a4\u30de\u30fc
PersistentTimerInEjbLite.err.nonpersistent.timer.in.ee7lite=JavaEE 7 Web\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u30bf\u30fc\u30b2\u30c3\u30c8\u3068\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u306f\u3001\u6301\u7d9a\u30bf\u30a4\u30de\u30fc\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
PersistentTimerInEjbLite.err.timer.in.ee6lite=JavaEE 6 Web\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u30bf\u30fc\u30b2\u30c3\u30c8\u3068\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u306f\u3001@Schedule\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
PersistentTimerInEjbLiteFix.lbl.make.timer.nonpersistent=\u30bf\u30a4\u30de\u30fc\u3092\u975e\u6301\u7d9a\u7684\u306b\u3059\u308b
RemoteAnnotatedBeanHasRBI.display.name=\u672a\u5b8c\u306eRBI\u30bb\u30c3\u30b7\u30e7\u30f3Bean
RemoteAnnotatedBeanHasRBI.err=\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u306b@Remote\u306e\u6ce8\u91c8\u304c\u4ed8\u3044\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u30ea\u30e2\u30fc\u30c8\u30fb\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u304c\u5fc5\u8981\u3067\u3059\u3002
SBSuperClassNotSB.display.name=\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u306e\u7d99\u627f
SBSuperClassNotSB.err=\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u304c\u4ed6\u306e\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u3092\u62e1\u5f35\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
SessionSynchImplementedBySFSBOnly.display.name=\u975eSFSB\u306b\u3088\u3063\u3066\u5b9f\u88c5\u3055\u308c\u305fSessionSynchronization
SessionSynchImplementedBySFSBOnly.err=SessionSynchronization\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3067\u304d\u308b\u306e\u306f\u30b9\u30c6\u30fc\u30c8\u30d5\u30eb\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3Bean (SFSB)\u306e\u307f\u3067\u3059\u3002
UseInjectionInsteadOfInstantionRule.desc=@EJB\u6ce8\u91c8\u306b\u3088\u3063\u3066\u6ce8\u5165\u53ef\u80fd\u306abean\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u3092\u691c\u7d22\u3057\u307e\u3059
UseInjectionInsteadOfInstantionRule.display.name=@EJB\u6ce8\u5165\u306b\u7f6e\u63db\u53ef\u80fd\u306a\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316
UseInjectionInsteadOfInstantionRule.error=@EJB\u6ce8\u5165\u306b\u3088\u3063\u3066bean\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u3092\u7f6e\u63db\u3067\u304d\u307e\u3059
UseInjectionInsteadOfInstantionRule.fix=@EJB\u6ce8\u5165\u306b\u3088\u308bbean\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u306e\u7f6e\u63db
ValueNotSpecifiedForRemoteAnnotationInterface.display.name=@Remote\u306f\u3001\u30d3\u30b8\u30cd\u30b9\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306e\u5024\u3092\u4f7f\u7528\u3057\u307e\u3059
ValueNotSpecifiedForRemoteAnnotationInterface.err=\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306b@Remote\u306e\u6ce8\u91c8\u304c\u4ed8\u3044\u3066\u3044\u308b\u5834\u5408\u3001\u5024\u5c5e\u6027\u3092\u6307\u5b9a\u3057\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002\u3064\u307e\u308a\u3001@Remote\u306b\u5bfe\u3057\u3066\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u5024\u306f\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3067\u306f\u306a\u304f\u30af\u30e9\u30b9\u306e\u6ce8\u91c8\u4e2d\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
WSisSLSB.display.name=Web\u30b5\u30fc\u30d3\u30b9\u306f\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u3068\u3057\u3066\u8a2d\u8a08\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
WSisSLSB.err=\u30af\u30e9\u30b9\u304cejb-jar\u306e\u4e00\u90e8\u3067\u3001@WebService\u306e\u6ce8\u91c8\u304c\u4ed8\u3044\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u30b9\u30c6\u30fc\u30c8\u30ec\u30b9\u307e\u305f\u306f\u30b7\u30f3\u30b0\u30eb\u30c8\u30f3\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3Bean\u3068\u3057\u3066\u6307\u5b9a\u3055\u308c\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

