# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

# Method to complex
DN_MethodTooComplex=\u30e1\u30bd\u30c3\u30c9\u304c\u8907\u96d1\u3059\u304e\u308b
DESC_MethodTooComplex=\u3053\u306e\u691c\u67fb\u3067\u306f\u3001<b>Cyclomatic Complexity</b>\u304c\u69cb\u6210\u53ef\u80fd\u306a\u5024\u3092\u8d85\u3048\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002<i>\u5faa\u74b0\u7684\u8907\u96d1\u5ea6</i>\u306b\u3088\u308a\u3001\u30e1\u30bd\u30c3\u30c9\u5185\u306e\u6f5c\u5728\u7684\u306a\u5206\u5c90\u70b9(\u307e\u305f\u306f\u30b5\u30a4\u30af\u30eb)\u3092\u6e2c\u5b9a\u3057\u307e\u3059\u3002\u901a\u5e38\u3001\u5faa\u74b0\u7684\u8907\u96d1\u5ea6\u304c\u9ad8\u3044\u30e1\u30bd\u30c3\u30c9\u306e\u5834\u5408\u3001\u904e\u5ea6\u306e\u51e6\u7406\u304c\u884c\u308f\u308c\u308b\u305f\u3081\u3001\u7126\u70b9\u304c\u3088\u308a\u7d5e\u3089\u308c\u305f\u8907\u6570\u306e\u30e1\u30bd\u30c3\u30c9\u306b\u5206\u5272\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u3068\u8003\u3048\u3089\u308c\u3066\u3044\u307e\u3059\u3002\u307e\u305f\u3001\u3053\u306e\u3088\u3046\u306a\u8907\u96d1\u306a\u30e1\u30bd\u30c3\u30c9\u306f\u5b9f\u884c\u30d1\u30b9\u9593\u3067\u30b3\u30fc\u30c9\u304c\u91cd\u8907\u3059\u308b\u50be\u5411\u304c\u3042\u308a\u3001\u7dad\u6301\u3059\u308b\u306e\u304c\u56f0\u96e3\u306b\u306a\u308a\u307e\u3059\u3002\u4e00\u822c\u7684\u306b\u306f\u3001\u30e1\u30bd\u30c3\u30c9\u306e\u5faa\u74b0\u7684\u8907\u96d1\u5ea6\u306f5\u4ee5\u4e0b\u306b\u3059\u308b\u3053\u3068\u3092\u304a\u85a6\u3081\u3057\u307e\u3059\u3002\u307e\u305f\u3001\u3088\u308a\u7dbf\u5bc6\u306a\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u306e\u5834\u5408\u306f\u300110\u672a\u6e80\u3067\u3042\u308c\u3070\u8a31\u5bb9\u7bc4\u56f2\u5185\u3067\u3059\u3002

# Too deep nesting
DN_MethodTooDeepNesting=\u6df1\u3059\u304e\u308b\u5165\u308c\u5b50
DESC_MethodTooDeepNesting=\u5165\u308c\u5b50\u304c<i>\u6df1\u3059\u304e\u308b</i>\u6587\u304c\u672c\u4f53\u306b\u542b\u307e\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u3053\u306e\u3088\u3046\u306a\u30e1\u30bd\u30c3\u30c9\u306f\u8aad\u307f\u306b\u304f\u304f\u3001\u30a4\u30f3\u30c7\u30f3\u30c8\u30fb\u30b9\u30da\u30fc\u30b9\u304c\u542b\u307e\u308c\u3001\u30b3\u30fc\u30c9\u3092\u8aad\u307f\u53d6\u308b\u305f\u3081\u306b\u4f7f\u7528\u53ef\u80fd\u306a\u753b\u9762\u30b9\u30da\u30fc\u30b9\u304c\u5c11\u306a\u304f\u306a\u308a\u307e\u3059\u3002\u591a\u304f\u306e\u5834\u5408\u3001\u30e1\u30bd\u30c3\u30c9\u3092\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u3057\u3066\u5206\u5272\u3059\u308b\u3053\u3068\u306b\u3088\u308a\u3001\u30b3\u30fc\u30c9\u304c\u8aad\u307f\u3084\u3059\u304f\u306a\u308a\u307e\u3059\u3002

MethodComplexityCustomizer.limtLabel.text=\u8907\u96d1\u6027\u5236\u9650:
OPTNAME_MethodComplexityLimit=\u8907\u96d1\u6027\u5236\u9650

OPTNAME_MethodDepthLimit=\u6587\u306e\u6df1\u5ea6\u5236\u9650


# Method too long - lines or statements
DN_MethodTooLong=\u30e1\u30bd\u30c3\u30c9\u672c\u4f53\u304c\u9577\u3059\u304e\u308b
DESC_MethodTooLong=\u672c\u4f53\u304c\u9577\u3059\u304e\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u30e1\u30bd\u30c3\u30c9\u304c\u9577\u304f\u306a\u308b\u3068\u3001\u524d\u5f8c\u306b\u30b9\u30af\u30ed\u30fc\u30eb\u3059\u308b\u3053\u3068\u304c\u5fc5\u8981\u306b\u306a\u308a\u307e\u3059\u3002\u901a\u5e38\u3001\u3053\u306e\u3088\u3046\u306a\u30e1\u30bd\u30c3\u30c9\u306f\u3001\u4ef2\u4ecb\u3059\u308b\u30e1\u30bd\u30c3\u30c9\u304b\u3089\u30b3\u30fc\u30eb\u3055\u308c\u308b\u8907\u6570\u306e\u30e1\u30bd\u30c3\u30c9\u306b\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u3067\u304d\u307e\u3059\u3002\u307e\u305f\u3001\u9577\u3044\u30e1\u30bd\u30c3\u30c9\u3092\u540d\u524d\u4ed8\u304d\u306e\u8907\u6570\u306e\u5404\u90e8\u306b\u5206\u5272\u3059\u308b\u3068\u3001\u30b3\u30fc\u30c9\u3092\u518d\u5229\u7528\u3057\u3084\u3059\u304f\u306a\u308a\u307e\u3059\u3002\u4e00\u90e8\u306e\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u4f5c\u696d\u3067\u306f\u3001\u958b\u767a\u8005\u304c\u3088\u308a\u7c21\u5358\u306b\u30b9\u30ad\u30e3\u30f3\u3057\u3066\u7406\u89e3\u3067\u304d\u308b\u3088\u3046\u306b\u3001\u30e1\u30bd\u30c3\u30c9\u3092\u753b\u9762\u30b5\u30a4\u30ba\u306b\u53ce\u3081\u308b\u3053\u3068\u304c\u5fc5\u8981\u306b\u306a\u308a\u307e\u3059\u3002
OPTNAME_MethodLinesLimit=\u8a31\u5bb9\u3055\u308c\u3066\u3044\u308b\u884c\u6570

OPTNAME_MethodStatementsLimit=\u8a31\u5bb9\u3055\u308c\u3066\u3044\u308b\u6587\u6570


# Method throws too many exception
DN_MethodTooManyExceptions=\u30e1\u30bd\u30c3\u30c9\u307e\u305f\u306f\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u5ba3\u8a00\u3059\u308b\u4f8b\u5916\u304c\u591a\u3059\u304e\u308b
DESC_MethodTooManyExceptions=<b>throws</b>\u53e5\u3067\u5ba3\u8a00\u3055\u308c\u308b\u4f8b\u5916\u304c\u591a\u3059\u304e\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u591a\u6570\u306e\u4f8b\u5916\u30bf\u30a4\u30d7\u304c\u751f\u6210\u3055\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u306e\u5834\u5408\u3001\u30b3\u30fc\u30eb\u5143\u304c\u3059\u3079\u3066\u306e\u7d50\u679c\u3092\u51e6\u7406\u3057\u305f\u308a\u4f8b\u5916\u3092\u4f7f\u7528\u3057\u3066\u72ec\u81ea\u306e\u5ba3\u8a00\u3092\u8907\u96d1\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u305f\u3081\u3001\u4f7f\u3044\u306b\u304f\u304f\u306a\u308a\u307e\u3059\u3002\u30a8\u30e9\u30fc\u51e6\u7406\u30b3\u30fc\u30c9\u3082\u3088\u308a\u8907\u96d1\u306b\u306a\u308a\u307e\u3059\u3002<p/>\u3053\u306e\u691c\u67fb\u3067\u306f\u3001\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u3082\u51e6\u7406\u3055\u308c\u307e\u3059\u3002
OPTNAME_MethodExceptionsLimit=\u8a31\u5bb9\u3055\u308c\u3066\u3044\u308b\u4f8b\u5916\u30ab\u30a6\u30f3\u30c8


# Method declares too may parameters
DN_MethodTooManyParameters=\u30e1\u30bd\u30c3\u30c9\u304c\u5ba3\u8a00\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u3059\u304e\u308b
DESC_MethodTooManyParameters=\u4f7f\u7528\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u3059\u304e\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u30e1\u30bd\u30c3\u30c9\u306b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u6570\u3042\u308b\u3068\u3044\u3046\u3053\u3068\u306f\u3001\u8a2d\u8a08\u304c\u60aa\u3044\u3053\u3068\u3092\u8868\u3057\u307e\u3059\u3002\u3053\u306e\u5834\u5408\u3001\u5c06\u6765\u7684\u306b\u3055\u3089\u306b\u591a\u304f\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u8ffd\u52a0\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u305f\u3081\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u30b3\u30de\u30f3\u30c9\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u30b0\u30eb\u30fc\u30d7\u5316\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u3001\u4fdd\u5b88\u30b3\u30b9\u30c8\u304c\u5897\u5927\u3057\u307e\u3059\u3002\u3042\u308b\u3044\u306f\u3001\u30e1\u30bd\u30c3\u30c9\u3092\u8907\u6570\u306e\u30e1\u30bd\u30c3\u30c9\u306b\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u3057\u3001\u5404\u30e1\u30bd\u30c3\u30c9\u306b\u30bf\u30b9\u30af\u306e\u5404\u90e8\u3092\u5206\u62c5\u3055\u305b\u308b\u3053\u3068\u306b\u3088\u308a\u3001\u5165\u529b\u6642\u306b\u5fc5\u8981\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u6e1b\u3089\u3059\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002
OPTNAME_MethodParametersLimit=\u8a31\u5bb9\u3055\u308c\u3066\u3044\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fb\u30ab\u30a6\u30f3\u30c8


DN_CtorTooManyParameters=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u5ba3\u8a00\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u3059\u304e\u308b
DESC_CtorTooManyParameters=\u4f7f\u7528\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u3059\u304e\u308b\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u4e00\u822c\u7684\u306b\u3001\u7279\u306b\u5927\u898f\u6a21\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u521d\u671f\u5316\u3059\u308b\u5834\u5408\u3001\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u306b\u306f\u901a\u5e38\u306e\u65b9\u6cd5\u3088\u308a\u591a\u304f\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002<p/>\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u306b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u6570\u3042\u308b\u3068\u3044\u3046\u3053\u3068\u306f\u3001\u8a2d\u8a08\u304c\u60aa\u3044\u3053\u3068\u3092\u8868\u3057\u307e\u3059\u3002\u3053\u306e\u5834\u5408\u3001\u5c06\u6765\u7684\u306b\u3055\u3089\u306b\u591a\u304f\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u8ffd\u52a0\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u305f\u3081\u3001\u30d3\u30eb\u30c0\u30fc\u306a\u3069\u306e\u4f5c\u6210\u30d1\u30bf\u30fc\u30f3\u3092\u691c\u8a0e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

OPTNAME_CtorParametersLimit=\u8a31\u5bb9\u3055\u308c\u3066\u3044\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fb\u30ab\u30a6\u30f3\u30c8


# Method with mulitple return statements
DN_MethodMultipleReturns=\u8907\u6570\u306ereturn\u30dd\u30a4\u30f3\u30c8\u306e\u3042\u308b\u30e1\u30bd\u30c3\u30c9
DESC_MethodMultipleReturns=<b>return</b>\u6587\u3092\u4f7f\u7528\u3057\u3066\u8907\u6570\u306e\u5834\u6240\u3067\u7d42\u4e86\u3059\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u3053\u306e\u3088\u3046\u306a\u30e1\u30bd\u30c3\u30c9\u306f\u6df7\u4e71\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u3001\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u304c\u56f0\u96e3\u306b\u306a\u308a\u307e\u3059\u3002\u3053\u306e\u691c\u67fb\u3067\u306f\u3001<b>if</b>\u5206\u5c90\u5185\u306e\u552f\u4e00\u306e\u6587\u3067\u3042\u308b\u6761\u4ef6\u4ed8\u304d<b>guard returns</b> (<b>return</b>\u6587)\u3092\u7121\u8996\u3067\u304d\u307e\u3059\u3002\u5f93\u6765\u3001<b>equals</b>\u30e1\u30bd\u30c3\u30c9\u306e\u5185\u5bb9\u306f\u578b\u307e\u305f\u306f\u5024\u306e\u4e0d\u4e00\u81f4\u304c\u3042\u3063\u305f\u5834\u5408\u306b\u65e9\u671freturn\u3092\u4f7f\u7528\u3057\u3066\u751f\u6210\u3055\u308c\u308b\u305f\u3081\u3001\u5fc5\u8981\u306b\u5fdc\u3058\u3066<b>equals</b>\u306f\u3059\u3079\u3066\u7121\u8996\u3067\u304d\u307e\u3059\u3002
OPTNAME_MethodIgnoreReturnEquals='equals'\u3067\u7121\u8996

OPTNAME_MethodIgnoreReturnGuards=\u30ac\u30fc\u30c9\u6761\u4ef6\u3092\u7121\u8996

OPTNAME_MethodReturnLimit=\u7d50\u679c\u5236\u9650


# Method with multiple negations
DN_MethodMultipleNegations=\u8907\u6570\u306e\u5426\u5b9a\u306e\u3042\u308b\u30e1\u30bd\u30c3\u30c9
DESC_MethodMultipleNegations=\u8907\u6570\u306e\u5426\u5b9a\u5f0f(\u5358\u9805\u306e<b>!</b>\u307e\u305f\u306f<b>!=</b>)\u306e\u3042\u308b\u30e1\u30bd\u30c3\u30c9\u306f\u30ea\u30fc\u30c0\u30fc\u3092\u6df7\u4e71\u3055\u305b\u308b\u3068\u8a00\u308f\u308c\u3066\u304a\u308a\u3001true (\u975e\u5426\u5b9a\u578b)\u5f0f\u306e\u65b9\u304c\u8aad\u307f\u3084\u3059\u304f\u7406\u89e3\u3057\u3084\u3059\u3044\u3068\u898b\u306a\u3055\u308c\u3066\u3044\u307e\u3059\u3002false\u5024\u306e\u304b\u308f\u308a\u306btrue\u5024\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u30ed\u30b8\u30c3\u30af\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
OPTNAME_MethodNegationsLimit=\u5426\u5b9a\u5236\u9650

OPTNAME_MethodNegationsIgnoreEquals=equals()\u3067\u7121\u8996

OPTNAME_MethodNegationsIgnoreAsserts=\u8868\u660e\u3067\u7121\u8996


# Method with multiple loops
DN_MethodMultipleLoops=\u8907\u6570\u306e\u30eb\u30fc\u30d7\u306e\u3042\u308b\u30e1\u30bd\u30c3\u30c9
DESC_MethodMultipleLoops=\u8907\u6570\u306e\u30eb\u30fc\u30d7\u6587\u304c\u542b\u307e\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u3002

OPTNAME_MethodLoopsLimit=\u6700\u5927\u30eb\u30fc\u30d7\u6570
OPTDESC_MethodLoopsLimit

DN_MethodCoupled=\u7d50\u5408\u304c\u591a\u3059\u304e\u308b\u30e1\u30bd\u30c3\u30c9
DESC_MethodCoupled=\u7d50\u5408\u304c\u591a\u3059\u304e\u308b(\u53c2\u7167\u5148\u306e\u4ed6\u306e\u578b\u304c\u591a\u3059\u304e\u308b)\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u591a\u6570\u306e\u578b\u3092\u53c2\u7167\u30e1\u30bd\u30c3\u30c9\u306f<i>\u8106\u5f31</i>\u3067\u3059\u3002\u3053\u308c\u3089\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u3001\u53c2\u7167\u5148\u306e\u578b\u304c\u5909\u66f4\u3055\u308c\u305f\u3068\u304d\u306b\u5931\u6557\u3057\u305f\u308a\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u304c\u5fc5\u8981\u306b\u306a\u308b\u50be\u5411\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u4ed6\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u5bfe\u3059\u308b\u4f9d\u5b58\u304c\u591a\u3059\u304e\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u79fb\u52d5\u3059\u308b\u3053\u3068\u3082\u3088\u308a\u56f0\u96e3\u306b\u306a\u308a\u307e\u3059\u3002<p/>\u30e1\u30bd\u30c3\u30c9\u306e\u30af\u30e9\u30b9\u81ea\u4f53\u304a\u3088\u3073\u305d\u306e\u30b9\u30fc\u30d1\u30fc\u30fb\u30af\u30e9\u30b9\u306b\u5bfe\u3059\u308b\u53c2\u7167\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002<i>\u300cJava\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3067\u4f9d\u5b58\u6027\u3092\u7121\u8996\u300d</i>\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001<code>java.**</code>\u304a\u3088\u3073<code>javax.**</code>\u30af\u30e9\u30b9\u306b\u5bfe\u3059\u308b\u53c2\u7167\u3082\u7121\u8996\u3055\u308c\u307e\u3059\u3002


# Method with many dependencies
OPTNAME_MethodCouplingIgnoreJava=Java\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3067\u4f9d\u5b58\u6027\u3092\u7121\u8996
OPTDESC_MethodCouplingIgnoreJava=\u542b\u307e\u308c\u308b\u30eb\u30fc\u30d7\u6587\u304c\u591a\u3059\u304e\u308b\u30e1\u30bd\u30c3\u30c9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
OPTNAME_MethodCouplingLimit=\u6700\u5927\u7d50\u5408


DN_ClassTooComplex=\u30af\u30e9\u30b9\u304c\u8907\u96d1\u3059\u304e\u308b
DESC_ClassTooComplex=\u5faa\u74b0\u7684\u8907\u96d1\u5ea6\u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u5236\u9650\u3092\u8d85\u3048\u308b\u30af\u30e9\u30b9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u30af\u30e9\u30b9\u306e\u8907\u96d1\u5ea6\u306f\u3001\u30e1\u30bd\u30c3\u30c9\u306e\u8907\u96d1\u5ea6\u306e\u5408\u8a08\u3068\u3057\u3066\u8a08\u7b97\u3055\u308c\u307e\u3059\u3002
OPTNAME_ClassComplexityLimit=\u8907\u96d1\u6027\u5236\u9650


DN_ClassAnonymousTooComplex=\u533f\u540d\u30af\u30e9\u30b9\u304c\u8907\u96d1\u3059\u304e\u308b
DESC_ClassAnonymousTooComplex=\u5faa\u74b0\u7684\u8907\u96d1\u5ea6\u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u5236\u9650\u3092\u8d85\u3048\u308b\u533f\u540d\u30af\u30e9\u30b9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u30af\u30e9\u30b9\u306e\u8907\u96d1\u5ea6\u306f\u3001\u30e1\u30bd\u30c3\u30c9\u306e\u8907\u96d1\u5ea6\u306e\u5408\u8a08\u3068\u3057\u3066\u8a08\u7b97\u3055\u308c\u307e\u3059\u3002\u533f\u540d\u30af\u30e9\u30b9\u306f\u3001\u6b63\u898f\u30af\u30e9\u30b9\u3088\u308a\u8077\u8cac\u3092\u6e1b\u3089\u3057\u3001\u8907\u96d1\u5ea6\u3092\u4e0b\u3052\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
OPTNAME_ClassAnonymousComplexityLimit=\u8907\u96d1\u6027\u5236\u9650


DN_ClassTooCoupled=\u30af\u30e9\u30b9\u306e\u7d50\u5408\u304c\u591a\u3059\u304e\u308b
DESC_ClassTooCoupled=\u4ed6\u306e\u578b\u306e\u7d50\u5408(\u4f7f\u7528\u3059\u308b\u4ed6\u306e\u578b)\u304c\u591a\u3059\u304e\u308b\u30af\u30e9\u30b9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002Java\u30b7\u30b9\u30c6\u30e0\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea(<code>java.**</code>\u304a\u3088\u3073<code>javax.**</code>)\u3078\u306e\u53c2\u7167\u306f\u7121\u8996\u3067\u304d\u307e\u3059\u3002
OPTNAME_ClassCouplingLimit=\u7d50\u5408\u5236\u9650

OPTNAME_ClassCouplingIgnoreJava=Java\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3067\u4f9d\u5b58\u6027\u3092\u7121\u8996


DN_ComplexArithmeticExpression=\u7b97\u8853\u5f0f\u304c\u8907\u96d1\u3059\u304e\u308b
DESC_ComplexArithmeticExpression=\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u64cd\u4f5c\u3088\u308a\u591a\u304f\u306e\u64cd\u4f5c\u304c\u542b\u307e\u308c\u308b\u7b97\u8853\u5f0f\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u591a\u304f\u306e\u64cd\u4f5c\u304c\u542b\u307e\u308c\u308b\u5f0f\u306f\u8aad\u307f\u306b\u304f\u304f\u306a\u308a\u307e\u3059\u3002\u3053\u306e\u3088\u3046\u306a\u5f0f\u306f\u3001\u591a\u304f\u306e\u5834\u5408\u3001\u4e2d\u9593\u7d50\u679c\u5909\u6570\u306b\u5bfe\u3059\u308b\u8907\u6570\u306e\u5272\u5f53\u3066\u6587\u306b\u5206\u5272\u3067\u304d\u307e\u3059\u3002
OPTNAME_ComplexArithmeticLimit=\u30aa\u30da\u30ec\u30fc\u30bf\u5236\u9650


DN_ComplexLogicalExpression=\u8ad6\u7406\u5f0f\u304c\u8907\u96d1\u3059\u304e\u308b
DESC_ComplexLogicalExpression=\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u64cd\u4f5c\u3088\u308a\u591a\u304f\u306e\u64cd\u4f5c\u304c\u542b\u307e\u308c\u308b\u8ad6\u7406\u5f0f\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u591a\u304f\u306e\u64cd\u4f5c\u304c\u542b\u307e\u308c\u308b\u5f0f\u306f\u8aad\u307f\u306b\u304f\u304f\u306a\u308a\u307e\u3059\u3002\u3053\u306e\u3088\u3046\u306a\u5f0f\u306f\u3001\u591a\u304f\u306e\u5834\u5408\u3001\u4e2d\u9593\u7d50\u679c\u5909\u6570\u306b\u5bfe\u3059\u308b\u8907\u6570\u306e\u5272\u5f53\u3066\u6587\u306b\u5206\u5272\u3067\u304d\u307e\u3059\u3002
OPTNAME_ComplexLogicalLimit=\u30aa\u30da\u30ec\u30fc\u30bf\u5236\u9650


DN_ClassConstructorCount=\u30af\u30e9\u30b9\u306b\u542b\u307e\u308c\u308b\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u591a\u3059\u304e\u308b
DESC_ClassConstructorCount=\u5b9a\u7fa9\u3059\u308b\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u591a\u3059\u304e\u308b\u30af\u30e9\u30b9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002

DN_AnonClassMethodCount=\u533f\u540d\u30af\u30e9\u30b9\u306b\u542b\u307e\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u304c\u591a\u3059\u304e\u308b
DESC_AnonClassMethodCount=\u591a\u304f\u306e\u30e1\u30bd\u30c3\u30c9\u304c\u542b\u307e\u308c\u308b\u533f\u540d\u30af\u30e9\u30b9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u901a\u5e38\u3001\u533f\u540d\u30af\u30e9\u30b9\u306f\u975e\u5e38\u306b\u7c21\u5358\u306a\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3059\u308b\u305f\u3081\u3001\u7c21\u5358\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u533f\u540d\u30af\u30e9\u30b9\u306e\u8907\u96d1\u5ea6\u304c\u4e0a\u304c\u308b\u5834\u5408\u3001\u5c11\u306a\u304f\u3068\u3082\u540d\u524d\u4ed8\u304d\u30ed\u30fc\u30ab\u30eb\u30fb\u30af\u30e9\u30b9\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u3092\u304a\u85a6\u3081\u3057\u307e\u3059\u3002

DN_ClassMethodCount=\u30af\u30e9\u30b9\u306b\u542b\u307e\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u304c\u591a\u3059\u304e\u308b
DESC_ClassMethodCount=\u542b\u307e\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u304c\u591a\u3059\u304e\u308b\u30af\u30e9\u30b9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u7c21\u5358\u306aBean\u30d7\u30ed\u30d1\u30c6\u30a3\u30fb\u30a2\u30af\u30bb\u30b5\u3092\u7121\u8996\u3067\u304d\u307e\u3059(\u5909\u66f4\u30a4\u30d9\u30f3\u30c8\u3092\u30c8\u30ea\u30ac\u30fc\u3059\u308b\u9045\u5ef6\u53d6\u5f97\u30e1\u30bd\u30c3\u30c9\u304a\u3088\u3073\u8a2d\u5b9a\u30e1\u30bd\u30c3\u30c9\u306f\u7c21\u5358\u3060\u3068\u306f\u898b\u306a\u3055\u308c\u307e\u305b\u3093)\u3002\u307e\u305f\u3001\u30b9\u30fc\u30d1\u30fc\u30fb\u30af\u30e9\u30b9\u306e\u62bd\u8c61\u30e1\u30bd\u30c3\u30c9\u306e\u5b9f\u88c5(\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u30fb\u30e1\u30bd\u30c3\u30c9\u306e\u5b9f\u88c5\u3067\u306f\u3042\u308a\u307e\u305b\u3093)\u3082\u7121\u8996\u3067\u304d\u307e\u3059\u3002

OPTNAME_AnonClassMethodsLimit=\u30e1\u30bd\u30c3\u30c9\u5236\u9650


OPTNAME_ClassConstructorsLimit=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u5236\u9650

OPTNAME_ClassMethodsLimit=\u30e1\u30bd\u30c3\u30c9\u5236\u9650

OPTNAME_ClassFieldsLimit=\u30d5\u30a3\u30fc\u30eb\u30c9\u5236\u9650

OPTNAME_ClassMethodCountIgnoreAccessors=\u7c21\u5358\u306a\u30a2\u30af\u30bb\u30b5\u3092\u7121\u8996
OPTDESC_ClassMethodCountIgnoreAccessors=\u7c21\u5358\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fb\u30a2\u30af\u30bb\u30b5\u306f\u542b\u307e\u308c\u307e\u305b\u3093
OPTNAME_ClassMethodCountIgnoreAbstract=\u62bd\u8c61\u30e1\u30bd\u30c3\u30c9\u5b9f\u88c5\u3092\u7121\u8996


DN_ClassFieldCount=\u30af\u30e9\u30b9\u306b\u542b\u307e\u308c\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u591a\u3059\u304e\u308b
DESC_ClassFieldCount=\u542b\u307e\u308c\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u591a\u3059\u304e\u308b\u30af\u30e9\u30b9\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u3053\u306e\u30af\u30e9\u30b9\u306b\u3088\u3063\u3066\u4fdd\u6301\u3055\u308c\u308b\u72b6\u614b\u304c\u5927\u304d\u3059\u304e\u308b\u305f\u3081\u306b\u8abf\u67fb\u304c\u5fc5\u8981\u306a\u306e\u306f\u3001\u72b6\u614b\u3092\u8907\u6570\u306e\u72b6\u614b\u30af\u30e9\u30b9\u306b\u5206\u5272\u3067\u304d\u308b\u5834\u5408\u3067\u3059\u3002\u3053\u306e\u5834\u5408\u3001\u64cd\u4f5c\u30e1\u30bd\u30c3\u30c9\u3082\u5206\u5272\u3057\u3001\u30af\u30e9\u30b9\u5168\u4f53\u306e\u8907\u96d1\u5ea6\u3082\u4e0b\u3052\u307e\u3059\u3002
OPTNAME_FieldCountIgnoreConstants=\u5b9a\u6570\u3092\u7121\u8996

# {0} - method count
TEXT_AnonClassManyMethods=\u533f\u540d\u30af\u30e9\u30b9\u306b\u542b\u307e\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u304c\u591a\u3059\u304e\u307e\u3059: {0}
# {0} - number of operands
TEXT_ArithmeticTooComplex=\u7b97\u8853\u5f0f\u304c\u8907\u96d1\u3059\u304e\u307e\u3059: {0}\u500b\u306e\u64cd\u4f5c
# {0} - complexity
TEXT_ClassAnonymousTooComplex=\u533f\u540d\u30af\u30e9\u30b9\u304c\u8907\u96d1\u3059\u304e\u307e\u3059\u3002\u5faa\u74b0\u7684\u8907\u96d1\u5ea6 = {0}
# {0} - class name
# {1} - constructor count
TEXT_ClassManyConstructors=\u30af\u30e9\u30b9{0}\u306b\u542b\u307e\u308c\u308b\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u591a\u3059\u304e\u307e\u3059: {1}
# {0} - class name
# {1} - field count
TEXT_ClassManyFields=\u30af\u30e9\u30b9{0}\u306b\u542b\u307e\u308c\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u591a\u3059\u304e\u307e\u3059: {1}
# {0} - class name
# {1} - method count
TEXT_ClassManyMethods=\u30af\u30e9\u30b9{0}\u306b\u542b\u307e\u308c\u308b\u30e1\u30bd\u30c3\u30c9\u304c\u591a\u3059\u304e\u307e\u3059: {1}
# {0} - class name
# {1} - complexity
TEXT_ClassTooComplex=\u30af\u30e9\u30b9{0}\u304c\u8907\u96d1\u3059\u304e\u307e\u3059\u3002\u5faa\u74b0\u7684\u8907\u96d1\u5ea6 = {1}
# {0} - class name
# {1} - number of referencies
TEXT_ClassTooCoupled=\u30af\u30e9\u30b9{0}\u306e\u7d50\u5408\u304c\u5f37\u3059\u304e\u307e\u3059\u3002{1}\u500b\u306e\u4ed6\u306e\u30bf\u30a4\u30d7\u3092\u53c2\u7167\u3057\u307e\u3059
# {0} - number of loops
TEXT_ConstructorMultipleLoops=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u306b{0}\u500b\u306e\u30eb\u30fc\u30d7\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
# {0} - number of negations
TEXT_ConstructorMultipleNegations=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u306b\u542b\u307e\u308c\u308b\u5426\u5b9a\u304c\u591a\u3059\u304e\u307e\u3059: {0}
# {0} - number of return points
TEXT_ConstructorMultipleReturns=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u306b\u8907\u6570\u306ereturn\u30dd\u30a4\u30f3\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059: {0}
# {0} - cyclomatic complexity of the method
TEXT_ConstructorTooComplex=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u8907\u96d1\u3059\u304e\u307e\u3059\u3002\u5faa\u74b0\u7684\u8907\u96d1\u5ea6: {0}
# {0 - number of dependencies
TEXT_ConstructorTooCoupled=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u306e\u7d50\u5408\u304c\u5f37\u3059\u304e\u307e\u3059\u3002{0}\u500b\u306e\u30bf\u30a4\u30d7\u3092\u53c2\u7167\u3057\u307e\u3059
# {0} - maximum depth of statements in method
TEXT_ConstructorTooDeepNesting=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u306b\u542b\u307e\u308c\u308b\u6587\u69cb\u9020\u304c\u6df1\u3059\u304e\u307e\u3059: {0}
# {0} - number of lines in method
TEXT_ConstructorTooLongLines=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u9577\u3059\u304e\u307e\u3059: {0}\u884c
# {0} - number of lines in method
TEXT_ConstructorTooLongStatements=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u304c\u9577\u3059\u304e\u307e\u3059: {0}\u6587
# {0} - number of exceptions declared by the method
TEXT_ConstructorTooManyExceptions=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u3067\u5ba3\u8a00\u3055\u308c\u308b\u4f8b\u5916\u304c\u591a\u3059\u304e\u307e\u3059: {0}
# {0} - number of parameters declared by the method
TEXT_ConstructorTooManyParameters=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u3067\u4f7f\u7528\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u3059\u304e\u307e\u3059: {0}
# {0} - number of operands
TEXT_LogicalTooComplex=\u8ad6\u7406\u5f0f\u304c\u8907\u96d1\u3059\u304e\u307e\u3059: {0}\u500b\u306e\u64cd\u4f5c
# {0} - method name
# {1} - number of loops
TEXT_MethodMultipleLoops=\u30e1\u30bd\u30c3\u30c9''{0}''\u306b{1}\u500b\u306e\u30eb\u30fc\u30d7\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059
# {0} - method name
# {1} - number of negations
TEXT_MethodMultipleNegations=\u30e1\u30bd\u30c3\u30c9''{0}''\u306b\u542b\u307e\u308c\u308b\u5426\u5b9a\u304c\u591a\u3059\u304e\u307e\u3059: {1}
# {0} - method name
# {1} - number of return points
TEXT_MethodMultipleReturns=\u30e1\u30bd\u30c3\u30c9''{0}''\u306b\u8907\u6570\u306ereturn\u30dd\u30a4\u30f3\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059: {1}
# {0} - method name
# {1} - cyclomatic complexity of the method
TEXT_MethodTooComplex=\u30e1\u30bd\u30c3\u30c9''{0}''\u304c\u8907\u96d1\u3059\u304e\u307e\u3059\u3002\u5faa\u74b0\u7684\u8907\u96d1\u5ea6: {1}
# {0} - method name
# {1} - number of dependencies
TEXT_MethodTooCoupled=\u30e1\u30bd\u30c3\u30c9''{0}''\u306e\u7d50\u5408\u304c\u5f37\u3059\u304e\u307e\u3059\u3002{1}\u500b\u306e\u30bf\u30a4\u30d7\u3092\u53c2\u7167\u3057\u307e\u3059
# {0} - method name
# {1} - maximum depth of statements in method
TEXT_MethodTooDeepNesting=\u30e1\u30bd\u30c3\u30c9''{0}''\u306b\u542b\u307e\u308c\u308b\u6587\u69cb\u9020\u304c\u6df1\u3059\u304e\u307e\u3059: {1}
# {0} - method name
# {1} - number of lines in method
TEXT_MethodTooLongLines=\u30e1\u30bd\u30c3\u30c9''{0}''\u304c\u9577\u3059\u304e\u307e\u3059: {1}\u884c
# {0} - method name
# {1} - number of lines in method
TEXT_MethodTooLongStatements=\u30e1\u30bd\u30c3\u30c9''{0}''\u304c\u9577\u3059\u304e\u307e\u3059: {1}\u6587
# {0} - method name
# {1} - number of exceptions declared by the method
TEXT_MethodTooManyExceptions=\u30e1\u30bd\u30c3\u30c9''{0}''\u3067\u5ba3\u8a00\u3055\u308c\u308b\u4f8b\u5916\u304c\u591a\u3059\u304e\u307e\u3059: {1}
# {0} - method name
# {1} - number of parameters declared by the method
TEXT_MethodTooManyParameters=\u30e1\u30bd\u30c3\u30c9''{0}''\u3067\u4f7f\u7528\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u591a\u3059\u304e\u307e\u3059: {1}

