# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

HeapDumpWatch_OOME_PROTECTION_OPEN_HEAPDUMP=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u4e0b\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30af\u30e9\u30c3\u30b7\u30e5\u3057\u3001\u30d2\u30fc\u30d7\u30fb\u30c0\u30f3\u30d7\u304c\u751f\u6210\u3055\u308c\u307e\u3057\u305f\u3002\n\u30d2\u30fc\u30d7\u30a6\u30a9\u30fc\u30ab\u3067\u958b\u304d\u307e\u3059\u304b?
HeapDumpWatch_OOME_PROTECTION_REMOVE_HEAPDUMP=\u751f\u6210\u3055\u308c\u305f\u30d2\u30fc\u30d7\u30fb\u30c0\u30f3\u30d7\u3092\u958b\u304b\u306a\u3044\u3053\u3068\u3092\u9078\u629e\u3057\u307e\u3057\u305f\u3002\n\u30d2\u30fc\u30d7\u30fb\u30c0\u30f3\u30d7\u306f\u591a\u304f\u306e\u30c7\u30a3\u30b9\u30af\u5bb9\u91cf\u3092\u5360\u6709\u3059\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002\n\u524a\u9664\u3057\u307e\u3059\u304b?
LoadedSnapshot_CannotReadSettingsDataMsg=\u8a2d\u5b9a\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093
LoadedSnapshot_CannotReadSnapshotDataMsg=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093
LoadedSnapshot_IllegalSnapshotDataMsg=\u7121\u52b9\u306a\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30c7\u30fc\u30bf
LoadedSnapshot_InvalidSnapshotFileMsg=NetBeans\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e\u6709\u52b9\u306a\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u3067\u306f\u3042\u308a\u307e\u305b\u3093
LoadedSnapshot_OutOfMemoryLoadingMsg=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u30ed\u30fc\u30c9\u306b\u5fc5\u8981\u306a\u91cf\u306e\u30e1\u30e2\u30ea\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002\n\n\u3053\u306e\u30a8\u30e9\u30fc\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001NetBeans IDE\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u3042\u308b\netc/netbeans.conf\u30d5\u30a1\u30a4\u30eb\u5185\u306e -Xmx\u5024\u3092\u5927\u304d\u304f\u3057\u3001IDE\u3092\u518d\u8d77\u52d5\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LoadedSnapshot_SnapshotDataCorruptedMsg=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30c7\u30fc\u30bf\u304c\u58ca\u308c\u3066\u3044\u307e\u3059
LoadedSnapshot_SnapshotFileCorrupted=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u58ca\u308c\u3066\u3044\u307e\u3059
LoadedSnapshot_SnapshotFileCorruptedReason=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u58ca\u308c\u3066\u3044\u307e\u3059: {0}
LoadedSnapshot_SnapshotFileShortMsg=\u30d5\u30a1\u30a4\u30eb\u304c\u5c0f\u3055\u3059\u304e\u307e\u3059
LoadedSnapshot_UnrecognizedSnapshotTypeMsg=\u8a8d\u8b58\u3067\u304d\u306a\u3044\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30bf\u30a4\u30d7\u3067\u3059
LoadedSnapshot_UnsupportedSnapshotVersionMsg=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d5\u30a1\u30a4\u30eb\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u3059
LoadedSnapshot_WrongSnapshotTypeMsg=\u4e0d\u6b63\u306a\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30bf\u30a4\u30d7\u3067\u3059
MSG_NotNPSSSnapshot=NPSS\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
MSG_SavingSnapshot=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u4fdd\u5b58\u3057\u3066\u3044\u307e\u3059
MSG_SavingSnapshots=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u4fdd\u5b58\u3057\u3066\u3044\u307e\u3059
MSG_StartingProfilerClient=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fb\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3092\u8d77\u52d5\u4e2d
MSG_UnsupportedSnapshotVersion=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u3059\u3002
NetBeansProfiler_AgentFailed=\u30d7\u30ed\u30bb\u30b9\u304c\u307e\u3060\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NetBeansProfiler_CancelBtn=\u53d6\u6d88\u3057(&C)
NetBeansProfiler_CannotFindLibsMsg=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306elibs\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
NetBeansProfiler_DirectoryDoesNotExistMessage=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
NetBeansProfiler_DirectoryIsWriteProtectedMessage=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u66f8\u8fbc\u307f\u7981\u6b62\u3067\u3059\u3002\n\u66f8\u8fbc\u307f\u8a31\u53ef\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NetBeansProfiler_EngineInitFailedMsg=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fb\u30a8\u30f3\u30b8\u30f3\u306e\u521d\u671f\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
NetBeansProfiler_EntireApplicationProfilingWarning=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5168\u4f53\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\u3067\u306f\u3001\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u65b0\u3057\u3044\u30b9\u30ec\u30c3\u30c9\u306e\u5b9f\u884c\u3092\u958b\u59cb\u3059\n\u308b\u307e\u3067\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30c7\u30fc\u30bf\u306e\u53ce\u96c6\u306f\u958b\u59cb\u3055\u308c\u307e\u305b\u3093\u3002\n\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30c7\u30fc\u30bf\u306e\u53ce\u96c6\u306f\u65b0\u3057\u3044\u30b9\u30ec\u30c3\u30c9\u306b\u5bfe\u3057\n\u3066\u306e\u307f\u884c\u308f\u308c\u307e\u3059\u3002\n\n\u3059\u3067\u306b\u5b9f\u884c\u4e2d\u306e\u30b9\u30ec\u30c3\u30c9\u3092\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u3059\u308b\u306b\u306f\u3001\n\u300c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4e00\u90e8\u300d\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9\n\u306b\u5207\u66ff\u3048\u308b\u3053\u3068\u3092\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NetBeansProfiler_ErrorLoadingProfilingSettingsMessage=\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u8a2d\u5b9a\u306e\u30ed\u30fc\u30c9\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
NetBeansProfiler_ErrorSavingAttachSettingsMessage=\u30a2\u30bf\u30c3\u30c1\u8a2d\u5b9a\u306e\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
NetBeansProfiler_ErrorSavingFilterSetsMessage=\u5b9a\u7fa9\u6e08\u30d5\u30a3\u30eb\u30bf\u30fb\u30bb\u30c3\u30c8\u306e\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
NetBeansProfiler_ErrorSavingGlobalSettingsMessage=\u30b0\u30ed\u30fc\u30d0\u30eb\u8a2d\u5b9a\u306e\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
NetBeansProfiler_ErrorSavingProfilingSettingsMessage=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30d5\u30a3\u30eb\u30bf\u306e\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
NetBeansProfiler_InitialCalibrationMsg=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u304c\u3001\u30de\u30b7\u30f3\u3068\u30bf\u30fc\u30b2\u30c3\u30c8JVM\u306e\u521d\u671f\u8abf\u6574\u3092\u884c\u3044\u307e\u3059\u3002\n\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u3067\u6b63\u78ba\u306a\u30bf\u30a4\u30df\u30f3\u30b0\u7d50\u679c\u3092\u5f97\u3089\u308c\u308b\u3088\u3046\u306b\u3059\u308b\u306b\u306f\u3001\n\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u3092\u521d\u3081\u3066\u5b9f\u884c\u3059\u308b\u3068\u304d\u306b\u3001\u3053\u306e\u8abf\u6574\u3092\u884c\u3046\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u6b63\u78ba\u306a\u8abf\u6574\n\u30c7\u30fc\u30bf\u3092\u5f97\u3089\u308c\u308b\u3088\u3046\u306b\u3059\u308b\u306b\u306f\u3001\u4ed6\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u3063\u3066\u3001\u4f7f\u7528\u3057\u3066\u3044\u308b\n\u30de\u30b7\u30f3\u306b\u8457\u3057\u3044\u8ca0\u8377\u304c\u304b\u304b\u3089\u306a\u3044\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u300c\u30c4\u30fc\u30eb\u300d\u2192\u300c\u30aa\u30d7\u30b7\u30e7\u30f3\u300d\u2192\u300cJava\u300d\u2192\u300c\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u300d\u2192\u300c\u4e00\u822c\u300d\u2192\u300c\u8abf\u6574\u30c7\u30fc\u30bf\u306e\u7ba1\u7406\u300d\u3092\n\u4f7f\u7528\u3059\u308b\u3068\u3001\u3053\u306e\u8abf\u6574\u3092\u518d\u5ea6\u5b9f\u884c\u3067\u304d\u307e\u3059\n\n\u8b66\u544a: \u4f7f\u7528\u3057\u3066\u3044\u308b\u30b3\u30f3\u30d4\u30e5\u30fc\u30bf\u306b\u52d5\u7684\u306aCPU\u5468\u6ce2\u6570\u5207\u66ff\u3048\u6a5f\u80fd\u304c\u3042\u308b\u5834\u5408\u3001\n\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u4e2d\u306f\u305d\u306e\u6a5f\u80fd\u3092\u7121\u52b9\u306b\u3057\u3001\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
NetBeansProfiler_MemorySamplingJava5=<html><b>\u30e1\u30e2\u30ea\u30fc\u30fb\u30b5\u30f3\u30d7\u30ea\u30f3\u30b0\u306fJava 5\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002</b><br><br>Java 6+\u3092\u4f7f\u7528\u3057\u3066\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5bfe\u8c61\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u304b\u3001\u30e1\u30e2\u30ea\u30fc\u8a08\u6e2c\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
NetBeansProfiler_ModifyingInstrumentationMsg=\u8a08\u6e2c\u3092\u5909\u66f4\u3057\u3066\u3044\u307e\u3059...
NetBeansProfiler_MustCalibrateFirstMsg=\u8abf\u6574\u30c7\u30fc\u30bf\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u304b\u3001\u58ca\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u3092\u4e2d\u6b62\u3057\u307e\u3059\u3002\n\n\u3053\u306e\u30de\u30b7\u30f3\u3067\u521d\u3081\u3066\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u307e\u305f\u306f\u30bf\u30fc\u30b2\u30c3\u30c8JVM\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\n\u30bf\u30fc\u30b2\u30c3\u30c8JVM\u306e\u8abf\u6574\u3092\u5148\u306b\u5b9f\u884c\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u53d6\u5f97\u3057\u305f\u8abf\u6574\u30c7\u30fc\u30bf\u306f\u4fdd\u5b58\u3055\u308c\u3066\u3001\u4ee5\u964d\u306e\u5b9f\u884c\u3067\u518d\u5229\u7528\u3055\u308c\u308b\u305f\u3081\u3001\n\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u518d\u3073\u8868\u793a\u3055\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002\n\n\u8abf\u6574\u3092\u884c\u3046\u306b\u306f\u3001\n\u300c\u30c4\u30fc\u30eb\u300d\u2192\u300c\u30aa\u30d7\u30b7\u30e7\u30f3\u300d\u2192\u300cJava\u300d\u2192\u300c\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u300d\u2192\u300c\u4e00\u822c\u300d\u2192\u300c\u8abf\u6574\u30c7\u30fc\u30bf\u306e\u7ba1\u7406\u300d\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\n\n
NetBeansProfiler_MustCalibrateFirstShortMsg=<html><b>\u8abf\u6574\u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3002</b><br><br>\u3053\u306eJDK\u3067\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3002\u5148\u306b\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e<br>\u8abf\u6574\u3092\u884c\u306a\u3063\u3066\u304b\u3089\u3075\u305f\u305f\u3073\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u958b\u59cb\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
NetBeansProfiler_ProgressDialogCaption=\u9032\u6357\u72b6\u6cc1 ...
NetBeansProfiler_StartingSession=\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u958b\u59cb\u4e2d...
NetBeansProfiler_TakeSnapshotOnExitDialogTitle=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u7d42\u4e86
NetBeansProfiler_TakeSnapshotOnExitMsg=<b>\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u4e0b\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5b9f\u884c\u304c\u7d42\u4e86\u3057\u307e\u3057\u305f\u3002</b>\n\u53ce\u96c6\u7d50\u679c\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u53d6\u5f97\u3057\u307e\u3059\u304b?
NetBeansProfiler_TargetAppNotRespondingDialogTitle=\u8cea\u554f
NetBeansProfiler_TargetAppNotRespondingMsg=\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u4e0b\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u5fdc\u7b54\u304c\u3042\u308a\u307e\u305b\u3093\u3002\n\u63a5\u7d9a\u3092\u9589\u3058\u3066\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u3092\u4e2d\u6b62\u3057\u307e\u3059\u304b?
NetBeansProfiler_TerminateVMOnExitMsg=<b>\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u4e0b\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u5b9f\u884c\u304c\u7d42\u4e86\u3057\u307e\u3057\u305f\u3002</b>\n\u300cOK\u300d\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001VM\u304c\u7d42\u4e86\u3057\u307e\u3059\u3002
## Resource bundle for package org.netbeans.modules.profiler
#Mon May 03 18:59:38 CEST 2004
OpenIDE-Module-Display-Category=Java SE
OpenIDE-Module-Name=Java\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fb\u30b3\u30a2
OpenIDE-Module-Long-Description=NetBeans\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306f\u3001NetBeans IDE\u306bCPU\u3001\u30e1\u30e2\u30ea\u30fc\u3001\u30b9\u30ec\u30c3\u30c9\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u6a5f\u80fd\u3092\u8ffd\u52a0\u3059\u308b\u3001\u3042\u3089\u3086\u308b\u6a5f\u80fd\u306e\u63c3\u3063\u305fJava\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u3067\u3059\u3002

NpsResolver=nps\u30d5\u30a1\u30a4\u30eb
HprofResolver=\u30c0\u30df\u30fcHprof\u30d5\u30a1\u30a4\u30eb

ProfilerModule_CalibrationFailedMessage=\u8abf\u6574\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\n\u8a2d\u5b9a\u3092\u8abf\u3079\u3001\u518d\u5ea6\u3001\u8abf\u6574\u3092\u884c\u306a\u3063\u3066\u304f\u3060\u3055\u3044\u3002
ProfilerModule_ExitingFromAttachMessage=\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u5b9f\u884c\u4e2d\u3067\u3059\n\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u30c7\u30bf\u30c3\u30c1\u3057\u3066\u3001IDE\u3092\u7d42\u4e86\u3057\u307e\u3059\u304b?
ProfilerModule_ExitingFromProfileMessage=\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u5b9f\u884c\u4e2d\u3067\u3059\n\u73fe\u5728\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4e2d\u6b62\u3057\u3066\u3001IDE\u3092\u7d42\u4e86\u3057\u307e\u3059\u304b?
ProfilerModule_QuestionDialogCaption=\u8cea\u554f
ProfilingMonitor_OomeMsg=<html><b>\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30c7\u30fc\u30bf\u306e\u4fdd\u5b58\u306b\u5fc5\u8981\u306a\u91cf\u306e\u30e1\u30e2\u30ea\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002</b><br><br>\u3053\u306e\u30a8\u30e9\u30fc\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001NetBeans IDE\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u3042\u308betc/netbeans.conf\u30d5\u30a1\u30a4\u30eb\u5185\u306e -Xmx\u5024\u3092<br>\u5927\u304d\u304f\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
ResultsManager_CannotCompareSnapshotsMsg=<html><b>\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u6bd4\u8f03\u3067\u304d\u307e\u305b\u3093:</b><br><br>  {0}<br>  {1}<br><br>\u4e21\u65b9\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u304c\u540c\u3058\u30bf\u30a4\u30d7\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
ResultsManager_CannotOpenSnapshotMsg=<html><b>\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u958b\u3051\u307e\u305b\u3093\u3002</b><br><br>null\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u958b\u3053\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002<br>\u8a73\u7d30\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
ResultsManager_CantFindSnapshotLocationMsg=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5834\u6240\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
ResultsManager_CaptionWarning=\u8b66\u544a
ResultsManager_CpuSnapshotDisplayName=cpu: {0}
ResultsManager_DataNotAvailableMsg=\u7d50\u679c\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u307e\u3060\u30c7\u30fc\u30bf\u306f\u3042\u308a\u307e\u305b\u3093\u3002
ResultsManager_DifferentObjectSize=<html><b>\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30b5\u30a4\u30ba\u304c\u7570\u306a\u308a\u307e\u3059\u3002</b><br><br>\u540c\u3058\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30b5\u30a4\u30ba\u306f\u5404\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306b\u3088\u3063\u3066\u7570\u306a\u308a\u3001\u305d\u306e\u6bd4\u8f03\u306f\u7121\u52b9\u3067\u3059\u3002\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306f\u7570\u306a\u308b\u30a2\u30fc\u30ad\u30c6\u30af\u30c1\u30e3(32\u30d3\u30c3\u30c8\u5bfe64\u30d3\u30c3\u30c8)\u3067\u884c\u308f\u308c\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002</html>
ResultsManager_DirectoryDoesntExistCaption=\u9078\u629e\u3057\u305f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
ResultsManager_DirectoryDoesntExistMsg=\u9078\u629e\u3057\u305f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002\n\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u4f5c\u6210\u3057\u307e\u3059\u304b?
ResultsManager_ExportSnapshotData=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30c7\u30fc\u30bf\u306e\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
ResultsManager_FileDeleteFailedMsg=\u65e2\u5b58\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093: {0}
ResultsManager_HeapSnapshotDisplayName=\u30d2\u30fc\u30d7: {0}
ResultsManager_MemorySnapshotDisplayName=\u30e1\u30e2\u30ea\u30fc: {0}
ResultsManager_ObtainSavedSnapshotsFailedMsg=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u4fdd\u5b58\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u30ea\u30b9\u30c8\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
ResultsManager_OutOfMemoryMsg=\u53ce\u96c6\u30c7\u30fc\u30bf\u304c\u591a\u3059\u304e\u307e\u3059\u3002\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u304c\u30e1\u30e2\u30ea\u30fc\u4e0d\u8db3\u306b\u306a\u308a\u307e\u3057\u305f\u3002\n\n\u53ce\u96c6\u3055\u308c\u305f\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30c7\u30fc\u30bf\u304c\u524a\u9664\u3055\u308c\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u304c\u518d\u958b\u3055\u308c\u307e\u3057\u305f\u3002\n\u3053\u306e\u30a8\u30e9\u30fc\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001NetBeans IDE\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306b\u3042\u308b\netc/netbeans.conf\u30d5\u30a1\u30a4\u30eb\u5185\u306e -Xmx\u5024\u3092\u5927\u304d\u304f\u3059\u308b\u304b\u3001\n\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u8a2d\u5b9a\u3067\u8a73\u7d30\u306e\u91cf\u3092\u6e1b\u3089\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ResultsManager_OutOfMemorySavingMsg=<html><b>\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u4fdd\u5b58\u306b\u5fc5\u8981\u306a\u91cf\u306e\u30e1\u30e2\u30ea\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002</b><br><br>\u3053\u306e\u30a8\u30e9\u30fc\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001NetBeans IDE\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u3042\u308betc/netbeans.conf\u30d5\u30a1\u30a4\u30eb\u5185\u306e -Xmx\u5024\u3092<br>\u5927\u304d\u304f\u3057\u3066\u304f\u3060\u3055\u3044\u3002</html>
ResultsManager_OverwriteFileDialogCaption=\u65e2\u5b58\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u4e0a\u66f8\u304d\u3057\u307e\u3059\u304b?
ResultsManager_OverwriteFileDialogMsg=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u306b\u306f\u3059\u3067\u306b\u30d5\u30a1\u30a4\u30eb{0}\u304c\u3042\u308a\u307e\u3059\n\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u4e0a\u66f8\u304d\u3057\u307e\u3059\u304b?
ResultsManager_ProfiledAppTerminatedMsg=\u7d50\u679c\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u4e0b\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u7d42\u4e86\u3057\u307e\u3057\u305f\u3002
ResultsManager_ProfilerHeapdumpFileFilter=\u30d2\u30fc\u30d7\u30fb\u30c0\u30f3\u30d7\u30fb\u30d5\u30a1\u30a4\u30eb(*.{0})
ResultsManager_ProfilerSnapshotFileFilter=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb(*.{0})
ResultsManager_SaveButtonName=\u4fdd\u5b58
ResultsManager_SelectDirDialogCaption=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u9078\u629e
ResultsManager_SelectFileOrDirDialogCaption=\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u9078\u629e
ResultsManager_SnapshotCreateFailedMsg=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
ResultsManager_SnapshotCreateInProjectFailedMsg=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
ResultsManager_SnapshotDeleteFailedMsg=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
ResultsManager_SnapshotExportFailedMsg=<html><b>\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f:</b><br><br>{0}</html>
ResultsManager_SnapshotLoadFailed=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u30ed\u30fc\u30c9\u4e2d\u306b\u30a8\u30e9\u30fc: {0}
ResultsManager_SnapshotLoadFailedMsg=<html><b>\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8{0}\u306e\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002</b><br><br>{1}</html>
ResultsManager_SnapshotSaveFailedMsg=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u4fdd\u5b58\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
ResultsManager_SnapshotsLoadFailedMsg=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u306e\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
SaveSnapshotAction_ActionDescr=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u4fdd\u5b58
SaveSnapshotAction_ActionName=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u4fdd\u5b58
ServerStateMonitor_ProfilerBusy=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fb\u30d3\u30b8\u30fc
ServerStateMonitor_ServerInitializing=\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059...
ServerStateMonitor_ServerInstrumenting=\u8a08\u6e2c\u3057\u3066\u3044\u307e\u3059...
ServerStateMonitor_ServerPreparing=\u30c7\u30fc\u30bf\u3092\u6e96\u5099\u3057\u3066\u3044\u307e\u3059...
SnapshotDataLoader_DisplayName=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30ed\u30fc\u30c0\u30fc

#ResultsWindow_UpdateResultsAutomaticallyTooltip=Update Results Automatically
#ResultsWindow_CloseTabMenuItem=Close
#ResultsWindow_NoResultsToExportMessage=No results available to save.
#ResultsWindow_ErrorOpeningFileMessage=Error opening file {0}\:\n{1}
#ResultsWindow_ErrorWritingToFileMessage=Error writing to file {0}\:\n{1}
#ResultsWindow_NoProfilingResultsLabelText=No profiling results available yet
#ResultsWindow_NoResultsTabName=No Results
#ResultsWindow_ResultsTimestampTooltip=Obtained {0}
#ResultsWindow_ObjectAllocationsTabName=Object Allocations
#ResultsWindow_LiveObjectsTabName=Live Objects
#ResultsWindow_CPUCallTreeTabName=CPU Call Tree
#ResultsWindow_CodeRegionTabName=Code Region
#ResultsWindow_NoNewResultsMessage=No new results to display\n{0}
#ResultsWindow_MemoryProfilingInactiveMessage=Memory profiling inactive. Cannot display call graphs now.
#ResultsWindow_NoLiveObjectsExistMessage=No live objects for this class exist - nothing to display

HistoryPanel_ToolTipClass=\u30af\u30e9\u30b9
HistoryPanel_ToolTipObjects=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8
HistoryPanel_ToolTipSize=\u30b5\u30a4\u30ba
HistoryPanel_ToolTipCursor=\u30ab\u30fc\u30bd\u30eb:
HistoryPanel_ToolTipTime=\u6642\u9593
HistoryPanel_ToolTipLive=\u30e9\u30a4\u30d6
HistoryPanel_ToolTipAllocated=\u5272\u5f53\u3066\u6e08

MarkerMethodBuilder_ProjectRootCategory=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
SnapshotInfoAction_ActionDescr=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u60c5\u5831\u306e\u8868\u793a
SnapshotInfoAction_ActionName=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u60c5\u5831
SnapshotInfoAction_WindowCaption=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u60c5\u5831
SnapshotInfoPanel_BufferSizeString=\u30d0\u30c3\u30d5\u30a1\u30fb\u30b5\u30a4\u30ba:
SnapshotInfoPanel_CodeRegionString=\u30b3\u30fc\u30c9\u30fb\u30ea\u30fc\u30b8\u30e7\u30f3
SnapshotInfoPanel_CommentsString=\u30e6\u30fc\u30b6\u30fc\u30fb\u30b3\u30e1\u30f3\u30c8:
SnapshotInfoPanel_CommPortString=\u901a\u4fe1\u30dd\u30fc\u30c8:
SnapshotInfoPanel_CpuEntireString=CPU\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0(\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5168\u4f53)
SnapshotInfoPanel_CpuPartString=CPU\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0(\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4e00\u90e8)
SnapshotInfoPanel_CpuProfilingTypeString=CPU\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30bf\u30a4\u30d7:
SnapshotInfoPanel_CpuSamplingString=CPU\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0(\u30b5\u30f3\u30d7\u30ea\u30f3\u30b0\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3)
SnapshotInfoPanel_CpuTimerString=CPU\u30bf\u30a4\u30de\u30fc:
SnapshotInfoPanel_DataCollectedFromString=\u30c7\u30fc\u30bf\u53ce\u96c6\u5143:
SnapshotInfoPanel_DefinedQueries=\u5b9a\u7fa9\u3055\u308c\u305f\u554f\u5408\u305b:
SnapshotInfoPanel_EagerProfSchemeString=\u5373\u6642
SnapshotInfoPanel_EditCommentsLink=\u7de8\u96c6...
SnapshotInfoPanel_ExcludeSleepWaitString=Thread.sleep()\u3068Object.wait()\u306e\u5b9f\u884c\u6642\u9593\u3092\u9664\u304f:
SnapshotInfoPanel_FileSizeString=\u30d5\u30a1\u30a4\u30eb\u30fb\u30b5\u30a4\u30ba:
SnapshotInfoPanel_FileString=\u30d5\u30a1\u30a4\u30eb:
SnapshotInfoPanel_InfoAreaAccessName=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3002
SnapshotInfoPanel_InstancesCountString={0}\u500b\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9
SnapshotInfoPanel_InstrumentationFilterString=\u8a08\u6e2c\u30d5\u30a3\u30eb\u30bf:
SnapshotInfoPanel_InstrumentationProfTypeString=\u8a08\u6e2c
SnapshotInfoPanel_InstrumentationSchemeString=\u8a08\u6e2c\u306e\u67a0\u7d44\u307f:
SnapshotInfoPanel_InstrumentEmptyMethodsString=\u7a7a\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u8a08\u6e2c:
SnapshotInfoPanel_InstrumentGettersSettersString=\u53d6\u5f97\u304a\u3088\u3073\u8a2d\u5b9a\u30e1\u30bd\u30c3\u30c9\u3092\u8a08\u6e2c:
SnapshotInfoPanel_InstrumentMethodInvokeString=\u30e1\u30bd\u30c3\u30c9\u547c\u51fa\u3057\u3092\u8a08\u6e2c:
SnapshotInfoPanel_InstrumentNewThreadsString=\u65b0\u898f\u30b9\u30ec\u30c3\u30c9\u3092\u8a08\u6e2c:
SnapshotInfoPanel_InvalidString=<\u7121\u52b9>
SnapshotInfoPanel_JavaPlatformString=Java\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0:
SnapshotInfoPanel_JvmArgumentsString=JVM\u5f15\u6570:
SnapshotInfoPanel_LazyProfSchemeString=\u9045\u5ef6
SnapshotInfoPanel_LimitAllocations=\u5272\u5f53\u3066\u547c\u51fa\u3057\u306e\u5236\u9650:
SnapshotInfoPanel_LimitProfiledThreadsString=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3059\u308b\u30b9\u30ec\u30c3\u30c9\u6570\u3092\u5236\u9650:
SnapshotInfoPanel_LimitStackDepthString=\u30b9\u30bf\u30c3\u30af\u306e\u6df1\u3055\u3092\u5236\u9650:
SnapshotInfoPanel_LinesDefString={0}\u3001\u884c: {1}\u304b\u3089{2}
SnapshotInfoPanel_MemoryAllocString=\u30e1\u30e2\u30ea\u30fc(\u5272\u5f53\u3066\u306e\u307f)
SnapshotInfoPanel_MemoryLivenessString=\u30e1\u30e2\u30ea\u30fc(\u30e9\u30a4\u30d6)
SnapshotInfoPanel_MemorySamplingString=\u30e1\u30e2\u30ea\u30fc(\u30b5\u30f3\u30d7\u30ea\u30f3\u30b0)
SnapshotInfoPanel_MethodsAllClasses=\u30e1\u30bd\u30c3\u30c9 - \u3059\u3079\u3066\u306e\u30af\u30e9\u30b9
SnapshotInfoPanel_MethodsDefinedClasses=\u30e1\u30bd\u30c3\u30c9 - \u5b9a\u7fa9\u3055\u308c\u305f\u30af\u30e9\u30b9
SnapshotInfoPanel_MethodsProjectClasses=\u30e1\u30bd\u30c3\u30c9 - \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30af\u30e9\u30b9
SnapshotInfoPanel_MethodsSelectedClasses=\u30e1\u30bd\u30c3\u30c9 - \u9078\u629e\u3055\u308c\u305f\u30af\u30e9\u30b9
SnapshotInfoPanel_MethodsSelectedMethods=\u30e1\u30bd\u30c3\u30c9 - \u9078\u629e\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9
SnapshotInfoPanel_NoCommentsString=\u306a\u3057
SnapshotInfoPanel_NoMethodsString=\u30e1\u30bd\u30c3\u30c9\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u6700\u521d\u306b\u30ed\u30fc\u30c9\u3055\u308c\u308b\u30af\u30e9\u30b9\u306emain(String[] args)\u304c\u30eb\u30fc\u30c8\u30fb\u30e1\u30bd\u30c3\u30c9\u306b\u306a\u308a\u307e\u3059\u3002
SnapshotInfoPanel_NoString=\u3044\u3044\u3048
SnapshotInfoPanel_NotSavedString=\u672a\u4fdd\u5b58
SnapshotInfoPanel_ObjectsAllClasses=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 - \u3059\u3079\u3066\u306e\u30af\u30e9\u30b9
SnapshotInfoPanel_ObjectsProjectClasses=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 - \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30af\u30e9\u30b9
SnapshotInfoPanel_ObjectsSelectedClasses=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 - \u9078\u629e\u3055\u308c\u305f\u30af\u30e9\u30b9
SnapshotInfoPanel_OffString=\u30aa\u30d5
SnapshotInfoPanel_OnString=\u30aa\u30f3
SnapshotInfoPanel_OverridenGlobalPropertiesString=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9:
SnapshotInfoPanel_ProfiledCodeRegionString=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3055\u308c\u305f\u30b3\u30fc\u30c9\u30fb\u30ea\u30fc\u30b8\u30e7\u30f3:
SnapshotInfoPanel_ProfilingMode=\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30e2\u30fc\u30c9:
SnapshotInfoPanel_ProfilingTypeInstrumentation=\u8a08\u6e2c
SnapshotInfoPanel_ProfilingTypeSampling=\u30b5\u30f3\u30d7\u30ea\u30f3\u30b0
SnapshotInfoPanel_ProfilingTypeString=\u30d7\u30ed\u30d5\u30a1\u30a4\u30ea\u30f3\u30b0\u30fb\u30bf\u30a4\u30d7:
SnapshotInfoPanel_ProjectClasses=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30af\u30e9\u30b9:
SnapshotInfoPanel_ProjectPlatformNameString=<\u30d7\u30ed\u30b8\u30a7\u30af\u30c8>
SnapshotInfoPanel_RecordAllocations=\u30ec\u30b3\u30fc\u30c9\u5272\u5f53\u3066:
SnapshotInfoPanel_RecordLifecycle=\u30e9\u30a4\u30d6\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u307f\u30c8\u30e9\u30c3\u30ad\u30f3\u30b0:
SnapshotInfoPanel_RecordStackTracesString=\u30b9\u30bf\u30c3\u30af\u30fb\u30c8\u30ec\u30fc\u30b9\u3092\u8a18\u9332:
SnapshotInfoPanel_RootMethodsString=\u30eb\u30fc\u30c8\u30fb\u30e1\u30bd\u30c3\u30c9:
SnapshotInfoPanel_RunGcString=\u7d50\u679c\u53d6\u5f97\u6642\u306b\u30ac\u30d9\u30fc\u30b8\u30fb\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u5b9f\u884c:
SnapshotInfoPanel_SampledInstrProfTypeString=\u30b5\u30f3\u30d7\u30ea\u30f3\u30b0\u3055\u308c\u305f\u8a08\u6e2c
SnapshotInfoPanel_SampledProfTypeString=\u30b5\u30f3\u30d7\u30ea\u30f3\u30b0
SnapshotInfoPanel_SamplingPeriodString=\u30b5\u30f3\u30d7\u30ea\u30f3\u30b0\u5468\u671f:
SnapshotInfoPanel_SelectedClasses=\u9078\u629e\u3057\u305f\u30af\u30e9\u30b9:
SnapshotInfoPanel_SelectedMethods=\u9078\u629e\u30e1\u30bd\u30c3\u30c9:
SnapshotInfoPanel_SettingsNameString=\u8a2d\u5b9a\u540d:
SnapshotInfoPanel_SettingsString=\u8a2d\u5b9a:
SnapshotInfoPanel_SnapshotTakenAtString=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u53d6\u5f97:
SnapshotInfoPanel_SqlAllQueries=SQL\u554f\u5408\u305b - \u3059\u3079\u3066\u306e\u554f\u5408\u305b
SnapshotInfoPanel_SqlDefinedQueries=SQL\u554f\u5408\u305b - \u5b9a\u7fa9\u3055\u308c\u305f\u554f\u5408\u305b
SnapshotInfoPanel_StackDepthLimitString=\u30b9\u30bf\u30c3\u30af\u306e\u6df1\u3055\u306e\u9650\u5ea6:
SnapshotInfoPanel_SummaryString=\u30b5\u30de\u30ea\u30fc:
SnapshotInfoPanel_TotalProfSchemeString=\u5408\u8a08
SnapshotInfoPanel_TrackEveryString=\u30c8\u30e9\u30c3\u30ad\u30f3\u30b0\u5358\u4f4d:
SnapshotInfoPanel_TrackingAllInstancesString=\u3059\u3079\u3066\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u30c8\u30e9\u30c3\u30ad\u30f3\u30b0
SnapshotInfoPanel_UnlimitedString=\u7121\u5236\u9650
SnapshotInfoPanel_UserCommentsCaption=\u30e6\u30fc\u30b6\u30fc\u30fb\u30b3\u30e1\u30f3\u30c8\u3092\u7de8\u96c6
SnapshotInfoPanel_UserCommentsLbl=\u30e6\u30fc\u30b6\u30fc\u30fb\u30b3\u30e1\u30f3\u30c8(&U):
SnapshotInfoPanel_WorkingDirectoryString=\u4f5c\u696d\u30c7\u30a3\u30ec\u30af\u30c8\u30ea:
SnapshotInfoPanel_YesString=\u306f\u3044
SnapshotResultsWindow_CpuSnapshotAccessDescr=CPU\u7d50\u679c\u3092\u542b\u3080\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8
SnapshotResultsWindow_FragmentSnapshotAccessDescr=\u30b3\u30fc\u30c9\u30fb\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8\u7d50\u679c\u3092\u542b\u3080\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8
SnapshotResultsWindow_LoadingProgress=\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fb\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059...
SnapshotResultsWindow_MemorySnapshotAccessDescr=\u30e1\u30e2\u30ea\u30fc\u7d50\u679c\u3092\u542b\u3080\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u306e\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8
SnapshotResultsWindow_ProfileClass=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30af\u30e9\u30b9
SnapshotResultsWindow_ProfileMethod=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30fb\u30e1\u30bd\u30c3\u30c9
SnapshotResultsWindow_SaveSnapshotDialogMsg=\u7d50\u679c\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8\u304c\u4fdd\u5b58\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u4fdd\u5b58\u3057\u307e\u3059\u304b?
SnapshotResultsWindow_SqlQueryCaption=SQL\u554f\u5408\u305b\u30d3\u30e5\u30fc\u30a2
SnapshotResultsWindow_SqlQueryLabel=SQL\u554f\u5408\u305b:
ThreadDumpWindow_Caption=\u30b9\u30ec\u30c3\u30c9\u30fb\u30c0\u30f3\u30d7{0}

