<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>Exemples Formularis d'interf&iacute;cie gr&agrave;fica d'usuari</title>
<!--      Copyright (c) 2007 Sun Microsystems, Inc. All rights reserved. -->
<!--     Use is subject to license terms.-->
        <link rel="stylesheet" type="text/css" href="netbeans.css" media="screen">

</head>
<body>
<br>
<h1 align="">Descripci&oacute; del exemples de formularis d'interf&iacute;cie gr&agrave;fica d'usuari</h1>
<p>

Aquest projecte consta de tres formularis visuals que es van dissenyar amb el constructor d'IGUs de l'IDE. </p>
<p><strong>Per obrir un formulari d'exemple al constructor GUI:</strong></p>
<ol>
  <li>A la finestra projectes de l'IDE, navegueu al node del paquet predeterminat dins del  <br>
    directori del paquets font.</li>
  <br>
  <li>Cliqueu dues vegades al node del formulari d'exemple que voleu visualitzar.
    <p>El IDE llan&ccedil;a el constructor GUI Builder i mostra el formulari seleccionat.
  </p></li>
</ol>

<br>

<h2>Editor de contactes</h2>
<p>Aquesta formulari complex &eacute;s similar als quadres de di&agrave;leg de Windows utilitzats normalment per mostrar i editar la informaci&oacute; de base de dades. L'exemple il&middot;lustra la gamma completa de caracter&iacute;stiques del constructor GUI, alineaci&oacute;, ancoratge, mida, sagnia, temps d'execuci&oacute; i auto-canvi de mida en temps d'execuci&oacute;. Per veure una guia detallada d'aprenentatge que inclogui demostracions amb flash que mostrin com construir aquest tipus de formulari, vegeu <a href="http://netbeans.org/kb/60/java/quickstart-gui.html">Dissenyant una GUI Swing al IDE NetBeans</a>.</p>

<br>

<h2>Prefer&egrave;ncies d'antena</h2>
<p>Aquest exemple il&middot;lustra un tipus de formulari com&uacute; basat amb taules, utilitzat per a mostrar informaci&oacute; relacionada a grups visualment coherents. Les caracter&iacute;stiques avan&ccedil;ades d'alineaci&oacute; del constructor GUI, us permeten agrupar i canviar la mida als components no adjacents (com ara etiquetes, camps de text i botons) de forma consistent, sense la necessitat de combinar les cel&middot;les de forma manual.
</p>

<br>

<h2>Trobar</h2>
<p>Aquesta formulari senzill il&middot;lustra una esquema recte de disseny d'&uacute;s freq&uuml;ent en diverses aplicacions que requereixen la funcionalitat b&agrave;sica de cerca. Les caracter&iacute;stiques d'alineament al constructor d'interf&iacute;cie gr&agrave;fica d'usuari (GUI) i el canvi de mida, us permeten construir r&agrave;pidament aquests formularis mentre es vigila que aquests estiguin localitzats d'una forma predictible.
</p>

</body>
</html>
