# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

OpenIDE-Module-Display-Category=\u0412\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u044b
OpenIDE-Module-Long-Description=\u041e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u0435 \u0432\u0435\u0431-\u0441\u043b\u0443\u0436\u0431 StrikeIron \u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432 \u0432\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u044b RESTful
OpenIDE-Module-Name=\u0421\u043b\u0443\u0436\u0431\u044b StrikeIron

OpenIDE-Module-Short-Description=\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 \u0441\u043b\u0443\u0436\u0431\u044b StrikeIron


AddressVerification60_Name=\u041f\u0440\u043e\u0432\u0435\u0440\u043a\u0430 \u0430\u0434\u0440\u0435\u0441\u0430 40
EmailVerify50_Name=\u041f\u0440\u043e\u0432\u0435\u0440\u043a\u0430 \u044d\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u043e\u0439 \u043f\u043e\u0447\u0442\u044b 30
IPAddressLookup_Name=\u041f\u043e\u0438\u0441\u043a IP-\u0430\u0434\u0440\u0435\u0441\u0430
ReversePhoneLookup_Name=\u041f\u043e\u0438\u0441\u043a \u0430\u0434\u0440\u0435\u0441\u0430 \u043f\u043e \u0442\u0435\u043b\u0435\u0444\u043e\u043d\u043d\u043e\u043c\u0443 \u043d\u043e\u043c\u0435\u0440\u0443
SalesandUseTaxComplete5_Name=\u0412\u0437\u043d\u043e\u0441 \u0441\u0434\u0435\u043b\u0430\u043d 40
ZipCode_Name=\u041f\u043e\u0447\u0442\u043e\u0432\u044b\u0439 \u0438\u043d\u0434\u0435\u043a\u0441

AddressVerification60_Desc=<html>\u0412\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u044f\u0435\u0442 \u043a\u0430\u0436\u0434\u044b\u0439 \u044d\u043b\u0435\u043c\u0435\u043d\u0442 \u0430\u0434\u0440\u0435\u0441\u0430 \u043d\u0430 \u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u043e\u0441\u0442\u044c \u0438, <br/>\u0441 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435\u043c \u0441\u043e\u0432\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439 \u0442\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0438\u0438 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u044f \u0438 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0438\u0437\u0430\u0446\u0438\u0438 \u0434\u0430\u043d\u043d\u044b\u0445, \u043e\u0431\u043d\u043e\u0432\u043b\u044f\u0435\u0442 <br/>\u043d\u0435\u0432\u0435\u0440\u043d\u044b\u0435 \u0430\u0434\u0440\u0435\u0441\u0430 \u0441\u043e\u0433\u043b\u0430\u0441\u043d\u043e \u0442\u0440\u0435\u0431\u043e\u0432\u0430\u043d\u0438\u044f\u043c \u043f\u043e\u0447\u0442\u043e\u0432\u043e\u0433\u043e \u0432\u0435\u0434\u043e\u043c\u0441\u0442\u0432\u0430. \u0421\u043b\u0443\u0436\u0431\u0430 StrikeIron \u043f\u0440\u043e\u0432\u0435\u0440\u044f\u0435\u0442 \u043d\u043e\u043c\u0435\u0440\u0430 \u0434\u043e\u043c\u043e\u0432<br/>, \u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u0443\u043b\u0438\u0446, \u043d\u0430\u0437\u0432\u0430\u043d\u0438\u044f \u0443\u043b\u0438\u0446, \u043d\u043e\u043c\u0435\u0440\u0430 \u043a\u0432\u0430\u0440\u0442\u0438\u0440 \u0438 \u043f\u043e\u0447\u0442\u043e\u0432\u044b\u0435 \u044f\u0449\u0438\u043a\u0438, \u0447\u0442\u043e\u0431\u044b \u0433\u0430\u0440\u0430\u043d\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0442\u043e\u0447\u043d\u043e\u0441\u0442\u044c \u043a\u0430\u0436\u0434\u043e\u0433\u043e \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u0438 \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u0438\u0432\u0430\u0442\u044c \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u0435 \u0430\u0434\u0440\u0435\u0441\u043e\u0432 <br/>\u043f\u0440\u0430\u0432\u0438\u043b\u0430\u043c \u043f\u043e\u0447\u0442\u043e\u0432\u043e\u0433\u043e \u0432\u0435\u0434\u043e\u043c\u0441\u0442\u0432\u0430. \u041a\u0440\u043e\u043c\u0435 \u0442\u043e\u0433\u043e, \u0441\u043b\u0443\u0436\u0431\u0430 \u0438\u0441\u043f\u0440\u0430\u0432\u043b\u044f\u0435\u0442 \u043e\u0448\u0438\u0431\u043a\u0438, \u0434\u043e\u043f\u0443\u0449\u0435\u043d\u043d\u044b\u0435 \u0432 \u043d\u0430\u0437\u0432\u0430\u043d\u0438\u044f\u0445 \u0443\u043b\u0438\u0446,<br/> \u043f\u0440\u043e\u0432\u0435\u0440\u044f\u0435\u0442 \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u0441\u0442\u044c \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043d\u0438\u0439 \u0442\u0438\u043f\u043e\u0432 \u0443\u043b\u0438\u0446, \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u0438\u0437\u0438\u0440\u0443\u0435\u0442 \u043d\u0430\u0437\u0432\u0430\u043d\u0438\u044f \u0433\u043e\u0440\u043e\u0434\u043e\u0432 \u0438 <br/>\u043e\u0431\u043b\u0430\u0441\u0442\u0435\u0439, \u0430 \u0442\u0430\u043a\u0436\u0435 \u0434\u043e\u0431\u0430\u0432\u043b\u044f\u0435\u0442 \u043d\u0435\u0434\u043e\u0441\u0442\u0430\u044e\u0449\u0438\u0435 \u0430\u0431\u0431\u0440\u0435\u0432\u0438\u0430\u0442\u0443\u0440\u044b \u0448\u0442\u0430\u0442\u043e\u0432. \u0412\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c<br/>\u0432\u044b\u0437\u0432\u0430\u043d\u0430 \u0434\u043b\u044f \u043e\u0434\u0438\u043d\u043e\u0447\u043d\u043e\u0433\u043e \u0430\u0434\u0440\u0435\u0441\u0430 \u0438\u043b\u0438 \u0434\u043b\u044f \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438 \u043f\u0430\u043a\u0435\u0442\u0430.</html>

EmailVerify50_Desc=<html>\u0412\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 StrikeIron Email Verification \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u044f\u0435\u0442 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u044c \u0430\u0434\u0440\u0435\u0441\u043e\u0432 \u044d\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u043e\u0439 <br/>\u043f\u043e\u0447\u0442\u044b \u0438\u043b\u0438 \u0434\u043e\u043c\u0435\u043d\u043e\u0432 "\u043d\u0430 \u043b\u0435\u0442\u0443". \u041f\u0440\u043e\u0441\u0442\u043e \u0443\u043a\u0430\u0436\u0438\u0442\u0435 \u0430\u0434\u0440\u0435\u0441 \u044d\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u043e\u0439 \u043f\u043e\u0447\u0442\u044b, \u0438 \u0432\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 <br/>\u0441\u043e\u043e\u0431\u0449\u0438\u0442, \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u0435\u043d \u043e\u043d \u0438\u043b\u0438 \u043d\u0435\u0442, \u0441\u0432\u044f\u0437\u0430\u0432\u0448\u0438\u0441\u044c \u0441 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u043c \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c <br/>SMTP. \u041f\u0440\u0438 \u044d\u0442\u043e\u043c \u0441\u043b\u0443\u0436\u0431\u0430 \u043d\u0435 \u043e\u0442\u043f\u0440\u0430\u0432\u043b\u044f\u0435\u0442 \u043d\u0430 \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u0430\u0434\u0440\u0435\u0441 \u043d\u0438\u043a\u0430\u043a\u0438\u0445 \u043f\u0438\u0441\u0435\u043c. </html>

IPAddressLookup_Desc=<html>\u0414\u0430\u043d\u043d\u0430\u044f \u0432\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 IP-\u0430\u0434\u0440\u0435\u0441, \u0435\u0441\u043b\u0438 \u0438\u0437\u0432\u0435\u0441\u0442\u043d\u043e \u0438\u043c\u044f \u0432\u0435\u0431-\u0441\u0435\u0440\u0432\u0435\u0440\u0430. <br/>\u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, www.anywebserver.com \u0432\u0435\u0440\u043d\u0435\u0442 256.1.1.56.</html>

ReversePhoneLookup_Desc=<html>\u0421\u043b\u0443\u0436\u0431\u0430 Reverse Phone Lookup: \u0432\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 \u043f\u0440\u0435\u0434\u043e\u0441\u0442\u0430\u0432\u043b\u044f\u0435\u0442 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043c\u043d\u044b\u0439 \u0438\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u0434\u043b\u044f \u043f\u043e\u0438\u0441\u043a\u0430 <br/>\u0438\u043c\u0435\u043d \u0438 \u0430\u0434\u0440\u0435\u0441\u043e\u0432 \u043f\u043e \u0432\u0432\u043e\u0434\u0438\u043c\u043e\u043c\u0443 \u0442\u0435\u043b\u0435\u0444\u043e\u043d\u043d\u043e\u043c\u0443 \u043d\u043e\u043c\u0435\u0440\u0443 (90-\u0434\u043d\u0435\u0432\u043d\u0430\u044f \u0442\u043e\u0447\u043d\u043e\u0441\u0442\u044c). \u041e\u0431\u043d\u043e\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043a\u0430\u0436\u0434\u0443\u044e \u043d\u043e\u0447\u044c, <br/>\u0442\u043e\u0447\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f \u0432 \u043f\u0440\u0435\u0434\u0435\u043b\u0430\u0445 \u043f\u043e\u0441\u043b\u0435\u0434\u043d\u0438\u0445 90 \u0434\u043d\u0435\u0439 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0439.</html>

SalesandUseTaxComplete50_Desc=<html>\u0412\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 \u0441\u0438\u0441\u0442\u0435\u043c\u044b \u043d\u0430\u043b\u043e\u0433\u043e\u0432\u044b\u0445 \u0434\u0430\u043d\u043d\u044b\u0445 StrikeIron Sales and Use Tax \u043f\u0440\u0435\u0434\u043e\u0441\u0442\u0430\u0432\u043b\u044f\u0435\u0442 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043c\u043d\u044b\u0439 \u0438\u043d\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u0434\u043b\u044f <br/>\u043f\u043e\u043b\u0443\u0447\u0435\u043d\u0438\u044f \u0434\u0430\u043d\u043d\u044b\u0445 \u043e \u0441\u0442\u0430\u0432\u043a\u0430\u0445 \u043d\u0430\u043b\u043e\u0433\u043e\u0432 \u043d\u0430 \u043f\u0440\u043e\u0434\u0430\u0436\u0443 \u0438 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u0423\u043a\u0430\u0436\u0438\u0442\u0435 \u043f\u043e\u0447\u0442\u043e\u0432\u044b\u0439 \u0438\u043d\u0434\u0435\u043a\u0441 C\u0428\u0410 \u0438\u043b\u0438 \u041a\u0430\u043d\u0430\u0434\u044b,<br/> \u0438 \u0441\u043b\u0443\u0436\u0431\u0430 \u0432\u044b\u0432\u0435\u0434\u0435\u0442 \u043d\u0430 \u044d\u043a\u0440\u0430\u043d \u0434\u0430\u043d\u043d\u044b\u0435 \u043e \u0441\u0442\u0430\u0432\u043a\u0430\u0445 \u043d\u0430\u043b\u043e\u0433\u0430 \u0441 \u043f\u0440\u043e\u0434\u0430\u0436\u0438 \u0438 \u043d\u0430\u043b\u043e\u0433\u0430 \u043d\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435 \u0432 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0435\u043c \u0448\u0442\u0430\u0442\u0435,<br> \u043e\u043a\u0440\u0443\u0433\u0435, \u0433\u043e\u0440\u043e\u0434\u0435, \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0430\u043b\u044c\u043d\u043e\u043c \u0434\u0435\u043b\u0435\u043d\u0438\u0438 \u043f\u043e \u0441\u0445\u0435\u043c\u0430\u043c MTA, SPD \u0438 \u0434\u0440. \u041f\u043e\u0441\u043b\u0435 \u044d\u0442\u043e\u0433\u043e \u0434\u0430\u043d\u043d\u044b\u0435 \u0432 \u0438\u043d\u0442\u0435\u0440\u0430\u043a\u0442\u0438\u0432\u043d\u043e\u043c \u0440\u0435\u0436\u0438\u043c\u0435<br/> \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0443 \u043d\u0430 \u0431\u0430\u0437\u0435 XML \u043c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u043f\u0435\u0440\u0435\u0434\u0430\u043d\u044b \u0432 \u043b\u044e\u0431\u043e\u0435 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u0435, \u043f\u0440\u043e\u0434\u0443\u043a\u0442, \u043d\u0430 \u043b\u044e\u0431\u0443\u044e \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u0443 <br/>\u0438\u043b\u0438 \u0432\u0435\u0431-\u0441\u0430\u0439\u0442.</html>

ZipCode_Desc=<html>\u0412\u0435\u0431-\u0441\u043b\u0443\u0436\u0431\u0430 StrikeIron ZIP Code Information \u043f\u043e \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u043c\u0443 \u043f\u043e\u0447\u0442\u043e\u0432\u043e\u043c\u0443 \u0438\u043d\u0434\u0435\u043a\u0441\u0443 \u0421\u0428\u0410 \u0438\u043b\u0438 \u041a\u0430\u043d\u0430\u0434\u044b <br/>\u043d\u0430\u0445\u043e\u0434\u0438\u0442 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0439 \u0433\u043e\u0440\u043e\u0434, \u0448\u0442\u0430\u0442, \u043e\u043a\u0440\u0443\u0433, \u0430 \u0442\u0430\u043a\u0436\u0435 \u0443\u043a\u0430\u0437\u044b\u0432\u0430\u0435\u0442 \u0438\u0445 \u0448\u0438\u0440\u043e\u0442\u0443, \u0434\u043e\u043b\u0433\u043e\u0442\u0443 \u0438 \u0447\u0430\u0441\u043e\u0432\u043e\u0439 \u043f\u043e\u044f\u0441.</html>

