# This module is part of NetBeans and is open-source.
# You can see http://www.netbeans.org/about/legal/index.html for details.
#
# You may use the binary however you like. The source file license is:
#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Sun in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2007 Sun
# Microsystems, Inc. All Rights Reserved.

# Sample ResourceBundle properties file

# Libraries Panel
ADD_PROJECT_BUTTON_TXT=Adicionar Projeto...
ADD_PROJECT_BUTTON_TT=Adiciona a sa\u00edda de outro projeto \u00e0 linha de link

ADD_STANDARD_LIBRARY_BUTTON_TXT=Adicionar Biblioteca Padr\u00e3o...
ADD_STANDARD_LIBRARY_BUTTON_TT=Adiciona uma biblioteca padr\u00e3o \u00e0 linha de link

ADD_PKG_CONFIG_LIBRARY_BUTTON_TXT=Adicionar Biblioteca PkgConfig...
ADD_PKG_CONFIG_LIBRARY_BUTTON_TT=Adiciona uma biblioteca pkgconfig \u00e0 linha de link

ADD_LIBRARY_BUTTON_TXT=Adicionar Biblioteca...
ADD_LIBRARY_BUTTON_TT=Adiciona uma biblioteca (m, gnome, ...) \u00e0 linha de link

ADD_LIBRARY_FILE_BUTTON_TXT=Adicionar Arquivo de Biblioteca...
ADD_LIBRARY_FILE_BUTTON_TT=Adiciona um arquivo de biblioteca (/usr/lib/libodbc.a) \u00e0 linha de link

ADD_OPTION_BUTTON_TXT=Adicionar Op\u00e7\u00e3o...
ADD_OPTION_BUTTON_TT=Adiciona uma op\u00e7\u00e3o \u00e0 linha de link



ADD_PROJECT_DIALOG_TITLE=Adicionar Projeto
ADD_PROJECT_DIALOG_AD=Caixa de Di\u00e1logo Adicionar Projeto
SELECT_STATNDARD_LIBRARY_DIALOG_TITLE=Selecionar Biblioteca Padr\u00e3o
SELECT_LIBRARY_CHOOSER_TITLE=Selecionar Biblioteca
SELECT_LIBRARY_FILE_CHOOSER_TITLE=Selecionar Arquivo de Biblioteca
SELECT_CHOOSER_BUTTON=Selecionar
SELECT_OPTION_DIALOG_TITLE=Selecionar Op\u00e7\u00e3o
LIBRARIES_AND_OPTIONS_TXT=Bibliotecas e Op\u00e7\u00f5es:


# Projects Panel
ADD_PROJECTS_BUTTON_TXT=Adicionar...
ADD_PROJECTS_BUTTON_TT=Adiciona um projeto \u00e0 lista de projetos necess\u00e1rios

PROJECTS_TXT=Projetos:



# LibraryOptionPanel
STATIC_BINDINGS_TXT=&Bindings Est\u00e1ticos

DYNAMIC_BINDINGS_TXT=&Bindings Din\u00e2micos

OTHER_OPTION_TXT=&Outra Op\u00e7\u00e3o


#Make Artifact Chooser
PROJECT_NAME_TXT=Nome do Projeto:
PROJECT_LIBRARY_FILES_TXT=Con&figura\u00e7\u00f5es:

PROJECT_LIBRARY_FILES_AD=Configura\u00e7\u00f5es
ADD_ITSELF_ERROR=N\u00e3o \u00e9 poss\u00edvel adicionar uma refer\u00eancia a ela mesma.
ADD_CYCLIC_ERROR=N\u00e3o \u00e9 poss\u00edvel adicionar refer\u00eancias c\u00edclicas.
LOADING_PROJECT=Carregando...

# OptionsPanel
ALL_OPTIONS_TXT=&Todas as Op\u00e7\u00f5es:

INHERIT_TXT=&Herdar do projeto

INHERIT_AD=Herdar do projeto
ADDITIONAL_OPTIONS_TXT=&Op\u00e7\u00f5es Adicionais:
ADDITIONAL_OPTIONS_AD=Op\u00e7\u00f5es Adicionais


#StdLibPanel
STANDARD_LIBRARIES_TXT=&Bibliotecas Padr\u00e3o:

MANAGE_LIBRARIES_TXT=Gerenciar Bibliotecas...


#TableEditorPanel
CLICK_TO_CHANGE=Configura\u00e7\u00e3o - clique para alterar...
ITEM=Item
CONFIGURATION=Configura\u00e7\u00e3o
BUILD=Construir
BROKEN=Interrompido:

# StdLibPanel
LIBRARY_LIST_SD=Lista de bibliotecas padr\u00e3o
LIBRARY_LIST_NM=Bibliotecas Padr\u00e3o

# LibraryOptionPanel
LINKER_OPTIONS_PANEL_SD=Caixa de Di\u00e1logo Op\u00e7\u00f5es de vinculadores
LINKER_OPTIONS_DYNAMIC_RB_SD=Adicionar op\u00e7\u00e3o de vinculador din\u00e2mico
LINKER_OPTIONS_STATIC_RB_SD=Adicionar op\u00e7\u00e3o de vinculador est\u00e1tico
LINKER_OPTIONS_OTHER_RB_SD=Adicionar outras op\u00e7\u00f5es de vinculador
LINKER_OPTIONS_OTHER_TF_SD=Outras op\u00e7\u00f5es de vinculador

# ProjectPropPanel
ProjectPropPanel.sourceRootLabel.text=Pastas de C\u00f3digo-Fonte:

ProjectPropPanel.testRootLabel.text=Pastas de Teste:

ProjectPropPanel.projectLabel.text=&Localiza\u00e7\u00e3o do Projeto:
ProjectPropPanel.projectLabel.ad=Localiza\u00e7\u00e3o do Projeto


ADD_BUTTON_TXT=Adicionar

# {0} - name of configuration
ProjectPropPanel.encodingLabel.text=&Codifica\u00e7\u00e3o:

# DevelopmentHostNodeProp's customizer
DLG_TITLE_Connect=Verifica\u00e7\u00e3o de Configura\u00e7\u00e3o do Host

# Packaging
PackagingFilesPanel.addButton.text=Novo

PackagingFilesPanel.addButton.ad=Adicionar entrada vazia
PackagingFilesPanel.addFileOrDirButton.text=Adicionar Arquivo ou Diret\u00f3rio

PackagingFilesPanel.addFileOrDirButton.ad=Adicionar Arquivo ou Diret\u00f3rio
PackagingFilesPanel.addFilesButton.text=Adicionar Arquivos do Diret\u00f3rio

PackagingFilesPanel.addFilesButton.ad=Adicionar Arquivos do Diret\u00f3rio
PackagingFilesPanel.addLinkButton.text=Adicionar Softlink

PackagingFilesPanel.addLinkButton.ad=Adicionar Softlink
PackagingFilesPanel.addParameterButton.text=Adicionar

PackagingFilesPanel.addParameterButton.ad=Adicionar
PackagingFilesPanel.duplicateButton.text=Duplicar

PackagingFilesPanel.duplicateButton.ad=Entrada duplicada
PackagingFilesPanel.listlabel.text=Arquivos:

AddNewLinkDialogTitle=Adicionar Novo Softlink
PackagingInfoPanel.listlabel.text=Par\u00e2metros:

Softlink_tt=Softlink: {0}
Directory_tt=Diret\u00f3rio: {0}
File_tt=Arquivo: {0}

PACKAGING_ARCH_DOC=Uma lista separada por v\u00edrgulas de tokens alfanum\u00e9ricos que indicam a arquitetura associada ao pacote. A ferramenta pkgmk(1) pode ser usada para criar ou modificar este valor ao construir de fato o pacote. O tamanho m\u00e1ximo de um token \u00e9 16 caracteres e n\u00e3o pode incluir uma v\u00edrgula. O software de instala\u00e7\u00e3o do Solaris usa significativamente s\u00f3 um token de arquitetura no formato: <instruction_set_architecture>[.<platform_group>], em que platform_group destina-se somente a pacotes de instala\u00e7\u00e3o do Solaris. O software da aplica\u00e7\u00e3o de terceiros deve restringir-se a valores ARCH das seguintes arquiteturas de conjunto de instru\u00e7\u00f5es aceitas pelo Solaris (uname -p): sparc, i386 e ppc. Exemplos de grupos da plataforma do Solaris (uname -m) s\u00e3o sun4u para o conjunto de instru\u00e7\u00f5es SPARC e i86pc para o conjunto de instru\u00e7\u00f5es i386. Consulte uname(1) e isalist(1) para obter mais detalhes.
PACKAGING_CATEGORY_DOC=Uma lista separada por v\u00edrgulas de categorias nas quais um pacote pode ser exibido. Um pacote deve pertencer pelo menos \u00e0 categoria sistema ou \u00e0 categoria aplica\u00e7\u00e3o. As categorias fazem distin\u00e7\u00e3o entre mai\u00fasculas e min\u00fasculas e podem conter somente caracteres alfanum\u00e9ricos. Cada categoria \u00e9 limitada ao tamanho de 16 caracteres.
PACKAGING_NAME_DOC=Texto que especifica o nome do pacote (tamanho m\u00e1ximo de 256 caracteres ASCII). Use o par\u00e2metro NAME como base para descrever a funcionalidade e a finalidade do pacote; descreva os acr\u00f4nimos e evite nomes de c\u00f3digo internos de produto/projeto. O par\u00e2metro DESC pode ser usado para expandir as informa\u00e7\u00f5es descritivas. Use o par\u00e2metro NAME para demonstrar da forma mais espec\u00edfica poss\u00edvel o uso do pacote, por que um usu\u00e1rio precisaria carreg\u00e1-lo, e assim por diante.
PACKAGING_PKG_DOC=Abrevia\u00e7\u00e3o do pacote que est\u00e1 sendo instalado. Todos os caracteres na abrevia\u00e7\u00e3o devem ser alfanum\u00e9ricos. Voc\u00ea tamb\u00e9m pode usar os caracteres - e + na abrevia\u00e7\u00e3o. O primeiro caractere n\u00e3o pode ser num\u00e9rico, um + ou um -. A abrevia\u00e7\u00e3o \u00e9 limitada a um tamanho m\u00e1ximo de 32 caracteres. install, new e all s\u00e3o abrevia\u00e7\u00f5es reservadas. \u00c9 costume tornar exclusiva as primeiras quatro letras para a sua empresa, tal como o s\u00edmbolo de a\u00e7\u00f5es da empresa.
PACKAGING_VERSION_DOC=Texto que especifica a vers\u00e3o atual associada ao pacote do software. O tamanho m\u00e1ximo \u00e9 256 caracteres ASCII e o primeiro caractere n\u00e3o pode ser um par\u00eantese esquerdo. A ferramenta pkgmk(1) pode ser usada para criar ou modificar este valor ao construir de fato o pacote. A pr\u00e1tica do software atual da Solaris \u00e9 designar este par\u00e2metro, aumentando monotonicamente os valores decimais Dewey no formato: <major_revision>.<minor_revision>[.<micro_revision>], em que todos os campos de revis\u00e3o s\u00e3o n\u00fameros inteiros. Os campos de controle de vers\u00e3o podem ser estendidos para uma string de n\u00fameros arbitr\u00e1rios em formato decimal Dewey, se necess\u00e1rio.
PACKAGING_BASEDIR_DOC=O nome do caminho para um diret\u00f3rio default em que os arquivos "realoc\u00e1veis" podem ser instalados. Se estiver em branco, o pacote n\u00e3o ser\u00e1 realoc\u00e1vel e quaisquer arquivos que possuam nomes de caminho relativos n\u00e3o ser\u00e3o instalados. Um administrador pode substituir o diret\u00f3rio default.
PACKAGING_CLASSES_DOC=Uma lista separada por v\u00edrgulas de classes definidas para um pacote. A ordem da lista determina a ordem em que as classes s\u00e3o instaladas. As classes listadas primeiro s\u00e3o instaladas primeiro (m\u00eddia por m\u00eddia). Este par\u00e2metro pode ser modificado pelo script de solicita\u00e7\u00e3o.
PACKAGING_DESC_DOC=Texto que descreve o pacote (tamanho m\u00e1ximo de 256 caracteres ASCII). Este valor de par\u00e2metro \u00e9 usado para fornecer ao instalador uma descri\u00e7\u00e3o do que o pacote cont\u00e9m e deve aproveitar a descri\u00e7\u00e3o fornecida no par\u00e2metro NAME. Tente fazer os dois par\u00e2metros funcionarem juntos, de forma que pkginfo -l forne\u00e7a uma descri\u00e7\u00e3o textual bastante abrangente do pacote.
PACKAGING_EMAIL_DOC=Um endere\u00e7o eletr\u00f4nico no qual est\u00e3o dispon\u00edveis mais informa\u00e7\u00f5es ou bugs podem ser relatados (tamanho m\u00e1ximo de 256 caracteres ASCII).
PACKAGING_HOTLINE_DOC=N\u00famero de telefone e/ou endere\u00e7o de correspond\u00eancia no qual mais informa\u00e7\u00f5es podem ser recebidas ou bugs podem ser relatados (tamanho m\u00e1ximo de 256 caracteres ASCII).
PACKAGING_INTONLY_DOC=Indica que o pacote s\u00f3 deve ser instalado interativamente quando definido para um valor n\u00e3o nulo.
PACKAGING_ISTATES_DOC=Uma lista de estados de execu\u00e7\u00e3o permitidos para a instala\u00e7\u00e3o do pacote (por exemplo, "S s 1" permite os estados de execu\u00e7\u00e3o S, s ou 1). O ambiente operacional do Solaris aceita os n\u00edveis de execu\u00e7\u00e3o s, S, 0, 1, 2, 3, 5 e 6. Os n\u00edveis de execu\u00e7\u00e3o aplic\u00e1veis para este par\u00e2metro s\u00e3o s, S, 1, 2 e 3. Consulte init(1M) para obter detalhes.
PACKAGING_MAXINST_DOC=O n\u00famero m\u00e1ximo de inst\u00e2ncias do pacote que deve ser permitido em uma m\u00e1quina ao mesmo tempo. Por default, somente uma inst\u00e2ncia de um pacote \u00e9 permitida.  Este par\u00e2metro deve ser definido a fim de que haja v\u00e1rias inst\u00e2ncias de um pacote. Para dar suporte a v\u00e1rias inst\u00e2ncias de pacotes (por exemplo, pacotes que diferem em seu valor de par\u00e2metro ARCH ou VERSION), o valor desse par\u00e2metro deve ser alto o suficiente para permitir todas as inst\u00e2ncias de um determinado pacote, incluindo v\u00e1rias vers\u00f5es coexistentes em um servidor de software.
PACKAGING_ORDER_DOC=Uma lista de classes que define a ordem em que elas devem ser colocadas no meio. Usado por pkgmk(1) na cria\u00e7\u00e3o do pacote. As classes n\u00e3o definidas neste campo s\u00e3o colocadas no meio por meio de procedimentos de classifica\u00e7\u00e3o padr\u00e3o.
PACKAGING_PSTAMP_DOC=Carimbo de produ\u00e7\u00e3o usado para marcar o arquivo pkgmap(4) nos volumes de sa\u00edda. Fornece um meio para distinguir entre as c\u00f3pias de produ\u00e7\u00e3o de uma vers\u00e3o, se mais de uma estiver sendo usada ao mesmo tempo. Se PSTAMP n\u00e3o estiver definido, ser\u00e1 usado o default. O default consiste no nome da m\u00e1quina do sistema UNIX seguido pela string "YYYYMMDDHHMMSS" (ano, m\u00eas, data, hora, minutos, segundos).
PACKAGING_RSTATES_DOC=Uma lista de estados de execu\u00e7\u00e3o para a remo\u00e7\u00e3o do pacote (por exemplo, "S  s  1" permite os estados de execu\u00e7\u00e3o S, s ou 1). O ambiente operacional do Solaris aceita os n\u00edveis de execu\u00e7\u00e3o s, S,  0, 1, 2, 3, 5 e 6. Os n\u00edveis de execu\u00e7\u00e3o aplic\u00e1veis para este par\u00e2metro s\u00e3o s,  S,  1,  2  e 3. Consulte init(1M) para obter detalhes.
PACKAGING_SUNW_ISA_DOC=Par\u00e2metro opcional somente do Solaris que indica que um pacote de software cont\u00e9m objetos de 64 bits, caso esteja definido como sparcv9. Se este par\u00e2metro n\u00e3o for definido, a ISA default (arquitetura do conjunto de instru\u00e7\u00f5es) ser\u00e1 definida para o valor do par\u00e2metro ARCH.
# Language code is used as example here
PACKAGING_SUNW_LOC_DOC=Par\u00e2metro opcional somente do Solaris usado para indicar um pacote de software  que cont\u00e9m arquivos de localiza\u00e7\u00e3o de um determinado produto ou aplica\u00e7\u00e3o. O valor do par\u00e2metro \u00e9 uma lista separada por v\u00edrgulas das configura\u00e7\u00f5es regionais aceitas por um pacote. Ele \u00e9 usado somente para pacotes que cont\u00eam arquivos de localiza\u00e7\u00e3o, geralmente os cat\u00e1logos de mensagem. Os valores permitidos para esse campo de string s\u00e3o aqueles localizados na tabela Standard Locale Names no International Language Environments Guide. SUNW_LOC="<locale_name>,<locale_name>,..,\\ <locale_name>", em que <locale_name>::= <language>[_<territory>]\\ [.<codeset>] <language>::= o conjunto de nomes de ISO 639 <territory>::= o conjunto de territ\u00f3rios especificados em ISO 3166 <codeset>::= \u00e9 uma string correspondente ao conjunto de caracteres codificado. J\u00e1 que um valor C especifica o comportamento tradicional do sistema UNIX (ingl\u00eas norte-americano, en_US), os pacotes que pertencem \u00e0 configura\u00e7\u00e3o regional C s\u00e3o visualizados como pacotes n\u00e3o localizados e, portanto, n\u00e3o devem ter SUNW_LOC e SUNW_PKGLIST inclu\u00eddos em seu arquivo pkginfo. Consulte tamb\u00e9m o par\u00e2metro SUNW_LOC em packagetoc(4) e setlocale(3C) para obter mais informa\u00e7\u00f5es. Esta palavra-chave n\u00e3o \u00e9 reconhecida pelo utilit\u00e1rio de software add-on Gerenciador de Software.
PACKAGING_SUNW_PKG_DIR_DOC=Um valor definido por pkgadd que cont\u00e9m a localiza\u00e7\u00e3o do pacote de instala\u00e7\u00e3o. Este valor \u00e9 fornecido para quaisquer scripts de procedimento de pacote de tempo de instala\u00e7\u00e3o que precisa saber onde o pacote de instala\u00e7\u00e3o est\u00e1 localizado. Este par\u00e2metro nunca deve ser definido manualmente em um arquivo pkginfo.
PACKAGING_SUNW_PKG_ALLZONES_DOC=Define se um pacote, quando instalado, deve ser instalado e deve ser id\u00eantico em todas as zonas. O valor atribu\u00eddo pode ser verdadeiro ou falso O valor default \u00e9 falso. A defini\u00e7\u00e3o de SUNW_PKG_ALLZONES tem os efeitos descritos abaixo. Consulte man -s4 pkginfo para obter mais detalhes.
PACKAGING_SUNW_PKG_HOLLOW_DOC=Define se um pacote deve estar vis\u00edvel em qualquer zona n\u00e3o global, se esse pacote tiver que ser instalado e for id\u00eantico em todas as zonas (por exemplo, um pacote que possui SUNW_PKG_ALLZONES=true). O valor designado pode ser verdadeiro ou falso O valor default \u00e9 falso. O pacote n\u00e3o precisa ser instalado, mas caso seja instalado, a defini\u00e7\u00e3o de SUNW_PKG_HOLLOW tem os efeitos descritos abaixo. Consulte man -s4 pkginfo para obter mais detalhes.
PACKAGING_SUNW_PKG_THISZONE_DOC=Define se um pacote deve ser instalado somente na zona atual. O valor designado pode ser verdadeiro ou falso O valor default \u00e9 falso. A defini\u00e7\u00e3o de SUNW_PKG_THISZONE tem os efeitos descritos abaixo. Consulte man -s4 pkginfo para obter mais detalhes.
PACKAGING_SUNW_PKGLIST_DOC=Par\u00e2metro opcional somente do Solaris usado para associar um pacote de localiza\u00e7\u00e3o aos pacote dos quais ele \u00e9 derivado. Ele \u00e9 necess\u00e1rio sempre que o par\u00e2metro SUNW_LOC \u00e9 definido. Este valor de par\u00e2metro \u00e9 uma lista separada por v\u00edrgulas de abrevia\u00e7\u00f5es de pacote no formato: SUNW_PKGLIST="pkg1[:version],pkg2[:version],..." em que version (se especificada) deve corresponder \u00e0 string de vers\u00e3o no pacote base especificado (consulte o par\u00e2metro VERSION nesta p\u00e1gina do manual). Quando em uso, SUNW_PKGLIST ajuda a determinar a ordem de instala\u00e7\u00e3o do pacote. Os pacotes listados no par\u00e2metro s\u00e3o instalados antes que o pacote de localiza\u00e7\u00e3o em quest\u00e3o seja instalado. Quando deixado em branco, SUNW_PKGLIST="", presume-se que o pacote seja necess\u00e1rio para que a configura\u00e7\u00e3o regional funcione corretamente. Consulte o par\u00e2metro SUNW_PKGLIST em packagetoc(4) para obter mais informa\u00e7\u00f5es. Esta palavra-chave n\u00e3o \u00e9 reconhecida pelo utilit\u00e1rio de software add-on Gerenciador de Software.
PACKAGING_SUNW_PKGTYPE_DOC=Par\u00e2metro somente do Solaris para uso interno apenas da Sun. Obrigat\u00f3rio para parte dos pacotes das vers\u00f5es do ambiente operacional do Solaris instalados nos sistemas de arquivo /, /usr, /usr/kvm e /usr/openwin. O software de instala\u00e7\u00e3o do ambiente operacional do Solaris deve saber quais pacotes s\u00e3o parte de qual sistema de arquivos, a fim de instalar corretamente uma configura\u00e7\u00e3o servidor/cliente. Os valores permitidos no momento para este par\u00e2metro s\u00e3o root, usr, kvm e ow. Se n\u00e3o houver par\u00e2metro SUNW_PKGTYPE, presume-se que o pacote seja BASEDIR=/opt. SUNW_PKGTYPE \u00e9 opcional somente para pacotes instalados no namespace /opt, como \u00e9 o caso da maioria dos softwares add-on do Solaris. Consulte o par\u00e2metro SUNW_PKGTYPE em packagetoc(4) para obter mais informa\u00e7\u00f5es.
PACKAGING_SUNW_PKGVERS_DOC=Par\u00e2metro somente do Solaris que indica a vers\u00e3o da interface do pacote do ambiente operacional do Solaris. SUNW_PKGVERS="<sunw_package_version>", em que <sunw_package_version> tem o formato x.y[.z] e x, y, e z s\u00e3o n\u00fameros inteiros. Para a constru\u00e7\u00e3o de pacotes desta vers\u00e3o e das vers\u00f5es anteriores, use SUNW_PKGVERS="1.0".
PACKAGING_SUNW_PRODNAME_DOC=Par\u00e2metro somente do Solaris que indica o nome do produto do qual este pacote \u00e9 uma parte ou que o cont\u00e9m (tamanho m\u00e1ximo de 256 caracteres ASCII). Alguns exemplos de valores SUNW_PRODNAME usados no momento s\u00e3o: "SunOS", "OpenWindows" e "Common Desktop Environment".
PACKAGING_SUNW_PRODVERS_DOC=Par\u00e2metro somente do Solaris que indica a vers\u00e3o ou release do produto descrito em SUNW_PRODNAME  (tamanho m\u00e1ximo de 256 caracteres ASCII). Por exemplo, onde SUNW_PRODNAME="SunOS" e a vers\u00e3o Solaris 2.x Beta, essa string poderia ser "5.x BETA", enquanto para a vers\u00e3o Solaris 2.x FCS, a string seria "5.x". Para Solaris 10, a string \u00e9 "5.10". Se o par\u00e2metro SUNW_PRODNAME for NULO, ent\u00e3o o mesmo dever\u00e1 acontecer com o par\u00e2metro SUNW_PRODVERS.
PACKAGING_ULIMIT_DOC=Se definido, este par\u00e2metro \u00e9 passado como um argumento para o comando ulimit(1) (consulte limit(1)), que estabelece o tamanho m\u00e1ximo de um arquivo durante a instala\u00e7\u00e3o.
PACKAGING_VENDOR_DOC=Usado para identificar o fornecedor que possui o direito autoral do software (tamanho m\u00e1ximo de 256 caracteres ASCII).
PACKAGING_VSTOCK_DOC=O n\u00famero de estoque do fornecedor, se houver, que identifica este produto (tamanho m\u00e1ximo de 256 caracteres ASCII).

PackagingNewEntryPanel.entryLabel.text=&Nome:
PackagingNewEntryPanel.valueLabel.text=&Valor:
PackagingFilesOuterPanel.filePermLabel.text=Arqu&ivos Regulares:
PackagingFilesOuterPanel.ownerLabel.text=Pro&priet\u00e1rio:
PackagingFilesOuterPanel.groupLabel.text=&Grupo:
PackagingFilesOuterPanel.defaultValues.text=Propriedades Default do Arquivo (usadas ao adicionar arquivos ou diret\u00f3rios):
PackagingFilesOuterPanel.exePermLabel.text=Arquivos E&xe:
PackagingFilesOuterPanel.topDirectoryLabel.text=Diret\u00f3rio Superi&or:
PackagingFilesOuterPanel.column.0.text=Tipo
PackagingFilesOuterPanel.column.1.text=Caminho do Arquivo ou do Diret\u00f3rio no Pacote
PackagingFilesOuterPanel.column.2.text=Arquivo ou Link Original
PackagingFilesOuterPanel.column.3.text=Permiss\u00e3o
PackagingFilesOuterPanel.column.4.text=Propriet\u00e1rio
PackagingFilesOuterPanel.column.5.text=Grupo
FileChooserFileTitle=Adicionar Arquivo ou Diret\u00f3rio
FileChooserFilesTitle=Adicionar Arquivos do Diret\u00f3rio
FileChooserButtonText=Selecionar
PackagingInfoPanel.column.0.text=Nome
PackagingInfoPanel.column.1.text=Valor
AddNewParameterDialogTitle=Adicionar Novo Par\u00e2metro
PackagingAddingFilesProgressPanel.Stop.Button.text=Interromper

PackagingAddingFilesProgressPanel.title=Adicionando Arquivos...

# PackagingPanel
InfoPanelText=Informa\u00e7\u00f5es
FilePanelText=Arquivos

# PackagingNodeProp
FilesTextZero=0 Arquivos
FilesTextOne={0} Arquivo: {1}
FilesTextMany={0} Arquivos: {1}
PackagingPanel.tabbedPane.AccessibleContext.accessibleName=FilesAndInfoPanel
PackagingPanel.tabbedPane.AccessibleContext.accessibleDescription=Pain\u00e9is Arquivos e Informa\u00e7\u00f5es
PackagingInfoOuterPanel.docTextArea.AccessibleContext.accessibleName=DocArea
PackagingInfoOuterPanel.docTextArea.AccessibleContext.accessibleDescription=\u00c1rea de Documenta\u00e7\u00e3o
PackagingNewEntryPanel.docArea.AccessibleContext.accessibleName=DocArea
PackagingNewEntryPanel.docArea.AccessibleContext.accessibleDescription=\u00c1rea de Documenta\u00e7\u00e3o
PackagingNewEntryPanel.entryComboBox.AccessibleContext.accessibleName=Caixa de Combina\u00e7\u00e3o do Par\u00e2metro
PackagingNewEntryPanel.entryComboBox.AccessibleContext.accessibleDescription=Seletor de Par\u00e2metros
PackagingNewEntryPanel.entryValueTextField.AccessibleContext.accessibleDescription=Valor do Par\u00e2metro
PackagingFilesOuterPanel.topDirectoryTextField.AccessibleContext.accessibleDescription=Diret\u00f3rio Superior
PackagingFilesOuterPanel.exePermTextField.AccessibleContext.accessibleDescription=Permiss\u00e3o de Execu\u00e7\u00e3o
PackagingFilesOuterPanel.filePermTextField.AccessibleContext.accessibleDescription=Permiss\u00e3o do Arquivo
PackagingFilesOuterPanel.ownerTextField.AccessibleContext.accessibleDescription=Propriet\u00e1rio do Arquivo
PackagingFilesOuterPanel.groupTextField.AccessibleContext.accessibleDescription=Grupo de Arquivos
PackagingNewLinkPanel.nameLabel.text=&Nome do link:



PackagingNewLinkPanel.link.text=&A qu\u00ea ele vincula:
PackagingNewLinkPanel.nameTextField.AccessibleContext.accessibleDescription=Nome do link
PackagingNewLinkPanel.linkTextField.AccessibleContext.accessibleDescription=Alvo do link
PackagingAddingFilesProgressPanel.fileLabel.text=&Arquivo adicionado:
PackagingAddingFilesProgressPanel.fileTextField.AccessibleContext.accessibleDescription=Arquivo sendo adicionado
PackagingAddingFilesProgressPanel.AccessibleContext.accessibleName=ProgressPanel
PackagingAddingFilesProgressPanel.AccessibleContext.accessibleDescription=Painel de Progresso
PackagingAddingFilesProgressPanel.progressBar.AccessibleContext.accessibleName=ProgressBar
PackagingAddingFilesProgressPanel.progressBar.AccessibleContext.accessibleDescription=Barra de Progresso
PackagingFilesOuterPanel.jLabel4.text=Propriet\u00e1rio e Grupo









PackagingFilesOuterPanel.filePermTextField.AccessibleContext.accessibleName=Permiss\u00e3o de Execut\u00e1vel do Arquivo Regular
PackagingFilesOuterPanel.exePermTextField.AccessibleContext.accessibleName=Permiss\u00e3o de Execut\u00e1vel do Arquivo Exe

# AdditionalInfoPanel
AdditionalInfoLabel_txt=Informa\u00e7\u00f5es adicionais:

ADD_DIALOG_LABEL_TXT=Informa\u00e7\u00f5es Adicionais
ADD_BUTTON_LBL=Novo

REMOVE_BUTTON_LBL=Remover

UP_BUTTON_LBL=Para Cima

DOWN_BUTTON_LBL=Para Baixo

ProjectPropPanel.seeAlsoLabel.text=(Consulte tamb\u00e9m o filtro de arquivo de n\u00edvel IDE em Op\u00e7\u00f5es->Diversos->Arquivos)
ProjectPropPanel.ignoreFoldersLabel.text=&Padr\u00e3o de Pastas Ignoradas:

ProjectPropPanel.ignoreFoldersDefaultButton.text=De&fault

ProjectPropPanel.incorrectRegEx=O Padr\u00e3o de Pastas est\u00e1 incorreto:\n {0}\nRestaurando para o valor default.

#CompilerSetEditorCustomizer
CompilerSetEditorCustomizerTitile=Gerenciador de Cole\u00e7\u00f5es de Ferramentas - {0}

RemoteSyncFactoryTxt=C\u00f3digo-fonte
RemoteSyncFactoryNoFactory=Local (sem sincroniza\u00e7\u00e3o)
RemoteSyncFactoryHint=Em um projeto remoto, especifica onde os c\u00f3digos-fonte est\u00e3o localizados: no local, remotamente ou compartilhados

default_cs=Default
PkgConfigLibrary.label.text=Bibliotecas &PkgConfig:
PkgConfigLibrary.filterLabel.text=&Filtro:
PkgConfigLibrary.tooltip.text=<html>{0}<br>Vers\u00e3o: {1}<br>Bibl: {2}
Init_PkgConfigLibrary_List=Inicializando lista de bibliotecas...
Error_PkgConfigLibrary_List=O host n\u00e3o est\u00e1 dispon\u00edvel
PkgConfigLibrary_CTL_Cancel=Cancelar
PkgConfigLibrary_CTL_OK=OK

FormattingPropPanel.cLabel.text=Estilo de Formata\u00e7\u00e3o &C:
FormattingPropPanel.cppLabel.text=Estilo de &Formata\u00e7\u00e3o C++:
FormattingPropPanel.headerLabel.text=E&stilo de Formata\u00e7\u00e3o do Cabe\u00e7alho C/C++:
FormattingPropPanel.globalRadioButton.text=Usar estilo de formata\u00e7\u00e3o &global
FormattingPropPanel.projectRadioButton.text=Usar estilo de formata\u00e7\u00e3o espec\u00edfico do &projeto

#State Code Assistance
CodeAssistanceItem_ParsedSource=Arquivo-Fonte Analisado por Parsing
CodeAssistanceItem_ExtraParsedSource=Arquivo-Fonte Extra Analisado por Parsing
CodeAssistanceItem_ParsedOrphanHeader=Cabe\u00e7alho Analisado por Parsing sem Contexto
CodeAssistanceItem_IncludedHeader=Inclu\u00eddo como Arquivo de Cabe\u00e7alho
CodeAssistanceItem_ExcludedSource=Arquivo-Fonte N\u00e3o Analisado por Parsing
CodeAssistanceItem_ExcludedHeader=Cabe\u00e7alho N\u00e3o Inclu\u00eddo por Arquivos-Fonte
CodeAssistanceItem_NotYetParsed=Arquivo Ainda N\u00e3o Analisado por Parsing
MacroExpandedEditorPanel.previewLabel.text=Visualizar:

#Platform specific configuration
PlatformSpecificFalse=Configura\u00e7\u00e3o dependente de plataforma
PlatformSpecificTrue=Configura\u00e7\u00e3o para {0}

