OpenIDE-Module-Display-Category=Base de Datos
OpenIDE-Module-Long-Description=Este m\u00f3dulo proporciona a NetBeans caracter\u00edsticas de bases de datos MySQL.  Esto incluye la administraci\u00f3n b\u00e1sica de un servidor local y cualquier otra funcionalidad que consideremos importante.
OpenIDE-Module-Name=Compatibilidad con bases de datos MySQL
OpenIDE-Module-Short-Description=Proporciona a NetBeans compatibilidad con bases de datos MySQL

#Installer
MSG_RegisterMySQL=Buscando un servidor local para bases de datos MySQL.

#ServerNode
# Run states
DISCONNECTED=(desconectado)
CONNECTED=
CONFIGERR=(error de configuraci\u00f3n)

LBL_ServerDisplayName=Servidor MySQL en {0} [{1}] {2}
LBL_ServerShortDescription=Instancia del servidor MySQL Server en {0} [user {1}] {2}
LBL_ServerShortDescriptionError=Error con la configuraci\u00f3n de MySQL: {0}

MSG_UnableToGetDatabaseList=No se puede obtener la lista de bases de datos del servidor MYSQL

#DatabaseNode
LBL_DBNodeShortDescription=Base de datos MySQL  {0}

#DatabaseUtils
MSG_JDBCDriverNotRegistered=El controlador JDBC para MySQL no est\u00e1 registrado
MSG_UnableToLoadJDBCDriver=No se puede cargar el controlador JDBC
MSG_NotEnoughInformationToConnect=No se dispone de suficiente informaci\u00f3n para conectar con el servidor MSQL.  Compruebe las propiedades de MYSQL y vuelva a intentarlo

#PropertiesAction
LBL_PropertiesAction=Propiedades...

#RegisterServerAction
LBL_RegisterServerAction=Registrar servidor MySQL...

#RefreshServerAction
LBL_RefreshServerAction=Actualizar

#CreateDatabaseAction
LBL_CreateDatabaseAction=Crear base de datos...

#DeleteDatabaseAction
MSG_ErrorDeletingDatabase=No se puede eliminar la base de datos {0}

#ConnectAction
LBL_ConnectAction=Conectar...

#Utils
MSG_SeeErrorLog=Para obtener m\u00e1s detalles lea el informe de errores

#DatabaseUtils
ERR_MySQLCommunicationFailure=No se puede comunicar con el servidor MySQL.  Compruebe que se est\u00e1 ejecutando y que est\u00e1n configurados correctamente el anfitri\u00f3n y el puerto.
MSG_ErrorDialogTitle=Error

MSG_ConnectingToServer=Intentando conectar al servidor MySQL
MSG_ReconnectingToServer=Voviendo a conectar con el servidor MySQL
MSG_UnableToConnect=No se puede conectar con el servidor MySQL.  Compruebe la configuraci\u00f3n en Propiedades y vuelva a intentarlo.

#ConnectServerAction
LBL_ConnectServerAction=Conectar

#DisconnectServerAction
LBL_DisconnectServerAction=Desconectar

#StartAction
LBL_StartAction=&Iniciar
MSG_UnableToStartServer=No se puede iniciar el servidor MySQL.  Compruebe la configuraci\u00f3n y vuelva a intentarlo.
MSG_NoStopPath=No se ha establecido la ruta hacia la orden start de MySQL.  \u00bfDesea editar las propiedades del servidor para establecer esta ruta?

#StopAction
LBL_StopAction=Detener
MSG_ServerStopped=El servidor ha sido detenido
MSG_UnableToStopServer=Error al detener el servidor MySQL
MSG_NoStartPath=No se ha establecido la ruta hacia la orden start de MySQL.  \u00bfDesea editar las propiedades del servidor para establecer esta ruta?

#AdministerAction
LBL_AdministerAction=Ejecutar la herramienta de administraci\u00f3n
MSG_NoAdminPath=No se ha establecido la ruta/direcci\u00f3n URL a la herramienta de administraci\u00f3n de MySQL.  \u00bfDesea editar las propiedades del servidor para establecer esta ruta?
MSG_ErrorStartingAdminTool=Se produjo un error al iniciar la herramienta de administraci\u00f3n

#ServerInstance
MSG_NoSuchSample=El nombre {0} no es un nombre admitido de base de datos de ejemplo.
MSG_ErrorLoadingSampleSQL=No se puede cargar el SQL para el ejemplo {0}: {1}
MSG_ErrorExecutingSampleSQL=Error al ejecutar el SQL para el ejemplo {0}: {1}
MSG_AdminCommandNotSet=No se ha establecido la ruta de la orden admin. Utilice el cuadro de di\u00e1logo de propiedades de MySQL para establecer la ruta.
MSG_InvalidAdminCommand=La orden admin {0} no es una direcci\u00f3n URL o un archivo v\u00e1lidos.  Elija Propiedades y seleccione la pesta\u00f1a Administrar para rectificar la ruta.
MSG_InvalidStartCommand=La orden start {0} no es un archivo v\u00e1lido.  Elija Propiedades y seleccione la pesta\u00f1a Administrar para rectificar la ruta.
MSG_InvalidStopCommand=La orden stop {0} no es un archivo v\u00e1lido.  Elija Propiedades y seleccione la pesta\u00f1a Administrar para rectificar la ruta.
LBL_MySQLOutputTab=Comandos del servidor MySQL
LBL_StoppingMySQLServer=Deteniendo el servidor MySQL

