# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

OpenIDE-Module-Display-Category=Web\u30b5\u30fc\u30d3\u30b9
OpenIDE-Module-Long-Description=RESTful Web\u30b5\u30fc\u30d3\u30b9\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3068\u3057\u3066\u306eStrikeIron Web\u30b5\u30fc\u30d3\u30b9\u306e\u5ba3\u8a00
OpenIDE-Module-Name=StrikeIron\u30b5\u30fc\u30d3\u30b9

OpenIDE-Module-Short-Description=StrikeIron\u30b5\u30fc\u30d3\u30b9\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8


AddressVerification60_Name=Address Verification 40
EmailVerify50_Name=Email Verification 30
IPAddressLookup_Name=IP Address Lookup
ReversePhoneLookup_Name=Reverse Phone Lookup
SalesandUseTaxComplete5_Name=Tax Complete 40
ZipCode_Name=Zip Code

AddressVerification60_Desc=<html>\u3053\u306eWeb\u30b5\u30fc\u30d3\u30b9\u306f\u3001\u4f4f\u6240\u5185\u306e\u3059\u3079\u3066\u306e\u8981\u7d20\u306e\u59a5\u5f53\u6027\u3092\u691c\u67fb\u3057\u3001<br/>\u9ad8\u5ea6\u306a\u7167\u5408\u3068\u30c7\u30fc\u30bf\u6a19\u6e96\u5316\u30c6\u30af\u30ce\u30ed\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001<br/>\u9593\u9055\u3063\u3066\u3044\u308b\u4f4f\u6240\u3092\u90f5\u4fbf\u306e\u30eb\u30fc\u30eb\u306b\u5f93\u3063\u3066\u8a02\u6b63\u3057\u307e\u3059\u3002StrikeIron\u306f\u3001<br/>\u756a\u5730\u3001\u901a\u308a\u306e\u65b9\u89d2\u3001\u901a\u308a\u306e\u540d\u524d\u3001\u901a\u308a\u306e\u30bf\u30a4\u30d7\u3001\u90e8\u5c4b\u756a\u53f7\u3001\u304a\u3088\u3073\u79c1\u66f8\u7bb1\u3092\u691c\u67fb\u3057\u3066<br/>\u5404\u8981\u7d20\u304c\u6b63\u78ba\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3001\u90f5\u653f\u5f53\u5c40\u306e\u898f\u5247\u306b\u5f93\u3063\u3066\u4f4f\u6240\u3092\u6a19\u6e96\u5316\u3057\u307e\u3059\u3002<br/>\u307e\u305f\u3001\u901a\u308a\u306e\u540d\u524d\u306e\u30b9\u30da\u30eb\u30fb\u30df\u30b9<br/>\u3082\u8a02\u6b63\u3057\u3001\u901a\u308a\u306e\u30bf\u30a4\u30d7\u306e\u7565\u79f0\u3092\u691c\u8a3c\u3057\u3001\u90fd\u5e02\u540d\u3084\u5dde\u540d\u3092\u6a19\u6e96\u5316\u3057<br/>\u3001\u5dde\u306e\u7701\u7565\u540d\u304c\u306a\u3044\u5834\u5408\u306f\u4ed8\u52a0\u3057\u307e\u3059\u3002\u3053\u306eWeb\u30b5\u30fc\u30d3\u30b9\u306f<br/>1\u3064\u306e\u4f4f\u6240\u306b\u5bfe\u3057\u3066\u3001\u307e\u305f\u306f\u30d0\u30c3\u30c1\u51e6\u7406\u3068\u3057\u3066\u5b9f\u884c\u3067\u304d\u307e\u3059\u3002</html>

EmailVerify50_Desc=<html>StrikeIron Email Verification Web\u30b5\u30fc\u30d3\u30b9\u306f\u3001\u96fb\u5b50\u30e1\u30fc\u30eb\u30fb\u30a2\u30c9\u30ec\u30b9\u307e\u305f\u306f\u30c9\u30e1\u30a4\u30f3\u306e<br/>\u59a5\u5f53\u6027\u3092\u3059\u3050\u306b\u691c\u67fb\u3057\u307e\u3059\u3002\u96fb\u5b50\u30e1\u30fc\u30eb\u30fb\u30a2\u30c9\u30ec\u30b9\u3092\u6307\u5b9a\u3059\u308b\u3068\u3001\u96fb\u5b50\u30e1\u30fc\u30eb\u6240\u6709\u8005\u306e<br/> SMTP\u30b5\u30fc\u30d0\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3001\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u4fe1\u305b\u305a\u306b\u30a2\u30c9\u30ec\u30b9\u306e\u59a5\u5f53\u6027\u3092\u691c\u67fb\u3057\u3001<br/>True\u307e\u305f\u306fFalse\u3092\u8fd4\u3057\u307e\u3059\u3002</html>

IPAddressLookup_Desc=<html>\u3053\u306eWeb\u30b5\u30fc\u30d3\u30b9\u306f\u3001Web\u30b5\u30fc\u30d0\u30fc\u540d\u3092\u6307\u5b9a\u3059\u308b\u3068IP\u30a2\u30c9\u30ec\u30b9\u3092\u8fd4\u3057\u307e\u3059\u3002<br/>\u305f\u3068\u3048\u3070\u3001www.anywebserver.com\u3068\u6307\u5b9a\u3059\u308b\u3068256.1.1.56\u3068\u8fd4\u3057\u307e\u3059\u3002</html>

ReversePhoneLookup_Desc=<html>Reverse Phone Lookup: 90 Day Accuracy Web\u30b5\u30fc\u30d3\u30b9\u306f\u3001\u4efb\u610f\u306e\u96fb\u8a71\u756a\u53f7\u306b<br/>\u95a2\u9023\u3059\u308b\u540d\u524d\u3068\u4f4f\u6240\u306e\u30c7\u30fc\u30bf\u3078\u306e\u30d7\u30ed\u30b0\u30e9\u30e0\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3067\u3059\u3002\u4e00\u65e5\u306e\u7d42\u308f\u308a\u306b\u66f4\u65b0\u3055\u308c\u3001<br/>\u305d\u306e\u7cbe\u5ea6\u306f\u3001\u5909\u66f4\u306e90\u65e5\u4ee5\u5185\u3067\u3059\u3002</html>

SalesandUseTaxComplete50_Desc=<html>StrikeIron Tax Data Systems Sales\u3068Use Tax\u306e\u5404Web\u30b5\u30fc\u30d3\u30b9\u306f\u3001\u73fe\u5728\u306e\u6d88\u8cbb\u7a0e\u3068<br/>\u4f7f\u7528\u7a0e\u306e\u30c7\u30fc\u30bf\u3078\u306e\u30d7\u30ed\u30b0\u30e9\u30e0\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3067\u3059\u3002\u7c73\u56fd\u307e\u305f\u306f\u30ab\u30ca\u30c0\u306e\u90f5\u4fbf\u756a\u53f7\u3092\u6307\u5b9a\u3059\u308b\u3068\u3001<br/>\u305d\u306e\u756a\u53f7\u304c\u3001\u5dde\u3001\u90e1\u3001\u5e74\u3001MTA\u3001SPD\u306a\u3069\u306e\u4e00\u822c\u306e\u6d88\u8cbb\u7a0e\u7387\u3068<br/>\u4f7f\u7528\u7a0e\u7387\u306b\u3059\u3050\u306b\u7167\u5408\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u7a0e\u30c7\u30fc\u30bf\u306fXML\u30d9\u30fc\u30b9\u306e<br/>Web\u30b5\u30fc\u30d3\u30b9\u3092\u901a\u3058\u3066\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3001\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3001\u88fd\u54c1\u3001<br/>\u307e\u305f\u306fWeb\u30b5\u30a4\u30c8\u306b\u76f4\u63a5\u6700\u65b0\u72b6\u614b\u3067\u914d\u4fe1\u3055\u308c\u307e\u3059\u3002</html>

ZipCode_Desc=<html>StrikeIron ZIP Code Information Web\u30b5\u30fc\u30d3\u30b9\u306f\u3001\u7c73\u56fd\u307e\u305f\u306f\u30ab\u30ca\u30c0\u306e\u7279\u5b9a\u306e\u90f5\u4fbf\u756a\u53f7\u3092<br/>\u6307\u5b9a\u3059\u308b\u3068\u3001\u305d\u306e\u90fd\u5e02\u3001\u5dde\u3001\u90e1\u3001\u7def\u5ea6\u3001\u7d4c\u5ea6\u3001\u30bf\u30a4\u30e0\u30fb\u30be\u30fc\u30f3\u3092\u3059\u3050\u306b\u53d6\u308a\u51fa\u3057\u307e\u3059\u3002</html>

