# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.


AdvancedOption_DisplayName_WinSys=\u30a6\u30a3\u30f3\u30c9\u30a6
AdvancedOption_Tooltip_WinSys=\u30a6\u30a3\u30f3\u30c9\u30a6\u30fb\u30b7\u30b9\u30c6\u30e0\u95a2\u9023\u306e\u30aa\u30d7\u30b7\u30e7\u30f3

IsAlphaFloatingTooltip=\u30d5\u30a9\u30fc\u30ab\u30b9\u3055\u308c\u3066\u3044\u306a\u3044\u30d5\u30ed\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6\u3092\u6570\u79d2\u5f8c\u306b\u534a\u900f\u660e\u306b\u3057\u307e\u3059

IsDragWindowTooltip=\u30a6\u30a3\u30f3\u30c9\u30a6\u306e\u30c9\u30e9\u30c3\u30b0\u30fb\u30a2\u30f3\u30c9\u30fb\u30c9\u30ed\u30c3\u30d7\u4e2d\u306b"\u30b4\u30fc\u30b9\u30c8"\u30a6\u30a3\u30f3\u30c9\u30a6\u30fb\u30a4\u30e1\u30fc\u30b8\u3092\u6709\u52b9\u306b\u3057\u307e\u3059
IsAlphaDragTooltip=\u30c9\u30e9\u30c3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6\u30fb\u30a4\u30e1\u30fc\u30b8\u306e\u900f\u660e\u5316\u3092\u6709\u52b9\u306b\u3057\u307e\u3059

IsSnapScreenEdgesTooltip=\u30d5\u30ed\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6\u306e\u753b\u9762\u306e\u7aef\u3078\u306e\u30b9\u30ca\u30c3\u30d7\u3092\u6709\u52b9\u306b\u3057\u307e\u3059
IsSnappingTooltip=\u30ec\u30a4\u30a2\u30a6\u30c8\u3092\u51e6\u7406\u3057\u3084\u3059\u3044\u3088\u3046\u306b\u30d5\u30ed\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6\u306e\u81ea\u52d5\u30b9\u30ca\u30c3\u30d7\u3092\u6709\u52b9\u306b\u3057\u307e\u3059

NoAlphaSupport=\u30a6\u30a3\u30f3\u30c9\u30a6\u306e\u900f\u660e\u5316\u306fOS\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
LBL_DragWindowImage=\u30c9\u30e9\u30c3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6\u30fb\u30a4\u30e1\u30fc\u30b8(&D)
LBL_TransparentDragWindow=\u900f\u660e\u30c9\u30e9\u30c3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6\u30fb\u30a4\u30e1\u30fc\u30b8(&W)
LBL_TransparentFloatingWindows=\u900f\u660e\u30d5\u30ed\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6(&F)
LBL_SnapFloatingWindows=\u30d5\u30ed\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6\u3092\u30b9\u30ca\u30c3\u30d7(&S)
LBL_SnapToScreenEdges=\u753b\u9762\u306e\u7aef\u306b\u30b9\u30ca\u30c3\u30d7(&E)
LBL_CloseActivatesRecentDocument=\u300c\u9589\u3058\u308b\u300d\u3067\u6700\u65b0\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u30a2\u30af\u30c6\u30a3\u30d6\u5316(&C)
OptionsCategory_Keywords_Appearance=\u30eb\u30c3\u30af\u30fb\u30a2\u30f3\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb\u3001\u30a6\u30a3\u30f3\u30c9\u30a6\u3001\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u30fb\u30bf\u30d6
OptionsCategory_Name_Appearance=\u5916\u89b3
TIP_CloseActivatesMostRecentDocument=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u9589\u3058\u308b\u3068\u3001\u96a3\u63a5\u3059\u308b\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3067\u306f\u306a\u304f\u3001\u6700\u65b0\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u306a\u308a\u307e\u3059

KW_WindowOptions=\u30a6\u30a3\u30f3\u30c9\u30a6\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3,\u5916\u89b3,\u30a8\u30c7\u30a3\u30bf\u306e\u30bf\u30d6\u914d\u7f6e,\u8907\u6570\u884c\u30bf\u30d6,\u30a6\u30a3\u30f3\u30c9\u30a6\u30fb\u30c9\u30e9\u30c3\u30b0,\u30d5\u30ed\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30a6\u30a3\u30f3\u30c9\u30a6,\u30eb\u30c3\u30af\u30fb\u30a2\u30f3\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb


Hint_RESTART_IDE=IDE\u306e\u518d\u8d77\u52d5
Descr_Restart=<html><a href="#">\u3053\u3053\u3092\u30af\u30ea\u30c3\u30af\u3057\u3001IDE\u3092\u518d\u8d77\u52d5\u3057\u3001\u9078\u629e\u3057\u305f\u30eb\u30c3\u30af\u30fb\u30a2\u30f3\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb\u3092\u9069\u7528\u3057\u307e\u3059\u3002
Hint_ChangeEditorColors=\u4e00\u81f4\u3059\u308b\u30a8\u30c7\u30a3\u30bf\u306e\u8272\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u5207\u308a\u66ff\u3048\u307e\u3059\u3002
LafPanel.lblLaf.text=\u512a\u5148\u30eb\u30c3\u30af\u30fb\u30a2\u30f3\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb(&P):
LafPanel.lblRestart.text=(\u518d\u8d77\u52d5\u304c\u5fc5\u8981)
LafPanel.checkMaximizeNativeLaF.toolTipText=<html>\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u5341\u5206\u306a\u6a5f\u80fd\u3092\u63d0\u4f9b\u3059\u308b\u306e\u3067\u3001NetBeans\u3067\u306f\u30cd\u30a4\u30c6\u30a3\u30d6\u306eUI\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\n<br>\u6a5f\u80fd\u306b\u5236\u9650\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u5834\u5408\u3067\u3082(\u305f\u3068\u3048\u3070\u3001\u6a19\u6e96\u306eMac OS\u30d5\u30a1\u30a4\u30eb\u30fb\u30c1\u30e5\u30fc\u30b6)\n\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u5f37\u5236\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3057\u307e\u3059\u3002
LafPanel.checkMaximizeNativeLaF.text=\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30eb\u30c3\u30af\u30fb\u30a2\u30f3\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb\u306e\u4f7f\u7528\u3092\u6700\u5927\u5316(&A)
TabsPanel.checkMultiRow.text=\u8907\u6570\u884c\u30bf\u30d6(&M)
TabsPanel.radioBottom.text=\u4e0b(&B)
TabsPanel.radioTop.text=\u4e0a(&T)
TabsPanel.radioRight.text=\u53f3(&R)
TabsPanel.radioLeft.text=\u5de6(&L)
TabsPanel.isNewDocumentOpensNextToActiveTab.text=\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u30fb\u30bf\u30d6\u306e\u6a2a\u306b\u65b0\u898f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304c\u958b\u304f(&N)
TabsPanel.isCloseActivatesMostRecentDocument.AccessibleContext.accessibleDescription=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u9589\u3058\u308b\u3068\u3001\u6700\u65b0\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u306a\u308a\u307e\u3059
TabsPanel.jLabel1.text=\u30bf\u30d6\u914d\u7f6e:

Laf_DisplayName=\u30eb\u30c3\u30af\u30fb\u30a2\u30f3\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb
KW_LafOptions=\u30eb\u30c3\u30af,\u30d5\u30a3\u30fc\u30eb,\u30eb\u30c3\u30af\u30fb\u30a2\u30f3\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb
KW_TabsOptions=\u30a8\u30c7\u30a3\u30bf\u30fb\u30bf\u30d6,\u8907\u6570\u884c
Tabs_DisplayName=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u30fb\u30bf\u30d6

