# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

MON_Deploy_first=\u0412\u041d\u0418\u041c\u0410\u041d\u0418\u0415! \u0424\u0438\u043b\u044c\u0442\u0440 \u043c\u043e\u043d\u0438\u0442\u043e\u0440\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u043f\u0435\u0440\u0432\u044b\u043c \u0432 \u0446\u0435\u043f\u043e\u0447\u043a\u0435.
MON_Warning_attributes=\u0412\u041d\u0418\u041c\u0410\u041d\u0418\u0415! \u042d\u0442\u043e\u0442 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0441\u0442\u0430\u043b \u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u043c.
MON_Warning_toString_null=\u0412\u041d\u0418\u041c\u0410\u041d\u0418\u0415! \u0412\u044b\u0437\u0432\u0430\u043d\u043d\u044b\u0439 \u0434\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u043c\u0435\u0442\u043e\u0434 toString() \u0432\u043e\u0437\u0432\u0440\u0430\u0442\u0438\u043b \u043d\u0443\u043b\u044c
MON_Warning_toString_exception=\u0412\u041d\u0418\u041c\u0410\u041d\u0418\u0415! \u0412\u044b\u0437\u0432\u0430\u043d\u043d\u044b\u0439 \u0434\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u043c\u0435\u0442\u043e\u0434 toString() \u043f\u0435\u0440\u0435\u0434\u0430\u043b \u0438\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435
MON_Rethrow=\u041f\u0440\u0438 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0435 JSP \u0438\u043b\u0438 \u0441\u0435\u0440\u0432\u043b\u0435\u0442\u0430 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 "\u041c\u043e\u043d\u0438\u0442\u043e\u0440 HTTP" \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0435 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u043f\u0435\u0440\u0435\u0445\u0432\u0430\u0442\u0438\u043b \u0438 \u043f\u0435\u0440\u0435\u0434\u0430\u043b \u043e\u0448\u0438\u0431\u043a\u0443. \u0414\u043b\u044f \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u044f \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u044b \u043e\u0437\u043d\u0430\u043a\u043e\u043c\u044c\u0442\u0435\u0441\u044c \u0441 \u0434\u0430\u043d\u043d\u044b\u043c\u0438 \u0442\u0440\u0430\u0441\u0441\u0438\u0440\u043e\u0432\u043a\u0438 \u043f\u043e\u0434 \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0435\u043c \u043e\u0431 \u043e\u0441\u043d\u043e\u0432\u043d\u043e\u0439 \u043f\u0440\u0438\u0447\u0438\u043d\u0435.
MON_overflow=\n\n\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 "\u041c\u043e\u043d\u0438\u0442\u043e\u0440 HTTP" \u043d\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u0435 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u043e\u0431\u043d\u0430\u0440\u0443\u0436\u0438\u043b \u043e\u0448\u0438\u0431\u043a\u0443 java.lang.StackOverflowError.\n\u0422\u0430\u043a\u0430\u044f \u043e\u0448\u0438\u0431\u043a\u0430 \u043f\u043e\u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043f\u0440\u0438 \u0432\u043e\u0437\u043d\u0438\u043a\u043d\u043e\u0432\u0435\u043d\u0438\u0438 \u0432 \u0432\u0435\u0431-\u043c\u043e\u0434\u0443\u043b\u0435 \u0431\u0435\u0441\u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0433\u043e \u0446\u0438\u043a\u043b\u0430.\n\u041f\u0435\u0440\u0435\u0434 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u0437\u0430\u043f\u0443\u0441\u043a\u043e\u043c \u0432\u0435\u0431-\u043c\u043e\u0434\u0443\u043b\u044f \u0443\u0434\u0430\u043b\u0438\u0442\u0435 \u043f\u0440\u0438\u0447\u0438\u043d\u0443 \u0431\u0435\u0441\u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0433\u043e \u0446\u0438\u043a\u043b\u0430.\n\n
MON_Unknown_exit_status=\u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0438\u0442\u044c
MON_Warning_disabled_monitor=\u0412\u041d\u0418\u041c\u0410\u041d\u0418\u0415! *********** \u041c\u043e\u043d\u0438\u0442\u043e\u0440 HTTP NetBeans ************\n\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u0437\u0430\u043f\u0440\u043e\u0441. \u0412\u043e\u0437\u043c\u043e\u0436\u043d\u0430\u044f \u043f\u0440\u0438\u0447\u0438\u043d\u0430: \u043e\u0442\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435 \u043c\u043e\u043d\u0438\u0442\u043e\u0440\u0430 HTTP NetBeans.
MON_Warning_httpserver_problem=\u0412\u041d\u0418\u041c\u0410\u041d\u0418\u0415! *********** \u041c\u043e\u043d\u0438\u0442\u043e\u0440 HTTP NetBeans ************\n\u041d\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u0437\u0430\u043f\u0440\u043e\u0441\u044b HTTP. \u0412\u043e\u0437\u043c\u043e\u0436\u043d\u0430\u044f \u043f\u0440\u0438\u0447\u0438\u043d\u0430: \u0441\u0435\u0440\u0432\u0435\u0440 HTTP NetBeans \u043d\u0435 \u0437\u0430\u043f\u0443\u0449\u0435\u043d. \u0414\u043b\u044f \u0443\u0441\u0442\u0440\u0430\u043d\u0435\u043d\u0438\u044f \u043d\u0435\u043f\u043e\u043b\u0430\u0434\u043a\u0438 \u043f\u0435\u0440\u0435\u0439\u0434\u0438\u0442\u0435 \u0432 \u0441\u0440\u0435\u0434\u0443 IDE \u0438 \u0437\u0430\u043f\u0443\u0441\u0442\u0438\u0442\u0435 \u0441\u0435\u0440\u0432\u0435\u0440 \u0438\u0437 \u0441\u0440\u0435\u0434\u044b IDE.

