# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

MSG_SampleNotSupported=\u30b5\u30f3\u30d7\u30eb\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093: \u30b5\u30f3\u30d7\u30eb"{0}"\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
MSG_CreatingSampleDBProgressLabel=MySQL\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9{0}\u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059
MSG_TestFailed=MySQL\u306e\u63a5\u7d9a\u304c\u6709\u52b9\u304b\u3069\u3046\u304b\u306e\u30c6\u30b9\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
MSG_ConnectionLost=MySQL\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u304c\u5931\u308f\u308c\u307e\u3057\u305f\u3002\u63a5\u7d9a\u306f\u30bf\u30a4\u30e0\u30fb\u30a2\u30a6\u30c8\u306b\u306a\u3063\u305f\u304b\u3001\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u63a5\u7d9a\u304c\u5931\u308f\u308c\u305f\u304b\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u505c\u6b62\u3055\u308c\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
MSG_QueryReconnect=\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u518d\u63a5\u7d9a\u3092\u8a66\u3057\u307e\u3059\u304b?
MSG_ServerNoLongerRunning=MySQL\u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u505c\u6b62\u3055\u308c\u305f\u304b\u3001\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u63a5\u7d9a\u304c\u5931\u308f\u308c\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u3092\u78ba\u8a8d\u3057\u3001\u5fc5\u8981\u306b\u5fdc\u3058\u3066\u518d\u8d77\u52d5\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_ServerStillRunning=\u505c\u6b62\u30b3\u30de\u30f3\u30c9\u304c\u6210\u529f\u3057\u306a\u304b\u3063\u305f\u304b\u3001\u5b8c\u4e86\u3057\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002MySQL\u30b5\u30fc\u30d0\u30fc\u304c\u307e\u3060\u5b9f\u884c\u4e2d\u306e\u3088\u3046\u3067\u3059\u3002\u30b5\u30fc\u30d0\u30fc\u304c\u307e\u3060\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u4e2d\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u505c\u6b62\u30b3\u30de\u30f3\u30c9\u306e\u8a2d\u5b9a\u3092\u8abf\u6574\u3059\u308b\u304b\u3001\u624b\u52d5\u3067\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n\n\u30b5\u30fc\u30d0\u30fc\u304c\u8d77\u52d5\u3059\u308b\u306e\u3092\u5f85\u3061\u307e\u3059\u304b\u3001\u305d\u308c\u3068\u3082\u505c\u6b62\u30b3\u30de\u30f3\u30c9\u306e\u8a2d\u5b9a\u3092\u7de8\u96c6\u3057\u307e\u3059\u304b?
MSG_ConnectFailedAfterStart=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u5f8c\u3001\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093: {0}\u3002
MSG_DatabaseCommandFailed=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30b3\u30de\u30f3\u30c9{0}\u304c\u6b21\u306e\u4f8b\u5916\u3067\u5931\u6557\u3057\u307e\u3057\u305f: {1}
MSG_InvalidPortNumber=\u7121\u52b9\u306a\u30dd\u30fc\u30c8\u756a\u53f7{0}\u3002MySQL\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u7de8\u96c6\u3057\u3066\u30dd\u30fc\u30c8\u756a\u53f7\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_UnknownHost=\u4e0d\u660e\u306a\u30db\u30b9\u30c8{0}\u3002\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u304c\u505c\u6b62\u3057\u3066\u3044\u308b\u304b\u3001\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d\u3092\u8a2d\u5b9a\u3057\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
MSG_StartingMySQL=MySQL\u30b5\u30fc\u30d0\u30fc\u3092\u8d77\u52d5\u3057\u3066\u3044\u307e\u3059...
MSG_StoppingMySQL=MySQL\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3057\u3066\u3044\u307e\u3059...
MSG_ReconnectFailed=MySQL\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093:\n\n{0}\u3002\n\n\u30b5\u30fc\u30d0\u30fc\u304c\u8d77\u52d5\u3057\u3066\u3044\u306a\u3044\u304b\u3001MySQL\u306e\u63a5\u7d9a\u30d7\u30ed\u30d1\u30c6\u30a3\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002MySQL\u306e\u63a5\u7d9a\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u7de8\u96c6\u3057\u307e\u3059\u304b?
MSG_ServerDoesNotAppearToHaveStarted=\u8d77\u52d5\u5f8c\u3001MySQL\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093: {0}\u3002\n\n\u307e\u3060\u8d77\u52d5\u4e2d\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u8d77\u52d5\u30b3\u30de\u30f3\u30c9\u306e\u8a2d\u5b9a\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u63a5\u7d9a\u8a2d\u5b9a\u3092\u5909\u66f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\nMySQL\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u7de8\u96c6\u3057\u307e\u3059\u304b? \u307e\u305f\u306f\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u3092\u3053\u306e\u307e\u307e\u5f85\u3061\u307e\u3059\u304b?
MSG_UnableToReconnectServerNotRunning=MySQL\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u69cb\u6210\u3057\u305f\u30db\u30b9\u30c8({0})\u304a\u3088\u3073\u30dd\u30fc\u30c8({1})\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u4e2d\u3067\u3042\u308b\u3053\u3068\u3001\u304a\u3088\u3073\u69cb\u6210\u8a2d\u5b9a\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_ReconnectingToMySQL=MySQL\u30b5\u30fc\u30d0\u30fc\u306b\u518d\u63a5\u7d9a\u3057\u3066\u3044\u307e\u3059
MSG_WaitingForServerToStart=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u3092\u5f85\u3063\u3066\u3044\u307e\u3059
MSG_WaitingForServerToStop=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u505c\u6b62\u3092\u5f85\u3063\u3066\u3044\u307e\u3059
MSG_CantStartServerIsAlreadyRunning=MySQL\u30b5\u30fc\u30d0\u30fc\u304c\u8d77\u52d5\u3067\u304d\u307e\u305b\u3093\u3002\u30db\u30b9\u30c8{0}\u3001\u30dd\u30fc\u30c8{1}\u3067\u3059\u3067\u306b\u5b9f\u884c\u3057\u3066\u3044\u307e\u3059\u3002\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u3092\u8a66\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002\u5225\u306e\u30d7\u30ed\u30bb\u30b9\u304c\u30dd\u30fc\u30c8\u3067\u5f85\u6a5f\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u3082\u3042\u308a\u307e\u3059\u3002
MSG_CheckStart=MySQL\u306e\u8d77\u52d5\u8a2d\u5b9a\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002\u4eca\u3059\u3050\u30b5\u30fc\u30d0\u30fc\u3092\u8d77\u52d5\u3057\u307e\u3059\u304b?
MSG_UnableToStopServer=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u505c\u6b62\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
MSG_UnableToStartServer=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
MSG_NoSampleWithoutInnoDB=\u3053\u306e\u30b5\u30f3\u30d7\u30eb\u306fInnoDB\u30b9\u30c8\u30ec\u30fc\u30b8\u30fb\u30a8\u30f3\u30b8\u30f3\u304c\u5fc5\u8981\u3067\u3059\u304c\u3001\u3053\u306e\u30a8\u30f3\u30b8\u30f3\u306f\u30b5\u30fc\u30d0\u30fc\u3067\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002InnoDB\u3092\u6709\u52b9\u306b\u3057\u518d\u5ea6\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotifyMultipleInstallations.text=\u4f7f\u7528\u3059\u308b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3092\u9078\u629e\u3057\u307e\u3059
NotifyMultipleInstallations.title=\u8907\u6570\u306eMySQL\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
StartManager.CancelButton=\u53d6\u6d88
StartManager.CancelButtonA11yDesc=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u3092\u53d6\u6d88\u3057
StartManager.KeepWaitingButton=\u5f85\u6a5f
StartManager.KeepWaitingButtonA11yDesc=\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u3092\u5f85\u6a5f\u3057\u3066\u3044\u307e\u3059
StartManager.PropsButton=MySQL\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u7de8\u96c6
StartManager.PropsButtonA11yDesc=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u30b3\u30de\u30f3\u30c9\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u7de8\u96c6\u3057\u307e\u3059
StartManager.ServerNotRunningTitle=MySQL\u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u307e\u305b\u3093

StopManager.CancelButton=\u53d6\u6d88
StopManager.CancelButtonA11yDesc=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u505c\u6b62\u3092\u53d6\u6d88\u3057\u307e\u3059
StopManager.KeepWaitingButton=\u5f85\u6a5f
StopManager.KeepWaitingButtonA11yDesc=\u30b5\u30fc\u30d0\u30fc\u306e\u505c\u6b62\u3092\u5f85\u6a5f\u3057\u3066\u3044\u307e\u3059
StopManager.PropsButton=\u505c\u6b62\u30b3\u30de\u30f3\u30c9\u3092\u7de8\u96c6
StopManager.PropsButtonA11yDesc=MySQL\u30b5\u30fc\u30d0\u30fc\u306e\u505c\u6b62\u30b3\u30de\u30f3\u30c9\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u7de8\u96c6\u3057\u307e\u3059
StopManager.ServerStillRunningTitle=MySQL\u30b5\u30fc\u30d0\u30fc\u304c\u307e\u3060\u5b9f\u884c\u4e2d\u3067\u3059

MSG_UnableToConnect=\u30e6\u30fc\u30b6\u30fc{1}\u306e{0}\u3078\u306e\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093
MySQLOptions_AdminPassword=\u767b\u9332\u3055\u308c\u3066\u3044\u308bMySQL Server\u306e\u7ba1\u7406\u30d1\u30b9\u30ef\u30fc\u30c9

