# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

#Question to show user to find out whether start second instance of NetBeans  or not
MSG_AlreadyRunning=Une instance du programme semble d\u00e9j\u00e0 en cours d'ex\u00e9cution dans votre r\u00e9pertoire utilisateur.\nSoit une session pr\u00e9c\u00e9dente du programme ne s'est pas termin\u00e9e correctement, soit une autre instance\ndu programme est ex\u00e9cut\u00e9e sur un autre ordinateur et utilise le m\u00eame r\u00e9pertoire utilisateur.\n\nSi une autre session du programme est ex\u00e9cut\u00e9e avec le m\u00eame r\u00e9pertoire utilisateur, cliquez sur\nAnnuler pour \u00e9viter d'endommager le r\u00e9pertoire utilisateur. Si vous \u00eates s\u00fbr qu'aucune autre\ninstance du programme n'est ex\u00e9cut\u00e9e avec votre r\u00e9pertoire utilisateur, cliquez sur OK pour continuer.
MSG_AlreadyRunningTitle=Avertissement
MSG_CannotWrite=Une instance du programme ne peut pas acc\u00e9der au r\u00e9pertoire utilisateur indiqu\u00e9.\nIl s''agit d''un probl\u00e8me grave qui peut emp\u00eacher le fonctionnement correct du programme.\nAssurez-vous que {0} est accessible en \u00e9criture.\n\nCliquez sur OK pour continuer malgr\u00e9 l''erreur pr\u00e9c\u00e9dente.
MSG_CannotWriteTitle=Avertissement

EXC_not_a_module={0} n''est pas un module NetBeans valide.

# bootstrap manifest
OpenIDE-Module-Name=Bootstrap
OpenIDE-Module-Display-Category=Infrastructure
OpenIDE-Module-Short-Description=Op\u00e9ration Bootstrap principale des applications NetBeans.
OpenIDE-Module-Long-Description=Ce module fournit l'infrastructure initiale qui charge toutes les autres parties de l'application. Il ne peut pas \u00eatre d\u00e9sactiv\u00e9.

MSG_InstallJava7=Son ex\u00e9cution est impossible sur les versions ant\u00e9rieures \u00e0 Java 7 Standard Edition.\nInstallez Java 7 Standard Edition ou une version ult\u00e9rieure, ou utilisez le commutateur\n--jdkhome pour sp\u00e9cifier son r\u00e9pertoire d'installation.
MSG_NeedsJava7=Java 7 Standard Edition ou version ult\u00e9rieure requise

