# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

#Question to show user to find out whether start second instance of NetBeans  or not
MSG_AlreadyRunning=\ud504\ub85c\uadf8\ub7a8\uc758 \uc778\uc2a4\ud134\uc2a4\uac00 \uc0ac\uc6a9\uc790 \ub514\ub809\ud1a0\ub9ac\uc5d0\uc11c \uc774\ubbf8 \uc2e4\ud589 \uc911\uc77c \uc218 \uc788\uc2b5\ub2c8\ub2e4.\n\ud504\ub85c\uadf8\ub7a8\uc758 \uc774\uc804 \uc138\uc158\uc774 \uc62c\ubc14\ub974\uac8c \uc885\ub8cc\ud558\uc9c0 \uc54a\uc558\uac70\ub098, \ud504\ub85c\uadf8\ub7a8\uc758 \ub2e4\ub978 \uc778\uc2a4\ud134\uc2a4\uac00\n\ub2e4\ub978 \ucef4\ud4e8\ud130\uc5d0\uc11c \uc2e4\ud589\ub418\uace0 \uc788\uc73c\uba70 \ub3d9\uc77c\ud55c \uc0ac\uc6a9\uc790 \ub514\ub809\ud1a0\ub9ac\ub97c \uc0ac\uc6a9\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.\n\n\ud504\ub85c\uadf8\ub7a8\uc758 \ub2e4\ub978 \uc138\uc158\uc774 \ub3d9\uc77c\ud55c \uc0ac\uc6a9\uc790 \ub514\ub809\ud1a0\ub9ac\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \uacbd\uc6b0\n\uc0ac\uc6a9\uc790 \ub514\ub809\ud1a0\ub9ac\uac00 \uc190\uc0c1\ub418\uc9c0 \uc54a\ub3c4\ub85d \ucde8\uc18c\ub97c \ud074\ub9ad\ud558\uc2ed\uc2dc\uc624. \uc0ac\uc6a9\uc790 \ub514\ub809\ud1a0\ub9ac\uc5d0\uc11c \uc2e4\ud589 \uc911\uc778 \ub2e4\ub978 \uc778\uc2a4\ud134\uc2a4\uac00\n\ud504\ub85c\uadf8\ub7a8\uc5d0 \uc5c6\ub294 \uacbd\uc6b0 \ud655\uc778\uc744 \ud074\ub9ad\ud558\uc5ec \uacc4\uc18d\ud558\uc2ed\uc2dc\uc624.
MSG_AlreadyRunningTitle=\uacbd\uace0
MSG_CannotWrite=\ud504\ub85c\uadf8\ub7a8\uc758 \uc778\uc2a4\ud134\uc2a4\uac00 \uc9c0\ubaa9\ub41c \uc720\uc800 \ub514\ub809\ud1a0\ub9ac\ub97c \uc811\uadfc\ud560 \uc218 \uc5c6\uc74c.\n\uc774\uac83\uc740 \ud504\ub85c\uadf8\ub7a8\uc758 \uae30\ub2a5\uc744 \uc81c\ub300\ub85c \ud558\uc9c0\ubabb\ud558\uac8c \ub9cc\ub4dc\ub294 \uc2ec\uac01\ud55c \ubb38\uc81c\uc785\ub2c8\ub2e4.\n{0} \uc77d\uae30 \uc804\uc6a9\uc774 \uc544\ub2cc\uc9c0 \ud655\uc2e4\ud788 \ud558\uc2ed\uc2dc\uc694.\n\n \uc774\uc804\uc758 \uc5d0\ub7ec\uac00 \uc788\uc74c\uc5d0\ub3c4 \ubd88\uad6c\ud558\uace0 \uacc4\uc18d\ud558\ub824\uba74 \ud655\uc778\uc744 \ud074\ub9ad\ud558\uc5ec \uc8fc\uc138\uc694.
MSG_CannotWriteTitle=\uacbd\uace0

EXC_not_a_module={0}\uc740(\ub294) \uc720\ud6a8\ud55c NetBeans \ubaa8\ub4c8\uc774 \uc544\ub2d9\ub2c8\ub2e4.

# bootstrap manifest
OpenIDE-Module-Name=\ubd80\ud2b8\uc2a4\ud2b8\ub7a9
OpenIDE-Module-Display-Category=\uc778\ud504\ub77c\uc2a4\ud2b8\ub7ed\ucc98
OpenIDE-Module-Short-Description=NetBeans \uae30\ubc18 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc758 \ucf54\uc5b4 \ubd80\ud2b8\uc2a4\ud2b8\ub7a9\uc785\ub2c8\ub2e4.
OpenIDE-Module-Long-Description=\uc774 \ubaa8\ub4c8\uc5d0\uc11c\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc758 \ub2e4\ub978 \ubaa8\ub4e0 \ubd80\ubd84\uc744 \ub85c\ub4dc\ud558\ub294 \ucd08\uae30 \uc778\ud504\ub77c\ub97c \uc81c\uacf5\ud569\ub2c8\ub2e4. \ube44\ud65c\uc131\ud654\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

MSG_InstallJava6=\uc790\ubc14 6 \uc2a4\ud0e0\ub2e4\ub4dc \uc5d0\ub514\uc158\ubcf4\ub2e4 \uad6c \ubc84\uc804\uc758 \uc790\ubc14\uc5d0\uc11c\ub294 \uc2e4\ud589\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.\uc790\ubc146 \uc2a4\ud0e0\ub2e4\ub4dc \uc5d0\ub514\uc158 \ud639\uc740 \uadf8 \uc774\uc0c1 \ubc84\uc804\uc744 \uc124\uce58\ud558\uac70\ub098 \ud574\ub2f9 \ubc84\uc804\uc774 \uc124\uce58\ub41c \ud3f4\ub354\ub85c \ubc14\uafd4 \uc2e4\ud589\ud558\ub824\uba74 --jdkhome\n \uc744 \uc0ac\uc6a9\ud558\uc2dc\uae30 \ubc14\ub78d\ub2c8\ub2e4
MSG_NeedsJava6=\uc790\ubc14 6 \uc2a4\ud0e0\ub2e4\ub4dc \uc5d0\ub514\uc158\uc774\uac70\ub098 \ud639\uc740 \uadf8 \uc774\uc0c1 \ud544\uc218

