# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 2009-2011 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.
#
# Contributor(s):
#
# Portions Copyrighted 2009-2010 Sun Microsystems, Inc.

MSG_SampleNotSupported=Impossible de cr\u00e9er l''exemple: l''exemple "{0}" n''est pas pris en charge
MSG_CreatingSampleDBProgressLabel=Cr\u00e9ation de la base de donn\u00e9es MySQL {0}
MSG_TestFailed=Le test pour v\u00e9rifier que la connexion \u00e0 MySQL est valide a \u00e9chou\u00e9: {0}
MSG_ConnectionLost=La connexion au serveur MySQL a \u00e9t\u00e9 perdue.  La connexion peut avoir expir\u00e9 (time out), la connexion r\u00e9seau peut avoir \u00e9t\u00e9 perdue ou le serveur peut avoir \u00e9t\u00e9 \u00e9teint.
MSG_QueryReconnect=Voulez-vous essayer de vous reconnecter au serveur?
MSG_ServerNoLongerRunning=Le serveur MySQL semble ne plus s'ex\u00e9cuter.  Il peut avoir \u00e9t\u00e9 arr\u00eat\u00e9 ou la connexion r\u00e9seau a peut-\u00eatre \u00e9t\u00e9 perdue.  Veuillez v\u00e9rifier l'\u00e9tat du serveur MySQL et le red\u00e9marrer si n\u00e9cessaire.
MSG_ServerStillRunning=On dirait que la commande stop n'a pas abouti correctement ou ne s'est pas termin\u00e9e car le serveur MySQL semble toujours s'ex\u00e9cuter.  Soit le serveur est encore dans sa proc\u00e9dure d'arr\u00eat, soit vous devez modifier les param\u00e8tres de la commande stop, soit il vous faudra arr\u00eater le serveur manuellement.\n\nVoulez-vous continuer \u00e0 attendre le d\u00e9marrage du serveur ou \u00e9diter vos param\u00e8tres pour la commande stop?
MSG_ConnectFailedAfterStart=Impossible de se connecter au serveur MySQL apr\u00e8s l'avoir d\u00e9marr\u00e9: {0}.
MSG_DatabaseCommandFailed=The database command {0} failed with the following exception: {1}
MSG_InvalidPortNumber=Num\u00e9ro de port invalide: {0}.  Veuillez \u00e9diter les propri\u00e9t\u00e9s MySQL et changer le num\u00e9ro de port.
MSG_UnknownHost=H\u00f4te {0} inconnu.  Le r\u00e9seau peut ne pas fonctionner, ou vous avez  d\u00e9fini le nom d'h\u00f4te \u00e0 une valeur invalide.
MSG_StartingMySQL=D\u00e9marrage du serveur MySQL...
MSG_StoppingMySQL=Arr\u00eat du serveur MySQL...
MSG_ReconnectFailed=Impossible de se connecter au serveur MySQL:\n\n{0}.\n\nLe serveur n'est peut-\u00eatre pas en cours d'ex\u00e9cution, ou vos propri\u00e9t\u00e9s de connexion MySQL ne sont pas d\u00e9finies correctement.  Voulez-vous \u00e9diter vos propri\u00e9t\u00e9s de connexion \u00e0 MySQL?
MSG_ServerDoesNotAppearToHaveStarted=Impossible de se connecter au serveur MySQL apr\u00e8s le d\u00e9marrage: {0}.\n\nIl est peut-\u00eatre encore en train de d\u00e9marrer, sinon il vous faut peut-\u00eatre changer vos param\u00e8tres pour la commande start ou vos param\u00e8tres de connexion.\n\nVoulez-vous \u00e9diter les propri\u00e9t\u00e9s MySQL ou continuer \u00e0 attendre que le serveur d\u00e9marre?
MSG_UnableToReconnectServerNotRunning=Impossible de se connecter au serveur MySQL car il ne semble pas en cours d'ex\u00e9cution sur l'h\u00f4te configur\u00e9 ({0}) et le port ({1}).  V\u00e9rifiez que le serveur est en cours d'ex\u00e9cution et que vos param\u00e8tres de configuration sont corrects.
MSG_ReconnectingToMySQL=Reconnexion au serveur MySQL
MSG_WaitingForServerToStart=Attente du d\u00e9marrage du serveur MySQL
MSG_WaitingForServerToStop=Attente de l'arr\u00eat du serveur MySQL
MSG_CantStartServerIsAlreadyRunning=Impossible de d\u00e9marrer le serveur MySQL: il semble d\u00e9j\u00e0 en cours d''ex\u00e9cution sur l''h\u00f4te {0}, port {1}.  Essayez de vous connecter au serveur. Il est aussi possible qu'un autre processus \u00e9coute sur ce port.
MSG_CheckStart=Les param\u00e8tres pour le d\u00e9marrage de MySQL ont chang\u00e9.  Voulez-vous d\u00e9marrer le serveur maintenant?
MSG_UnableToStopServer=Une erreur s'est produite en essayant d'arr\u00eater le serveur MySQL
MSG_UnableToStartServer=Une erreur s'est produite en essayant de d\u00e9marrer le serveur MySQL
MSG_NoSampleWithoutInnoDB=L'exemple requiert le moteur de stockage InnoDB, et ce moteur n'est pas activ\u00e9 sur le serveur.  Activez InnoDB et r\u00e9essayez.
StartManager.CancelButton=Annuler
StartManager.CancelButtonA11yDesc=Annuler le d\u00e9marrage du serveur MySQL
StartManager.KeepWaitingButton=Continuer d'attendre
StartManager.KeepWaitingButtonA11yDesc=Continuer d'attendre le d\u00e9marrage du serveur
StartManager.PropsButton=\u00c9diter les Propri\u00e9t\u00e9s MySQL
StartManager.PropsButtonA11yDesc=\u00c9diter la propri\u00e9t\u00e9 de la commande start du serveur MySQL.
StartManager.ServerNotRunningTitle=Le serveur MySQL n'est pas en cours d'ex\u00e9cution

StopManager.CancelButton=Annuler
StopManager.CancelButtonA11yDesc=Annuler l'arr\u00eat du serveur MySQL
StopManager.KeepWaitingButton=Continuer d'attendre
StopManager.KeepWaitingButtonA11yDesc=Continuer d'attendre l'arr\u00eat du serveur
StopManager.PropsButton=\u00c9diter la commande stop
StopManager.PropsButtonA11yDesc=\u00c9diter la propri\u00e9t\u00e9 de la commande stop du serveur MySQL
StopManager.ServerStillRunningTitle=Le serveur MySQL est toujours en cours d'ex\u00e9cution

MSG_UnableToConnect=Impossible d'\u00e9tablir une connexion avec {0} pour l''utilisateur {1}
MySQLOptions_AdminPassword=Mot de passe admin pour le serveur MySQL enregistr\u00e9

