# This module is part of NetBeans and is open-source.
# You can see http://www.netbeans.org/about/legal/index.html for details.
#
# You may use the binary however you like. The source file license is:
#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2007 Sun
# Microsystems, Inc. All Rights Reserved.

# Sample ResourceBundle properties file
Binaries_Provider_Name=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304a\u3088\u3073\u5b9f\u884c\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u3092\u89e3\u6790
Binaries_Provider_Description=\u691c\u51fa\u6a5f\u80fd\u306f\u3001\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u4ed8\u3051\u3066\u30d3\u30eb\u30c9\u3055\u308c\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u307e\u305f\u306f\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u60c5\u5831\u3092\u89e3\u6790\u3057\u307e\u3059\u3002\nGNU\u30b3\u30f3\u30d1\u30a4\u30e9\u306e\u5834\u5408\u306f\u30b3\u30f3\u30d1\u30a4\u30eb\u30fb\u30d5\u30e9\u30b0\u306e"-g3 -gdwarf-2"\u3092\u4ed8\u3051\u3066\u304f\u3060\u3055\u3044\u3002\nSun\u30b3\u30f3\u30d1\u30a4\u30e9\u306e\u5834\u5408\u306f\u30b3\u30f3\u30d1\u30a4\u30eb\u30fb\u30d5\u30e9\u30b0\u306e"-g"\u3092\u4ed8\u3051\u3066\u304f\u3060\u3055\u3044\u3002\n\u4e00\u90e8\u30aa\u30fc\u30d7\u30f3\u30fb\u30bd\u30fc\u30b9\u30fb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u3001\u6b21\u306e\u30b3\u30de\u30f3\u30c9\u3067\u30d5\u30e9\u30b0\u3092\u4ed8\u3051\u3066\u69cb\u6210\u3067\u304d\u307e\u3059\u3002\nconfigure CFLAGS="-g3 -gdwarf-2" CXXFLAGS="-g3 -gdwarf-2"\n\u5fd8\u308c\u305a\u306b\u6b21\u306e\u30b3\u30de\u30f3\u30c9\u3067\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30d3\u30eb\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002\nmake
Binaries_Files_Name=\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb
Binaries_Files_Description=\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u4ed8\u304d\u3067\u30d3\u30eb\u30c9\u3055\u308c\u305f\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u89a7

# analyze object files in folder
Folder_Provider_Name=\u30d5\u30a9\u30eb\u30c0\u5185\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u8abf\u67fb
Folder_Provider_Description=IDE\u306f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u307e\u3059\u3002\n\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u4ed8\u3051\u3066\u30bd\u30fc\u30b9\u3092\u30d3\u30eb\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002
Folder_Files_Name=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3059\u308b\u30eb\u30fc\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u3092\u9078\u629e(&R):
Folder_Files_Description=\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u6301\u3064\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u691c\u7d22\u3059\u308b\u30d5\u30a9\u30eb\u30c0\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u306b\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# analyze executable file
Executable_Provider_Name=\u5b9f\u884c\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u8abf\u67fb
Executable_Provider_Description=IDE\u306f\u5b9f\u884c\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u307e\u3059\u3002\n\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u4ed8\u3051\u3066\u30bd\u30fc\u30b9\u3092\u30d3\u30eb\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002
Executable_Files_Name=\u5b9f\u884c\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e(&X):
Executable_Files_Description=\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u6301\u3064\u5b9f\u884c\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u7d76\u5bfe\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u9078\u629e\u3057\u305f\u30d5\u30a1\u30a4\u30eb\u306b\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

Libraries_Files_Name=\u8ffd\u52a0\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e(&L):
Libraries_Files_Description=\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u6301\u3064\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u3002\u9078\u629e\u3057\u305f\u30d5\u30a1\u30a4\u30eb\u306b\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

RESTRICT_COMPILE_ROOT=\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30b3\u30f3\u30d1\u30a4\u30eb\u30fb\u30d1\u30b9\u3067\u691c\u51fa\u3055\u308c\u305f\u30bd\u30fc\u30b9\u3092\u5236\u9650
RESTRICT_SOURCE_ROOT=\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u3067\u691c\u51fa\u3055\u308c\u305f\u30bd\u30fc\u30b9\u3092\u5236\u9650

# analyze make log file
Make_Log_Provider_Name=\u30d3\u30eb\u30c9\u30fb\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u8abf\u67fb
Make_Log_Provider_Description=IDE\u306f\u3001\u30d3\u30eb\u30c9\u30fb\u30b3\u30de\u30f3\u30c9\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb(\u30d3\u30eb\u30c9\u30fb\u30ed\u30b0)\u3092\u8abf\u67fb\u3057\u307e\u3059\u3002
Make_Log_File_Name=\u30d3\u30eb\u30c9\u30fb\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u9078\u629e(&L):
Make_Log_File_Description=\u30d3\u30eb\u30c9\u30fb\u30b3\u30de\u30f3\u30c9\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb(\u30d3\u30eb\u30c9\u30fb\u30ed\u30b0)\u306e\u7d76\u5bfe\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

# analyze exec log file
Exec_Log_Provider_Name=\u30d3\u30eb\u30c9\u30fb\u30a2\u30ca\u30e9\u30a4\u30b6\u30fb\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u8abf\u67fb
Exec_Log_Provider_Description=IDE\u306f\u3001\u30d3\u30eb\u30c9\u30fb\u30a2\u30ca\u30e9\u30a4\u30b6\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb(exec\u30ed\u30b0)\u307e\u305f\u306f\u30b3\u30f3\u30d1\u30a4\u30eb\u30fb\u30b3\u30de\u30f3\u30c9\u30fb\u30d5\u30a1\u30a4\u30eb(compile_commands.json)\u3092\u8abf\u67fb\u3057\u307e\u3059\u3002
Exec_Log_File_Name=\u30d3\u30eb\u30c9\u30fb\u30a2\u30ca\u30e9\u30a4\u30b6\u30fb\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u9078\u629e(&L):
Exec_Log_File_Description=\u30d3\u30eb\u30c9\u30fb\u30a2\u30ca\u30e9\u30a4\u30b6\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb(exec\u30ed\u30b0)\u307e\u305f\u306f\u30b3\u30f3\u30d1\u30a4\u30eb\u30fb\u30b3\u30de\u30f3\u30c9\u30fb\u30d5\u30a1\u30a4\u30eb(compile_commands.json)\u306e\u7d76\u5bfe\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

NoExecutable=\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u306b\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u3042\u308a\u307e\u305b\u3093
NotFoundExecutable=\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb{0}\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
CannotAnalyzeExecutable=\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb{0}\u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093

NoBaseFolder=\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u306b\u30d5\u30a9\u30eb\u30c0\u304c\u3042\u308a\u307e\u305b\u3093
CannotAnalyzeFolder=\u30d5\u30a9\u30eb\u30c0{0}\u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093
NotFoundExecutablesInFolder=\u30d5\u30a9\u30eb\u30c0{0}\u306b\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
NotFoundExecutableWithDebugInformation=\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u3092\u542b\u3080\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u30d5\u30a9\u30eb\u30c0{0}\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093

NotFoundMakeLog=Make\u30ed\u30b0\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
NotFoundExecLog=exec\u30ed\u30b0\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093

FileNotFoundException=\u30d5\u30a1\u30a4\u30eb{0}\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
WrongFileFormatException=\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb{0}\u306e\u5f62\u5f0f\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
IOException=\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb{0}\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093: {1}
Exception=\u30d5\u30a1\u30a4\u30eb{0}\u8aad\u53d6\u308a\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}
NotFoundDebugInformation=\u30d0\u30a4\u30ca\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb{0}\u306b\u30c7\u30d0\u30c3\u30b0\u60c5\u5831\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
BadDebugInformation=\u30bd\u30fc\u30b9\u30fb\u30eb\u30fc\u30c8{0}\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093


