# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 2009-2011 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.
#
# Contributor(s):
#
# Portions Copyrighted 2009-2010 Sun Microsystems, Inc.

MSG_SampleNotSupported=No se puede crear una muestra: no se admite la muestra {0}
MSG_CreatingSampleDBProgressLabel=Creando base de datos {0} en MySQL
MSG_TestFailed=Probar a ver si la conexi\u00f3n MySQL es una falla v\u00e1lida: {0}
MSG_ConnectionLost=La conexi\u00f3n al servidor MySQL se perdi\u00f3.  El tiempo de la conexi\u00f3n pudo haberse terminado, la conexi\u00f3n a la red pudo haberse perdido o el servidor ha sido apagado.
MSG_QueryReconnect=\u00bfDesea intentar reconectarse al servidor?
MSG_ServerNoLongerRunning=El Servidor MySQL parece que ya no est\u00e1 ejecut\u00e1ndose.  Es posible que se haya detenido o la conexi\u00f3n de la red se ha perdido.  Verifique el estado del servidor MySQL y si es necesario, rein\u00edcielo.
MSG_ServerStillRunning=Al parecer el comando Detener no se realiz\u00f3 correctamente o no ha sido completado, ya que el servidor MySQL parece que a\u00fan sigue en funcionamiento.  El servidor puede estarse cerrando, o puede que necesite ajustar la configuraci\u00f3n para el comando stop, o que necesite detener el servidor manualmente. \n\n \u00bfDesea mantener esperando que el servidor iniciar o modificar su configuraci\u00f3n para el comando stop?
MSG_ConnectFailedAfterStart=No se puede conectar al servidor MySQL despu\u00e9s de haberlo iniciado: {0}
MSG_DatabaseCommandFailed=El comando de la base de datos {0} fall\u00f3 con la siguiente excepci\u00f3n: {1}
MSG_InvalidPortNumber=El n\u00famero de puerto {0} no es v\u00e1lido  Edite las propiedades de MySQL y cambie el n\u00famero de puerto.
MSG_UnknownHost=Servidor desconocido {0}.  La red pudo haberse caido o usted ha establecido un nombre de host no v\u00e1lido.
MSG_StartingMySQL=Iniciando Servidor MySQL...
MSG_StoppingMySQL=Deteniendo servidor MySQL...
MSG_ReconnectFailed=Pudo conectarse al servidor de MySQL:\n\n{0}.\n \n el servidor puede no estar en ejecuci\u00f3n o las propiedades de conexi\u00f3n MySQL no se pueden establecer correctamente.  \u00bfDesea editar las propiedades de conexi\u00f3n de MySQL?
MSG_ServerDoesNotAppearToHaveStarted=Pudo conectarse al servidor MySQL despu\u00e9s del inicio: {0}.\n\n podr\u00eda a\u00fan ser puesta en marcha, o que necesite cambiar la configuraci\u00f3n para el comando de inicio o su configuraci\u00f3n de conexi\u00f3n. \n\u00bf\n que desea editar sus propiedades de MySQL o mantener esperando que el servidor poner en marcha?
MSG_UnableToReconnectServerNotRunning=No se puede conectar con el servidor MySQL porque no parece que se est\u00e1 ejecutando configurado el host ({0}) con el puerto ({1}).  Verifique que el servidor est\u00e9 ejecut\u00e1ndose y que sus configuraciones sean correctas.
MSG_ReconnectingToMySQL=Voviendo a conectar con el servidor MySQL
MSG_WaitingForServerToStart=Esperar que el Servidor MySQL inicie
MSG_WaitingForServerToStop=Esperar que el Servidor MySQL se detenga
MSG_CantStartServerIsAlreadyRunning=No se puede iniciar el servidor MySQL porque parece que ya se est\u00e9 ejecutando en host {0}, puerto {1}.  Trate de conectar al servidor. Tambi\u00e9n es posible que otro proceso est\u00e1 escuchando en ese puerto.
MSG_CheckStart=Las configuraciones para iniciar MySQL han cambiado.  \u00bfDesea iniciar el servidor ahora?
MSG_UnableToStopServer=Se encontr\u00f3 un error mientras se trataba de detener el servidor MySQL
MSG_UnableToStartServer=Encontr\u00f3 un error al intentar iniciar el servidor MySQL
MSG_NoSampleWithoutInnoDB=La muestra requiere el motor de almacenamiento InnoDB, y este motor no est\u00e1 habilitada en el servidor.  Habilitar InnoDB e int\u00e9ntalo de nuevo.
StartManager.CancelButton=Cancelar
StartManager.CancelButtonA11yDesc=Cancelar inicio del servidor MySQL
StartManager.KeepWaitingButton=Seguir esperando
StartManager.KeepWaitingButtonA11yDesc=Seguir esperando de que el servidor de inice
StartManager.PropsButton=Editar propiedades de MySQL
StartManager.PropsButtonA11yDesc=Editar la propiedad de comando de inicio del servidor MySQL
StartManager.ServerNotRunningTitle=El Servidor MySQL no est\u00e1 ejecut\u00e1ndose

StopManager.CancelButton=Cancelar
StopManager.CancelButtonA11yDesc=Cancelar la detenci\u00f3n del Servidor MySQL
StopManager.KeepWaitingButton=Seguir esperando
StopManager.KeepWaitingButtonA11yDesc=Seguir esperando de que el servidor de detenga
StopManager.PropsButton=Editar el comando Detener
StopManager.PropsButtonA11yDesc=Editar la propiedad de comando de detener del servidor MySQL
StopManager.ServerStillRunningTitle=El Servidor MySQL a\u00fan se est\u00e1 ejecutando

MSG_UnableToConnect=No es posible establecer la conexi\u00f3n {0} para el usuario {1}
MySQLOptions_AdminPassword=Contrase\u00f1a de Administrador para el Servidor MySQL registrado

