# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

#ModeData
EXC_WindowManagerParse=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u044f \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044f\u0442\u0430 \u043c\u0435\u043d\u0430\u0434\u0436\u0435\u0440\u0430 \u043d\u0430 \u043f\u0440\u043e\u0437\u043e\u0440\u0446\u0438\u0442\u0435 {0}.
EXC_GroupParse=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u044f \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044f\u0442\u0430 \u043d\u0430 \u0413\u0440\u0443\u043f\u0438\u0442\u0435 {0}.
EXC_TCGroupParse=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u044f \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044f\u0442\u0430 \u043d\u0430 TCGroup {0}.
EXC_TCRefParse=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u044f \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044f\u0442\u0430 \u043d\u0430 TCRef {0}.
EXC_ModeParse=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u044f \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044f\u0442\u0430 \u043d\u0430 \u0440\u0435\u0436\u0438\u043c\u0438\u0442\u0435 {0}.

# PersistenceManager
EXC_RootFolder=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u0441\u044a\u0437\u0434\u0430\u043c \u043e\u0441\u043d\u043e\u0432\u043d\u0430\u0442\u0430 \u043f\u0430\u043f\u043a\u0430 {0}
EXC_CompsFolder=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u0441\u044a\u0437\u0434\u0430\u043c \u043f\u0430\u043f\u043a\u0430\u0442\u0430 \u0441 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0438 {0}
EXC_GroupsFolder=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u0441\u044a\u0437\u0434\u0430\u043c \u043f\u0430\u043f\u043a\u0430\u0442\u0430 \u0441 \u0433\u0440\u0443\u043f\u0438\u0442\u0435 {0}
EXC_ModesFolder=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u0441\u044a\u0437\u0434\u0430\u043c \u043f\u0430\u043f\u043a\u0430\u0442\u0430 \u0441 \u0440\u0435\u0436\u0438\u043c\u0438\u0442\u0435 {0}
#EXC_BrokenTCSetting=Top component {0} could not be loaded, either owning module was disabled, has incompatible version or top component's settings file format is broken.
EXC_FailedLocateTC=\u041d\u0430\u0439-\u0433\u043e\u0440\u043d\u0438\u044f\u0442 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 {0} \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0431\u044a\u0434\u0435 \u043d\u0430\u043c\u0435\u0440\u0435\u043d \u0438\u043b\u0438 \u0437\u0430\u0440\u0435\u0434\u0435\u043d \u043e\u0442 \u043f\u0430\u043f\u043a\u0430\u0442\u0430 \u0441 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0438
EXC_CannotSaveTCSettings=\u041d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0438\u0442\u0435 \u043d\u0430 \u043d\u0430\u0439-\u0433\u043e\u0440\u043d\u0438\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 {0} \u043d\u0435 \u043c\u043e\u0433\u0430\u0442 \u0434\u0430 \u0431\u044a\u0434\u0430\u0442 \u0437\u0430\u043f\u0438\u0441\u0430\u043d\u0438
EXC_CopyFails=\u041d\u0435 \u043c\u043e\u0433\u0430 \u0434\u0430 \u043a\u043e\u043f\u0438\u0440\u0430\u043c \u0444\u0430\u0439\u043b\u0430 \u0441 \u043d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0438 \u043d\u0430 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u0432 \u043f\u0430\u043f\u043a\u0430\u0442\u0430 {0}.

# {0} TopComponent name
FMT_TCWriteError=\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 {0} \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0431\u044a\u0434\u0435 \u0437\u0430\u043f\u0438\u0441\u0430\u043d \u043f\u043e\u0440\u0430\u0434\u0438 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438 \u0441\u044a\u0441 \u0441\u0435\u0440\u0438\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f\u0442\u0430 \u043c\u0443.
FMT_TCReadError=\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 {0} \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0431\u044a\u0434\u0435 \u043e\u0442\u0432\u043e\u0440\u0435\u043d \u043f\u043e\u0440\u0430\u0434\u0438 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0438 \u0441 \u0434\u0435\u0441\u0435\u0440\u0438\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f\u0442\u0430 \u043c\u0443.


