# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.

### Resource bundle for package org.netbeans.modules.projectimport.eclipse.wizard

# Global
CTL_BrowseButton_B=\u53c2\u7167(&R)...
CTL_BrowseButton_R=\u53c2\u7167(&R)...
CTL_BrowseButton_S=\u53c2\u7167(&S)...

# Wizard
CTL_WizardTitle=Eclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30a4\u30f3\u30dd\u30fc\u30c8

# Wizard Workspace selection
LBL_SpecifyWorkspaceDescription=<html>Eclipse\u304c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u683c\u7d0d\u3059\u308b\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u30fb\u30d5\u30a9\u30eb\u30c0\u3001\u307e\u305f\u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LBL_NoteAboutWorkspaceAdvantage=<html><b>\u6ce8:</b> Eclipse\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306b\u306f\u3001Java\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3068\u5916\u90e8\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u3064\u3044\u3066\u306e\u60c5\u5831\u3060\u3051\u3067\u306a\u304f\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u4f9d\u5b58\u6027\u3001Eclipse\u5909\u6570\u3001\u30e6\u30fc\u30b6\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u60c5\u5831\u3082\u683c\u7d0d\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u308c\u3089\u306e\u60c5\u5831\u3092\u4fdd\u6301\u3059\u308b\u5834\u5408\u306f\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304b\u3089\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u3092\u304a\u85a6\u3081\u3057\u307e\u3059\u3002
CTL_WorkspaceLocationStep=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5834\u6240
CTL_WorkspaceButton=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304b\u3089\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30a4\u30f3\u30dd\u30fc\u30c8(&F)
CTL_ProjectButton=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u4f9d\u5b58\u6027\u3092\u7121\u8996\u3057\u3066\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30a4\u30f3\u30dd\u30fc\u30c8(&O)
LBL_Workspace=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5834\u6240(&W):
LBL_Project=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8(&P):
LBL_ProjectDestination=\u5b9b\u5148\u30d5\u30a9\u30eb\u30c0(&D):
MSG_ChooseWorkspace=\u7d9a\u884c\u3059\u308b\u524d\u306b\u3001Eclipse\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u542b\u3080\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
MSG_ChooseProject=\u7d9a\u884c\u3059\u308b\u524d\u306b\u3001Eclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u542b\u3080\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
MSG_ChooseProjectDestination=\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u305fEclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5b9b\u5148\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
MSG_NotRegularWorkspace="{0}"\u306b\u306f\u3001\u901a\u5e38\u306eEclipse\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306f\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MSG_NotRegularWorkspaceButProject="{0}"\u306fEclipse\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u300c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u2026\u300d\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
MSG_NotRegularProject="{0}"\u306b\u306f\u3001\u901a\u5e38\u306eEclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MSG_CannotCreateProjectInFolder=\u30d5\u30a9\u30eb\u30c0"{0}"\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
MSG_CannotImportNonJavaProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306bJava Nature\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3002
MSG_CycleDependencies=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5faa\u74b0\u4f9d\u5b58\u6027\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u30a4\u30f3\u30dd\u30fc\u30c8\u6a5f\u80fd\u306f\u9069\u5207\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3088\u3046\u3068\u3057\u307e\u3059\u3002\u3057\u304b\u3057\u3001\u3053\u306eEclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u4f9d\u5b58\u6027\u3092\u53d6\u308a\u9664\u304f\u6700\u5584\u306e\u65b9\u6cd5\u306f\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u304c\u7d42\u4e86\u3057\u305f\u3042\u3068\u3001Eclipse\u307e\u305f\u306fNetBeans\u3067\u76f4\u63a5\u4f9d\u5b58\u6027\u3092\u4fee\u6b63\u3057\u307e\u3059\u3002\n\n\u691c\u77e5\u3055\u308c\u305f\u30b5\u30a4\u30af\u30eb:\n{0}
MSG_CreatedByPlugin=\u6b21\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u3001\u5916\u90e8Eclipse Java\u30d7\u30e9\u30b0\u30a4\u30f3\u306b\u3088\u3063\u3066\u4f5c\u6210\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30a4\u30f3\u30dd\u30fc\u30c8\u6a5f\u80fd\u306f\u3001\u3053\u308c\u3089\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u53ef\u80fd\u306a\u304b\u304e\u308a\u9069\u5207\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3088\u3046\u3068\u3057\u307e\u3059\u3002\u30a4\u30f3\u30dd\u30fc\u30c8\u5f8c\u3001\u5fc5\u8981\u306b\u5fdc\u3058\u3066\u3001\u624b\u52d5\u3067\u3053\u308c\u3089\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u691c\u67fb\u3057\u3001\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# Wizard Project(s) selection
CTL_ProjectSelectionStep=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
CTL_ProjectsSelectionStep=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
LBL_LocationOfNBProjects=NetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240(&L):
LBL_ProjectsToImport=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8(&I):
MSG_NonJavaProject="{0}"\u306f\u901a\u5e38\u306eJava\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
MSG_ProjectExist="{0}"\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u6307\u5b9a\u3055\u308c\u305f\u5834\u6240\u306b\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002\u307b\u304b\u306e\u5834\u6240\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_ProjectIsNotChosed=\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
MSG_WorkspaceIsEmpty="{0}"\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306b\u306f\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MSG_WorkspaceIsInvalid="{0}"\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304c\u7121\u52b9\u3067\u3059\u3002
MSG_DestinationIsEmpty=\u5834\u6240\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059

MSG_Project_Location_Note=<html>\u6ce8: Eclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3068\u3068\u3082\u306bNetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3059\u308bEclipse\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5834\u6240\u3092\u9078\u629e\u3057\u307e\u3059\u3002
RADIO_LOCATION=NetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30c7\u30fc\u30bf\u3092Eclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30d5\u30a9\u30eb\u30c0\u306b\u683c\u7d0d\u3059\u308b
RADIO_LOCATION_SEPARATE=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308bNetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u5225\u306e\u5834\u6240\u306b\u4f5c\u6210\u3059\u308b
RADIO_LOCATION_ECLIPSE=NetBeans\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30c7\u30fc\u30bf\u3092Eclipse\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30d5\u30a9\u30eb\u30c0\u306b\u683c\u7d0d\u3059\u308b
LBL_LocationOfNBProjects2=\u5834\u6240:
MSG_AlreadyImportedProjects=<html>\u4e00\u90e8\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u3001\u5b9b\u5148\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u3059\u3067\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002\u3053\u308c\u3089\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u307e\u3059\u3002




