AttachDialog_CopiedToClipboard=Par\u00e2metros do determinador de perfil copiados para a \u00e1rea de transfer\u00eancia
AttachDialog_RemotePackDialogCaption=Escolher uma Pasta de Destino
AttachDialog_RemotePackSaved=Pacote de defini\u00e7\u00e3o de perfil remoto salvo em {0}
AttachDialog_Steps_AddParameters=Adicione os seguintes par\u00e2metros ao script de inicializa\u00e7\u00e3o da aplica\u00e7\u00e3o
AttachDialog_Steps_CopyToClipboard=copiar para a \u00e1rea de transfer\u00eancia
AttachDialog_Steps_CreateRemotePack=Se ainda n\u00e3o o tiver feito, <a href={0}>crie um pacote de defini\u00e7\u00e3o de perfil Remoto</a> para o OS & JVM selecionado e fa\u00e7a upload no sistema remoto. O diret\u00f3rio raiz do pacote de determina\u00e7\u00e3o de perfil remoto ser\u00e1 chamado de {1}.
AttachDialog_Steps_EnsureCorrectJava=Certifique-se de que a aplica\u00e7\u00e3o de destino esteja configurada para ser executada utilizando {0}.
AttachDialog_Steps_Java5=Java 5
AttachDialog_Steps_Java5_32b=Java 5, 32 bits
AttachDialog_Steps_Java5_64b=Java 5, 64 bits
AttachDialog_Steps_Java6=Java 6+
AttachDialog_Steps_Java6_32b=Java 6+, 32 bits
AttachDialog_Steps_Java6_64b=Java 6+, 64 bits
AttachDialog_Steps_JavaCvm=CVM
AttachDialog_Steps_JavaSeEmbedded=Incorporado no Java SE
AttachDialog_Steps_MakeSureStarted=Certifique-se de que a aplica\u00e7\u00e3o de destino tenha sido iniciada pelo usu\u00e1rio {0} e esteja sendo executada utilizando Java 6+.
AttachDialog_Steps_RunCalibrateScript=Se n\u00e3o tiver executado a defini\u00e7\u00e3o de perfil no sistema remoto ainda, execute o script {0} primeiro para calibrar o determinador de perfil.
AttachDialog_Steps_StartApplication=Inicie a aplica\u00e7\u00e3o de destino. O processo ir\u00e1 esperar que o determinador de perfil se conecte.
AttachDialog_Steps_Step=Etapa {0}:
AttachDialog_Steps_SubmitSelectProcess=Submeta a caixa de di\u00e1logo e clique no bot\u00e3o Anexar para selecionar o processo da aplica\u00e7\u00e3o de destino.
AttachDialog_Steps_SubmitUnblock=Submeta essa caixa de di\u00e1logo e clique no bot\u00e3o Anexar para conectar-se \u00e0 aplica\u00e7\u00e3o de destino e retomar sua execu\u00e7\u00e3o.
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchTo32BitArch={0}Clique em{1} para atualizar as etapas para defini\u00e7\u00e3o de perfil de aplica\u00e7\u00f5es 32 bits.
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchTo64BitArch={0}Clique em{1} para atualizar as etapas para defini\u00e7\u00e3o de perfil de aplica\u00e7\u00f5es 64 bits.
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchToJava5={0}Clique em{1} para atualizar as etapas para a defini\u00e7\u00e3o de perfil de aplica\u00e7\u00f5es JDK 5.
#{0}, {1} provide begin/end of HTML link
AttachDialog_Steps_SwitchToJava6Up={0}Clique em{1} para atualizar as etapas para a defini\u00e7\u00e3o de perfil de aplica\u00e7\u00f5es JDK 6+.

