#
# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#

MSG_invalidCP=\u7121\u52b9\u306a\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30d1\u30b9\u5024\u3092\u4fee\u6b63: {0}
MSG_descriptorNotValid=\u73fe\u5728\u7de8\u96c6\u4e2d\u306e{0}\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u306f\u77db\u76fe\u3057\u305f\u72b6\u614b\u306b\u3042\u308a\u307e\u3059\u3002\u5909\u66f4\u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3057\u307e\u3059\u304b?
MSG_CannotUpdateFile={0}\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u66f8\u8fbc\u307f\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_cannotSaveNotParseableConfFile=\u69cb\u6210\u30d5\u30a1\u30a4\u30eb{0}\u306f\u89e3\u6790\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u4fdd\u5b58\u3067\u304d\u307e\u305b\u3093\u3002
MSG_configFileCannotParse=\u69cb\u6210\u30d5\u30a1\u30a4\u30eb{0}\u306f\u89e3\u6790\u3067\u304d\u307e\u305b\u3093 - \u5909\u66f4\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
MSG_CannotReadContextRoot=\u30d5\u30a1\u30a4\u30eb{0}\u306f\u89e3\u6790\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30fb\u30eb\u30fc\u30c8\u306e\u5024\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002
MSG_CannotReadReferenceName={0}\u30d5\u30a1\u30a4\u30eb\u306f\u89e3\u6790\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u53c2\u7167\u540d\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002

MSG_CannotReadDatasources=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30ea\u30b9\u30c8\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002{0}\u30d5\u30a1\u30a4\u30eb\u304c\u8aad\u53d6\u308a\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_NotParseableDatasources={0}\u30d5\u30a1\u30a4\u30eb\u306f\u89e3\u6790\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u30ea\u30b9\u30c8\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
ERR_WRONG_CONFIG_DIR=\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002\u69cb\u6210\u30c7\u30a3\u30ec\u30af\u30c8\u30ea{0}\u304c\u3001\u4e0d\u660e\u3001\u5b58\u5728\u3057\u306a\u3044\u3001\u307e\u305f\u306f\u8aad\u53d6\u308a\u4e0d\u53ef\u306e\u3044\u305a\u308c\u304b\u3067\u3059\u3002

MSG_datasourcesXmlCannotParse=\u69cb\u6210\u30d5\u30a1\u30a4\u30eb{0}\u306f\u89e3\u6790\u3067\u304d\u307e\u305b\u3093 - \u5909\u66f4\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
MSG_datasourcesXmlNotValid=\u73fe\u5728\u7de8\u96c6\u4e2d\u306e{0}\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u306f\u77db\u76fe\u3057\u305f\u72b6\u614b\u306b\u3042\u308a\u307e\u3059\u3002\u4f5c\u696d\u3092\u7d9a\u3051\u307e\u3059\u304b?
MSG_CannotUpdate=\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002
MSG_FailedToCreateConfigFolder={0}\u30d5\u30a9\u30eb\u30c0\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

MSG_FailedToDeployDatasource=1\u3064\u4ee5\u4e0a\u306e\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u3092\u30c7\u30d7\u30ed\u30a4\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b5\u30fc\u30d0\u30fc\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8: {0}\u3002
MSG_FailedToDeployLibrary=1\u3064\u4ee5\u4e0a\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u30c7\u30d7\u30ed\u30a4\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b5\u30fc\u30d0\u30fc\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8: {0}\u3002
MSG_FailedToDeployJMS=1\u3064\u4ee5\u4e0a\u306eJMS\u30ea\u30bd\u30fc\u30b9\u3092\u30c7\u30d7\u30ed\u30a4\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b5\u30fc\u30d0\u30fc\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8: {0}\u3002

MSG_CannotReadServerLibraries={0}\u30d5\u30a1\u30a4\u30eb\u306f\u89e3\u6790\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u5024\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002
MSG_DidNotFindServerLibraries=\u4e00\u90e8\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u304c\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u898b\u3064\u304b\u3089\u306a\u304b\u3063\u305f\u304b\u3001\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

MSG_NotParseableMessages={0}\u30d5\u30a1\u30a4\u30eb\u306f\u89e3\u6790\u3067\u304d\u306a\u3044\u305f\u3081\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u30ea\u30b9\u30c8\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
MSG_CannotReadMessages=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u30ea\u30b9\u30c8\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002{0}\u30d5\u30a1\u30a4\u30eb\u304c\u8aad\u53d6\u308a\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MSG_MessageDestinationAlreadyExists=\u540c\u3058\u540d\u524d\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u5b9b\u5148\u304c\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002

