# This module is part of NetBeans and is open-source.
# You can see http://www.netbeans.org/about/legal/index.html for details.
#
# You may use the binary however you like. The source file license is:
#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Sun in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2007 Sun
# Microsystems, Inc. All Rights Reserved.

# Sample ResourceBundle properties file

# Libraries Panel
ADD_PROJECT_BUTTON_TXT=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u8ffd\u52a0...
ADD_PROJECT_BUTTON_TT=\u5225\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u51fa\u529b\u3092\u30ea\u30f3\u30af\u884c\u306b\u8ffd\u52a0\u3057\u307e\u3059

ADD_STANDARD_LIBRARY_BUTTON_TXT=\u6a19\u6e96\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u8ffd\u52a0...
ADD_STANDARD_LIBRARY_BUTTON_TT=\u30ea\u30f3\u30af\u884c\u306b\u6a19\u6e96\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u8ffd\u52a0\u3057\u307e\u3059

ADD_PKG_CONFIG_LIBRARY_BUTTON_TXT=PkgConfig\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u8ffd\u52a0...
ADD_PKG_CONFIG_LIBRARY_BUTTON_TT=pkgconfig\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u30ea\u30f3\u30af\u884c\u306b\u8ffd\u52a0\u3057\u307e\u3059

ADD_LIBRARY_BUTTON_TXT=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u8ffd\u52a0...
ADD_LIBRARY_BUTTON_TT=\u30e9\u30a4\u30d6\u30e9\u30ea(m\u3001gnome\u306a\u3069)\u3092\u30ea\u30f3\u30af\u884c\u306b\u8ffd\u52a0\u3057\u307e\u3059

ADD_LIBRARY_FILE_BUTTON_TXT=\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u8ffd\u52a0...
ADD_LIBRARY_FILE_BUTTON_TT=\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb(/usr/lib/libodbc.a)\u3092\u30ea\u30f3\u30af\u884c\u306b\u8ffd\u52a0\u3057\u307e\u3059

ADD_OPTION_BUTTON_TXT=\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8ffd\u52a0...
ADD_OPTION_BUTTON_TT=\u30ea\u30f3\u30af\u884c\u306b\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0\u3057\u307e\u3059



ADD_PROJECT_DIALOG_TITLE=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u8ffd\u52a0
ADD_PROJECT_DIALOG_AD=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u8ffd\u52a0\u30c0\u30a4\u30a2\u30ed\u30b0
SELECT_STATNDARD_LIBRARY_DIALOG_TITLE=\u6a19\u6e96\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u9078\u629e
SELECT_LIBRARY_CHOOSER_TITLE=\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u9078\u629e
SELECT_LIBRARY_FILE_CHOOSER_TITLE=\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e
SELECT_CHOOSER_BUTTON=\u9078\u629e
SELECT_OPTION_DIALOG_TITLE=\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u9078\u629e
LIBRARIES_AND_OPTIONS_TXT=\u30e9\u30a4\u30d6\u30e9\u30ea\u3068\u30aa\u30d7\u30b7\u30e7\u30f3:


# Projects Panel
ADD_PROJECTS_BUTTON_TXT=\u8ffd\u52a0...
ADD_PROJECTS_BUTTON_TT=\u5fc5\u9808\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u8ffd\u52a0\u3059\u308b

PROJECTS_TXT=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8:



# LibraryOptionPanel
STATIC_BINDINGS_TXT=\u9759\u7684\u30d0\u30a4\u30f3\u30c9

DYNAMIC_BINDINGS_TXT=\u52d5\u7684\u30d0\u30a4\u30f3\u30c9

OTHER_OPTION_TXT=\u305d\u306e\u4ed6\u306e\u30aa\u30d7\u30b7\u30e7\u30f3


#Make Artifact Chooser
PROJECT_NAME_TXT=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u540d:
PROJECT_LIBRARY_FILES_TXT=\u69cb\u6210(&F):

PROJECT_LIBRARY_FILES_AD=\u69cb\u6210
ADD_ITSELF_ERROR=\u81ea\u5df1\u53c2\u7167\u306f\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
ADD_CYCLIC_ERROR=\u5faa\u74b0\u53c2\u7167\u306f\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
LOADING_PROJECT=\u30ed\u30fc\u30c9\u4e2d...

# OptionsPanel
ALL_OPTIONS_TXT=\u3059\u3079\u3066\u306e\u30aa\u30d7\u30b7\u30e7\u30f3:

INHERIT_TXT=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304b\u3089\u7d99\u627f

INHERIT_AD=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304b\u3089\u7d99\u627f
ADDITIONAL_OPTIONS_TXT=\u8ffd\u52a0\u306e\u30aa\u30d7\u30b7\u30e7\u30f3(&O):
ADDITIONAL_OPTIONS_AD=\u8ffd\u52a0\u306e\u30aa\u30d7\u30b7\u30e7\u30f3


#StdLibPanel
STANDARD_LIBRARIES_TXT=\u6a19\u6e96\u30e9\u30a4\u30d6\u30e9\u30ea:

MANAGE_LIBRARIES_TXT=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u7ba1\u7406...


#TableEditorPanel
CLICK_TO_CHANGE=\u69cb\u6210 - \u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u5909\u66f4\u3067\u304d\u307e\u3059...
ITEM=\u9805\u76ee
CONFIGURATION=\u69cb\u6210
BUILD=\u30d3\u30eb\u30c9
BROKEN=\u7834\u640d:

# StdLibPanel
LIBRARY_LIST_SD=\u6a19\u6e96\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u4e00\u89a7
LIBRARY_LIST_NM=\u6a19\u6e96\u30e9\u30a4\u30d6\u30e9\u30ea

# LibraryOptionPanel
LINKER_OPTIONS_PANEL_SD=\u30ea\u30f3\u30ab\u30fc\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3\u30fb\u30c0\u30a4\u30a2\u30ed\u30b0
LINKER_OPTIONS_DYNAMIC_RB_SD=\u52d5\u7684\u30ea\u30f3\u30ab\u30fc\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8ffd\u52a0
LINKER_OPTIONS_STATIC_RB_SD=\u9759\u7684\u30ea\u30f3\u30ab\u30fc\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8ffd\u52a0
LINKER_OPTIONS_OTHER_RB_SD=\u305d\u306e\u4ed6\u306e\u30ea\u30f3\u30ab\u30fc\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8ffd\u52a0
LINKER_OPTIONS_OTHER_TF_SD=\u305d\u306e\u4ed6\u306e\u30ea\u30f3\u30ab\u30fc\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3

# ProjectPropPanel
ProjectPropPanel.sourceRootLabel.text=\u30bd\u30fc\u30b9\u30fb\u30d5\u30a9\u30eb\u30c0:

ProjectPropPanel.testRootLabel.text=\u30c6\u30b9\u30c8\u30fb\u30d5\u30a9\u30eb\u30c0:

ProjectPropPanel.projectLabel.text=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240(&L):
ProjectPropPanel.projectLabel.ad=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u6240


ADD_BUTTON_TXT=\u8ffd\u52a0

# {0} - name of configuration
ProjectPropPanel.encodingLabel.text=\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0(&E):

# DevelopmentHostNodeProp's customizer
DLG_TITLE_Connect=\u30db\u30b9\u30c8\u69cb\u6210\u306e\u78ba\u8a8d

# Packaging
PackagingFilesPanel.addButton.text=\u65b0\u898f

PackagingFilesPanel.addButton.ad=\u7a7a\u306e\u30a8\u30f3\u30c8\u30ea\u306e\u8ffd\u52a0
PackagingFilesPanel.addFileOrDirButton.text=\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u8ffd\u52a0

PackagingFilesPanel.addFileOrDirButton.ad=\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u8ffd\u52a0
PackagingFilesPanel.addFilesButton.text=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30d5\u30a1\u30a4\u30eb\u3092\u8ffd\u52a0

PackagingFilesPanel.addFilesButton.ad=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30d5\u30a1\u30a4\u30eb\u3092\u8ffd\u52a0
PackagingFilesPanel.addLinkButton.text=\u30bd\u30d5\u30c8\u30fb\u30ea\u30f3\u30af\u306e\u8ffd\u52a0

PackagingFilesPanel.addLinkButton.ad=\u30bd\u30d5\u30c8\u30fb\u30ea\u30f3\u30af\u306e\u8ffd\u52a0
PackagingFilesPanel.addParameterButton.text=\u8ffd\u52a0

PackagingFilesPanel.addParameterButton.ad=\u8ffd\u52a0
PackagingFilesPanel.duplicateButton.text=\u8907\u88fd

PackagingFilesPanel.duplicateButton.ad=\u30a8\u30f3\u30c8\u30ea\u3092\u8907\u88fd
PackagingFilesPanel.listlabel.text=\u30d5\u30a1\u30a4\u30eb:

AddNewLinkDialogTitle=\u65b0\u898f\u30bd\u30d5\u30c8\u30fb\u30ea\u30f3\u30af\u306e\u8ffd\u52a0
PackagingInfoPanel.listlabel.text=\u30d1\u30e9\u30e1\u30fc\u30bf:

Softlink_tt=\u30bd\u30d5\u30c8\u30fb\u30ea\u30f3\u30af: {0}
Directory_tt=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea: {0}
File_tt=\u30d5\u30a1\u30a4\u30eb: {0}

PACKAGING_ARCH_DOC=\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u30a2\u30fc\u30ad\u30c6\u30af\u30c1\u30e3\u3092\u793a\u3059\u82f1\u6570\u5b57\u30c8\u30fc\u30af\u30f3\u306e\u30ab\u30f3\u30de\u533a\u5207\u308a\u306e\u30ea\u30b9\u30c8\u3002pkgmk(1)\u30c4\u30fc\u30eb\u306f\u3001\u5b9f\u969b\u306b\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u30d3\u30eb\u30c9\u3059\u308b\u5834\u5408\u306b\u3001\u3053\u306e\u5024\u3092\u4f5c\u6210\u307e\u305f\u306f\u5909\u66f4\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002\u30c8\u30fc\u30af\u30f3\u306e\u6700\u5927\u9577\u306f16\u6587\u5b57\u3067\u3001\u30ab\u30f3\u30de\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002Solaris\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u3067\u306f\u3001\u6b21\u306e\u5f62\u5f0f\u306e\u30a2\u30fc\u30ad\u30c6\u30af\u30c1\u30e3\u30fb\u30c8\u30fc\u30af\u30f3\u30921\u3064\u3060\u3051\u4f7f\u7528\u3057\u307e\u3059: <instruction_set_architecture>[.<platform_group>]\u3053\u3053\u3067\u3001platform_group\u306fSolaris\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u307f\u3092\u793a\u3057\u307e\u3059\u3002\u4ed6\u793e\u88fd\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306eARCH\u306e\u5024\u306f\u3001Solaris\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u6b21\u306e\u547d\u4ee4\u30bb\u30c3\u30c8\u30fb\u30a2\u30fc\u30ad\u30c6\u30af\u30c1\u30e3\u306b\u5236\u9650\u3055\u308c\u307e\u3059(uname -p): sparc\u3001i386\u3001\u304a\u3088\u3073ppc\u3002Solaris\u306e\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u30fb\u30b0\u30eb\u30fc\u30d7(uname -m)\u306e\u4f8b\u306b\u306f\u3001SPARC\u547d\u4ee4\u30bb\u30c3\u30c8\u7528\u306esun4u\u304a\u3088\u3073i386\u547d\u4ee4\u30bb\u30c3\u30c8\u7528\u306ei86pc\u304c\u3042\u308a\u307e\u3059\u3002\u8a73\u7d30\u306funame(1)\u304a\u3088\u3073isalist(1)\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_CATEGORY_DOC=\u305d\u306e\u4e0b\u306b\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u8868\u793a\u3067\u304d\u308b\u30ab\u30c6\u30b4\u30ea\u306e\u30ab\u30f3\u30de\u533a\u5207\u308a\u30ea\u30b9\u30c8\u3067\u3059\u3002\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u5c11\u306a\u304f\u3068\u3082\u30b7\u30b9\u30c6\u30e0\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ab\u30c6\u30b4\u30ea\u306b\u5c5e\u3057\u307e\u3059\u3002\u30ab\u30c6\u30b4\u30ea\u306b\u306f\u5927\u6587\u5b57\u3068\u5c0f\u6587\u5b57\u306e\u533a\u5225\u304c\u3042\u308a\u3001\u82f1\u6570\u5b57\u306e\u307f\u542b\u3081\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u5404\u30ab\u30c6\u30b4\u30ea\u306b\u306f\u300116\u6587\u5b57\u306e\u9577\u3055\u5236\u9650\u304c\u3042\u308a\u307e\u3059\u3002
PACKAGING_NAME_DOC=\u30d1\u30c3\u30b1\u30fc\u30b8\u540d\u3092\u6307\u5b9a\u3059\u308b\u30c6\u30ad\u30b9\u30c8(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002\u6a5f\u80fd\u304a\u3088\u3073\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u76ee\u7684\u306e\u57fa\u672c\u7684\u306a\u8aac\u660e\u3068\u3057\u3066NAME\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\u7565\u8a9e\u306f\u6b63\u5f0f\u306a\u3082\u306e\u3092\u8a18\u8f09\u3059\u308b\u3088\u3046\u306b\u3057\u3001\u5185\u90e8\u7528\u306e\u88fd\u54c1\u304a\u3088\u3073\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30b3\u30fc\u30c9\u306e\u540d\u524d\u306f\u907f\u3051\u3066\u304f\u3060\u3055\u3044\u3002DESC\u30d1\u30e9\u30e1\u30fc\u30bf\u306f\u3001\u8aac\u660e\u60c5\u5831\u3092\u5c55\u958b\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002NAME\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u4f7f\u7528\u3057\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u4f7f\u7528\u306b\u3064\u3044\u3066\u3001\u306a\u305c\u30e6\u30fc\u30b6\u30fc\u304c\u305d\u308c\u3092\u30ed\u30fc\u30c9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u306e\u304b\u306a\u3069\u3092\u3001\u3067\u304d\u308b\u3060\u3051\u660e\u78ba\u306b\u8aac\u660e\u3057\u307e\u3059\u3002
PACKAGING_PKG_DOC=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u7701\u7565\u540d\u3002\u7701\u7565\u540d\u306e\u6587\u5b57\u306f\u3059\u3079\u3066\u82f1\u6570\u5b57\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u7701\u7565\u540d\u306b\u306f - \u304a\u3088\u3073+ \u6587\u5b57\u3082\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002\u6700\u521d\u306e\u6587\u5b57\u306f\u6570\u5b57\u3001+\u3001\u307e\u305f\u306f - \u306b\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u7701\u7565\u540d\u306e\u6700\u5927\u9577\u306f32\u6587\u5b57\u3068\u3044\u3046\u5236\u9650\u304c\u3042\u308a\u307e\u3059\u3002install\u3001new\u3001\u304a\u3088\u3073all\u306f\u4e88\u7d04\u6e08\u306e\u7701\u7565\u540d\u3067\u3059\u3002\u6700\u521d\u306e4\u6587\u5b57\u3092\u4f1a\u793e\u306e\u9298\u67c4\u8a18\u53f7\u306a\u3069\u3001\u4f01\u696d\u306b\u56fa\u6709\u306e\u3082\u306e\u306b\u3059\u308b\u306e\u304c\u6163\u4f8b\u3067\u3059\u3002
PACKAGING_VERSION_DOC=\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u73fe\u5728\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u6307\u5b9a\u3059\u308b\u30c6\u30ad\u30b9\u30c8\u3067\u3059\u3002\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57\u3067\u3001\u6700\u521d\u306e\u6587\u5b57\u3092\u5de6\u62ec\u5f27\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002pkgmk(1)\u30c4\u30fc\u30eb\u306f\u3001\u5b9f\u969b\u306b\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u30d3\u30eb\u30c9\u3059\u308b\u5834\u5408\u306b\u3001\u3053\u306e\u5024\u3092\u4f5c\u6210\u307e\u305f\u306f\u5909\u66f4\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002\u73fe\u5728\u306eSolaris\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306e\u904b\u7528\u3067\u306f\u3001\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u5358\u8abf\u5897\u52a0\u30c7\u30e5\u30fc\u30a410\u9032\u6570\u5024\u306b\u5272\u5f53\u3066\u307e\u3059\u3002\u5024\u306e\u5f62\u5f0f\u306f\u3001<major_revision>.<minor_revision>[.<micro_revision>]\u3067\u3001\u30ea\u30d3\u30b8\u30e7\u30f3\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3059\u3079\u3066\u6574\u6570\u3067\u3059\u3002\u30d0\u30fc\u30b8\u30e7\u30f3\u7ba1\u7406\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u5fc5\u8981\u306b\u5fdc\u3058\u3066\u4efb\u610f\u306e\u30c7\u30e5\u30fc\u30a410\u9032\u6570\u306e\u6587\u5b57\u5217\u306b\u62e1\u5f35\u3067\u304d\u307e\u3059\u3002
PACKAGING_BASEDIR_DOC="relocatable"\u30d5\u30a1\u30a4\u30eb\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3067\u304d\u308b\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d1\u30b9\u540d\u3002\u7a7a\u767d\u306e\u5834\u5408\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u518d\u914d\u7f6e\u53ef\u80fd\u3067\u306f\u306a\u304f\u3001\u76f8\u5bfe\u30d1\u30b9\u540d\u3092\u6301\u3064\u30d5\u30a1\u30a4\u30eb\u306f\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u305b\u3093\u3002\u7ba1\u7406\u8005\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3067\u304d\u307e\u3059\u3002
PACKAGING_CLASSES_DOC=\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u5b9a\u7fa9\u3055\u308c\u305f\u3001\u30af\u30e9\u30b9\u3092\u30b9\u30da\u30fc\u30b9\u3067\u533a\u5207\u3063\u305f\u30ea\u30b9\u30c8\u3002\u30ea\u30b9\u30c8\u306e\u9806\u5e8f\u306f\u30af\u30e9\u30b9\u304c\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u308b\u9806\u5e8f\u3092\u6c7a\u5b9a\u3057\u307e\u3059\u3002\u6700\u521d\u306b\u30ea\u30b9\u30c8\u3055\u308c\u305f\u30af\u30e9\u30b9\u304c\u6700\u521d\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3059(\u30e1\u30c7\u30a3\u30a2\u3054\u3068\u306b)\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306f\u3001\u30ea\u30af\u30a8\u30b9\u30c8\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u3067\u5909\u66f4\u3067\u304d\u307e\u3059\u3002
PACKAGING_DESC_DOC=\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u8aac\u660e\u3059\u308b\u30c6\u30ad\u30b9\u30c8(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u5024\u306f\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u4e2d\u8eab\u306b\u95a2\u3059\u308b\u8aac\u660e\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30e9\u306b\u63d0\u4f9b\u3057\u3001NAME\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u8aac\u660e\u306b\u57fa\u3065\u3044\u3066\u30d3\u30eb\u30c9\u3059\u308b\u3053\u3068\u304c\u63a8\u5968\u3055\u308c\u3066\u3044\u307e\u3059\u3002pkginfo -l\u3067\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u5168\u4f53\u7684\u306a\u8aac\u660e\u3092\u63d0\u4f9b\u3067\u304d\u308b\u3088\u3046\u30012\u3064\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u4e00\u7dd2\u306b\u52d5\u4f5c\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_EMAIL_DOC=\u8a73\u7d30\u60c5\u5831\u3092\u5165\u624b\u3057\u305f\u308abug\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u305f\u308a\u3067\u304d\u308b\u96fb\u5b50\u30e1\u30fc\u30eb\u30fb\u30a2\u30c9\u30ec\u30b9(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002
PACKAGING_HOTLINE_DOC=\u8a73\u7d30\u60c5\u5831\u3092\u5165\u624b\u3057\u305f\u308abug\u3092\u30ec\u30dd\u30fc\u30c8\u3057\u305f\u308a\u3067\u304d\u308b\u96fb\u8a71\u756a\u53f7\u3084\u90f5\u9001\u5148(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002
PACKAGING_INTONLY_DOC=Null\u4ee5\u5916\u306e\u5024\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5834\u5408\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u5bfe\u8a71\u5f62\u5f0f\u306b\u3088\u308b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306e\u307f\u304c\u63a8\u5968\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u793a\u3057\u307e\u3059\u3002
PACKAGING_ISTATES_DOC=\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3067\u8a31\u5bb9\u3055\u308c\u308b\u5b9f\u884c\u72b6\u614b\u306e\u30ea\u30b9\u30c8(\u305f\u3068\u3048\u3070\u3001"S s 1"\u306fS\u3001s\u3001\u307e\u305f\u306f1\u306e\u5b9f\u884c\u72b6\u614b\u3092\u8a31\u5bb9)\u3002Solaris\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u74b0\u5883\u306f\u5b9f\u884c\u30ec\u30d9\u30ebs\u3001S\u30010\u30011\u30012\u30013\u30015\u3001\u304a\u3088\u30736\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3067\u8a31\u5bb9\u53ef\u80fd\u306a\u5b9f\u884c\u30ec\u30d9\u30eb\u306fS\u30011\u30012\u3001\u304a\u3088\u30733\u3067\u3059\u3002\u8a73\u7d30\u306f\u3001init(1M)\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_MAXINST_DOC=1\u53f0\u306e\u30de\u30b7\u30f3\u306b\u540c\u6642\u306b\u8a31\u53ef\u3055\u308c\u308b\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u6700\u5927\u6570\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f1\u3064\u3060\u3051\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306f\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u8907\u6570\u6301\u3064\u5834\u5408\u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u8907\u6570\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u306b\u306f(\u305f\u3068\u3048\u3070\u3001ARCH\u307e\u305f\u306fVERSION\u30d1\u30e9\u30e1\u30fc\u30bf\u5024\u306e\u7570\u306a\u308b\u30d1\u30c3\u30b1\u30fc\u30b8)\u3001\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u5024\u306f\u3001\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u5171\u5b58\u3059\u308b\u8907\u6570\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u542b\u3081\u3001\u6307\u5b9a\u3057\u305f\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u3059\u3079\u3066\u8a31\u53ef\u3059\u308b\u3088\u3046\u3001\u5341\u5206\u9ad8\u4f4d\u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002
PACKAGING_ORDER_DOC=\u30e1\u30c7\u30a3\u30a2\u306b\u8a18\u9332\u3055\u308c\u308b\u9806\u756a\u3092\u5b9a\u7fa9\u3059\u308b\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u3002\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u4f5c\u6210\u3067\u3001pkgmk(1)\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u30af\u30e9\u30b9\u306f\u3001\u6a19\u6e96\u306e\u9806\u5e8f\u4ed8\u3051\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u3092\u4f7f\u7528\u3057\u3066\u30e1\u30c7\u30a3\u30a2\u306b\u8a18\u9332\u3055\u308c\u307e\u3059\u3002
PACKAGING_PSTAMP_DOC=\u51fa\u529b\u304c\u8907\u6570\u306e\u5834\u5408\u306bpkgmap(4)\u30d5\u30a1\u30a4\u30eb\u3092\u30de\u30fc\u30af\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u3001\u751f\u7523\u30b9\u30bf\u30f3\u30d7\u3002\u540c\u6642\u306b\u8907\u6570\u4f7f\u7528\u3059\u308b\u5834\u5408\u306b\u3001\u3042\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u4f5c\u3089\u308c\u308b\u30b3\u30d4\u30fc\u540c\u58eb\u3092\u533a\u5225\u3059\u308b\u305f\u3081\u306e\u624b\u6bb5\u3068\u306a\u308a\u307e\u3059\u3002PSTAMP\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001UNIX\u30b7\u30b9\u30c6\u30e0\u306e\u30de\u30b7\u30f3\u540d\u306e\u3042\u3068\u306b\u6587\u5b57\u5217"YYYYMMDDHHMMSS"(\u5e74\u3001\u6708\u3001\u65e5\u3001\u6642\u3001\u5206\u3001\u79d2)\u304c\u7d9a\u304d\u307e\u3059\u3002
PACKAGING_RSTATES_DOC=\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u524a\u9664\u3067\u8a31\u5bb9\u3055\u308c\u308b\u5b9f\u884c\u72b6\u614b\u306e\u30ea\u30b9\u30c8(\u305f\u3068\u3048\u3070\u3001"S s 1"\u306fS\u3001s\u307e\u305f\u306f1\u306e\u5b9f\u884c\u72b6\u614b\u3092\u8a31\u5bb9)\u3002Solaris\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u74b0\u5883\u306f\u5b9f\u884c\u30ec\u30d9\u30ebs\u3001S\u30010\u30011\u30012\u30013\u30015\u3001\u304a\u3088\u30736\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3067\u8a31\u5bb9\u53ef\u80fd\u306a\u5b9f\u884c\u30ec\u30d9\u30eb\u306fs\u3001S\u30011\u30012\u3001\u304a\u3088\u3073 3\u3067\u3059\u3002\u8a73\u7d30\u306f init(1M)\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_SUNW_ISA_DOC=\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u793a\u3059Solaris\u5c02\u7528\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u304csparcv9\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u300164\u30d3\u30c3\u30c8\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u542b\u3093\u3067\u3044\u307e\u3059\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001ARCH\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u5024\u306b\u30c7\u30d5\u30a9\u30eb\u30c8\u306eISA (Instruction Set Architecture)\u304c\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002
# Language code is used as example here
PACKAGING_SUNW_LOC_DOC=\u7279\u5b9a\u306e\u88fd\u54c1\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3055\u308c\u305f\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3080\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u3001Solaris\u5c02\u7528\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u3002\u30d1\u30e9\u30e1\u30fc\u30bf\u5024\u306f\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30ed\u30b1\u30fc\u30eb\u306e\u3001\u30ab\u30f3\u30de\u533a\u5207\u308a\u306e\u30ea\u30b9\u30c8\u3067\u3059\u3002\u3053\u308c\u306f\u3001\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3055\u308c\u305f\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3080\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u306e\u307f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u901a\u5e38\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ab\u30bf\u30ed\u30b0\u3067\u3059\u3002\u3053\u306e\u6587\u5b57\u5217\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u4f7f\u7528\u3067\u304d\u308b\u5024\u306f\u3001International Language Environments Guide\u306b\u3042\u308bStandard Locale Names\u306e\u8868\u306b\u3042\u308a\u307e\u3059\u3002SUNW_LOC="<locale_name>,<locale_name>,..,\\<locale_name>"\u3053\u3053\u3067\u3001<locale_name>::=<language>[_<territory>]\\[.<codeset>]<language>::=ISO 639\u304b\u3089\u306e\u540d\u524d\u306e\u30bb\u30c3\u30c8<territory>::=ISO 3166\u3067\u6307\u5b9a\u3055\u308c\u305f\u30c6\u30ea\u30c8\u30ea\u306e\u30bb\u30c3\u30c8<codeset>::=\u306f\u3001\u30b3\u30fc\u30c9\u3055\u308c\u305f\u6587\u5b57\u30bb\u30c3\u30c8\u306b\u5bfe\u5fdc\u3059\u308b\u6587\u5b57\u5217\u3002C\u306e\u5024\u306f\u5f93\u6765\u306eUNIX\u30b7\u30b9\u30c6\u30e0\u306e\u52d5\u4f5c(\u7c73\u56fd\u82f1\u8a9e\u3001en_US)\u3092\u6307\u5b9a\u3059\u308b\u305f\u3081\u3001C\u30ed\u30b1\u30fc\u30eb\u306b\u5c5e\u3059\u308b\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3055\u308c\u3066\u3044\u306a\u3044\u30d1\u30c3\u30b1\u30fc\u30b8\u3068\u3057\u3066\u8868\u793a\u3055\u308c\u3001\u305d\u306e\u305f\u3081\u3001pkginfo\u30d5\u30a1\u30a4\u30eb\u306b\u542b\u307e\u308c\u308bSUNW_LOC\u304a\u3088\u3073SUNW_PKGLIST\u304c\u3042\u3063\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002\u8a73\u7d30\u306f\u3001packagetoc(4)\u304a\u3088\u3073setlocale(3C)\u306eSUNW_LOC\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u30ad\u30fc\u30ef\u30fc\u30c9\u306f\u3001\u30a2\u30c9\u30aa\u30f3\u30fb\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30e6\u30fc\u30c6\u30a3\u30ea\u30c6\u30a3\u306e\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u3067\u306f\u8a8d\u8b58\u3067\u304d\u307e\u305b\u3093\u3002
PACKAGING_SUNW_PKG_DIR_DOC=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u5834\u6240\u3092\u542b\u3080pkgadd\u306b\u3088\u308b\u5024\u306e\u30bb\u30c3\u30c8\u3002\u3053\u306e\u5024\u306f\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u30d1\u30c3\u30b1\u30fc\u30b8\u304c\u914d\u7f6e\u3055\u308c\u308b\u5834\u6240\u3092\u77e5\u308b\u5fc5\u8981\u304c\u3042\u308b\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6642\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fb\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306fpkginfo\u30d5\u30a1\u30a4\u30eb\u5185\u90e8\u304b\u3089\u624b\u52d5\u3067\u8a2d\u5b9a\u3057\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002
PACKAGING_SUNW_PKG_ALLZONES_DOC=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6642\u306b\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u304b\u3001\u304a\u3088\u3073\u3059\u3079\u3066\u306e\u30be\u30fc\u30f3\u3067\u540c\u3058\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308b\u304b\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u4ee3\u5165\u3055\u308c\u308b\u5024\u306fTrue\u307e\u305f\u306fFalse\u3067\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5024\u306fFalse\u3067\u3059\u3002SUNW_PKG_ALLZONES\u306e\u8a2d\u5b9a\u306f\u3001\u6b21\u306e\u5185\u5bb9\u306b\u5f71\u97ff\u3057\u307e\u3059\u3002\u8a73\u7d30\u306fman -s4 pkginfo\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_SUNW_PKG_HOLLOW_DOC=\u305d\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u304c\u5fc5\u8981\u3067\u3001\u3059\u3079\u3066\u306e\u30be\u30fc\u30f3\u5185\u3067\u540c\u4e00\u3067\u3042\u308b\u3053\u3068\u304c\u5fc5\u8981\u306a\u5834\u5408(\u305f\u3068\u3048\u3070\u3001SUNW_PKG_ALLZONES=true\u306e\u30d1\u30c3\u30b1\u30fc\u30b8)\u3001\u30b0\u30ed\u30fc\u30d0\u30eb\u4ee5\u5916\u306e\u30be\u30fc\u30f3\u3067\u8868\u793a\u53ef\u80fd\u304b\u3069\u3046\u304b\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u4ee3\u5165\u3055\u308c\u308b\u5024\u306fTrue\u307e\u305f\u306fFalse\u3067\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5024\u306fFalse\u3067\u3059\u3002\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306f\u5fc5\u9808\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u305f\u5834\u5408\u3001SUNW_PKG_HOLLOW\u306e\u8a2d\u5b9a\u306f\u6b21\u306b\u8aac\u660e\u3059\u308b\u4e8b\u9805\u306b\u5f71\u97ff\u3057\u307e\u3059\u3002\u8a73\u7d30\u306fman -s4 pkginfo\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_SUNW_PKG_THISZONE_DOC=\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u73fe\u5728\u306e\u30be\u30fc\u30f3\u306b\u306e\u307f\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u4ee3\u5165\u3055\u308c\u308b\u5024\u306fTrue\u307e\u305f\u306fFalse\u3067\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5024\u306fFalse\u3067\u3059\u3002SUNW_PKG_THISZONE\u306e\u8a2d\u5b9a\u306f\u3001\u6b21\u306e\u5185\u5bb9\u306b\u5f71\u97ff\u3057\u307e\u3059\u3002\u8a73\u7d30\u306fman -s4 pkginfo\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_SUNW_PKGLIST_DOC=\u6d3e\u751f\u5143\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306b\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3055\u308c\u305f\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u95a2\u9023\u4ed8\u3051\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u3001Solaris\u5c02\u7528\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u3002SUNW_LOC\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u5e38\u306b\u5fc5\u8981\u3067\u3059\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u5024\u306f\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u7701\u7565\u540d\u306e\u30ab\u30f3\u30de\u533a\u5207\u308a\u306e\u30ea\u30b9\u30c8\u3067\u3001SUNW_PKGLIST="pkg1[:version],pkg2[:version],..."\u306e\u5f62\u5f0f\u3067\u3059\u3002\u3053\u306eversion (\u6307\u5b9a\u3055\u308c\u305f\u5834\u5408)\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30d9\u30fc\u30b9\u30fb\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u6587\u5b57\u5217\u3068\u4e00\u81f4\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059(\u3053\u306e\u30de\u30cb\u30e5\u30a2\u30eb\u30fb\u30da\u30fc\u30b8\u306e\u300cVERSION\u30d1\u30e9\u30e1\u30fc\u30bf\u300d\u3092\u53c2\u7167)\u3002\u4f7f\u7528\u4e2d\u306e\u5834\u5408\u3001SUNW_PKGLIST\u306f\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u9806\u3092\u6c7a\u3081\u308b\u624b\u52a9\u3051\u3092\u3057\u307e\u3059\u3002\u30d1\u30e9\u30e1\u30fc\u30bf\u306b\u4e00\u89a7\u8868\u793a\u3055\u308c\u305f\u30d1\u30c3\u30b1\u30fc\u30b8\u306f\u3001\u554f\u984c\u306b\u306a\u3063\u3066\u3044\u308b\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3055\u308c\u305f\u30d1\u30c3\u30b1\u30fc\u30b8\u304c\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u308b\u524d\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3059\u3002\u7a7a\u767d\u306e\u307e\u307e\u306e\u5834\u5408(SUNW_PKGLIST="")\u3001\u30ed\u30b1\u30fc\u30eb\u304c\u6b63\u3057\u304f\u6a5f\u80fd\u3059\u308b\u305f\u3081\u306b\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u304c\u5fc5\u8981\u3067\u3042\u308b\u3053\u3068\u304c\u524d\u63d0\u3068\u306a\u308a\u307e\u3059\u3002\u8a73\u7d30\u306f\u3001packagetoc(4)\u306eSUNW_PKGLIST\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u30ad\u30fc\u30ef\u30fc\u30c9\u306f\u3001\u30a2\u30c9\u30aa\u30f3\u30fb\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30e6\u30fc\u30c6\u30a3\u30ea\u30c6\u30a3\u306e\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u3067\u306f\u8a8d\u8b58\u3067\u304d\u307e\u305b\u3093\u3002
PACKAGING_SUNW_PKGTYPE_DOC=Sun\u5185\u90e8\u306e\u307f\u3067\u4f7f\u7528\u3059\u308bSolaris\u5c02\u7528\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3002/\u3001/usr\u3001/usr/kvm\u3001\u304a\u3088\u3073/usr/openwin\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u308bSolaris\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u74b0\u5883\u30ea\u30ea\u30fc\u30b9\u306e\u4e00\u90e8\u3067\u3042\u308b\u30d1\u30c3\u30b1\u30fc\u30b8\u3067\u5fc5\u8981\u3067\u3059\u3002Solaris\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u74b0\u5883\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30fb\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306f\u3001\u30b5\u30fc\u30d0\u30fc/\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u69cb\u6210\u3092\u6b63\u3057\u304f\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u305f\u3081\u3001\u3069\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u304c\u3069\u306e\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u306e\u90e8\u5206\u3067\u3042\u308b\u304b\u3092\u628a\u63e1\u3057\u3066\u304a\u304f\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u73fe\u5728\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306b\u4f7f\u7528\u3067\u304d\u308b\u5024\u306f\u3001root\u3001usr\u3001kvm\u3001\u304a\u3088\u3073ow\u3067\u3059\u3002SUNW_PKGTYPE\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u3001\u305d\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306fBASEDIR=/opt\u3068\u63a8\u5b9a\u3055\u308c\u307e\u3059\u3002SUNW_PKGTYPE\u306f\u3001Solaris\u306e\u30a2\u30c9\u30aa\u30f3\u30fb\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306e\u5927\u90e8\u5206\u304c\u305d\u3046\u3067\u3042\u308b\u3088\u3046\u306b\u3001/opt\u540d\u524d\u7a7a\u9593\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u308b\u30d1\u30c3\u30b1\u30fc\u30b8\u3067\u306e\u307f\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u3059\u3002\u8a73\u7d30\u306f\u3001packagetoc(4)\u306eSUNW_PKGTYPE\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PACKAGING_SUNW_PKGVERS_DOC=Solaris\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u74b0\u5883\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u30fb\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u793a\u3059\u3001Solaris\u5c02\u7528\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3002SUNW_PKGVERS="<sunw_package_version>"\u3067\u3001<sunw_package_version>\u306fx.y[.z]\u306e\u5f62\u5f0f\u3092\u53d6\u308a\u3001x\u3001y\u3001\u304a\u3088\u3073z\u306f\u6574\u6570\u3067\u3059\u3002\u3053\u306e\u30ea\u30ea\u30fc\u30b9\u304a\u3088\u3073\u3053\u308c\u3088\u308a\u524d\u306e\u30ea\u30ea\u30fc\u30b9\u7528\u306b\u30d3\u30eb\u30c9\u3055\u308c\u305f\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u5834\u5408\u3001SUNW_PKGVERS="1.0"\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
PACKAGING_SUNW_PRODNAME_DOC=\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u304c\u4e00\u90e8\u3092\u69cb\u6210\u3059\u308b\u3001\u307e\u305f\u306f\u3053\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u304c\u542b\u307e\u308c\u308b\u88fd\u54c1\u540d\u3092\u793a\u3059Solaris\u5c02\u7528\u306e\u30d1\u30e9\u30e1\u30fc\u30bf(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002\u73fe\u5728\u4f7f\u7528\u3055\u308c\u3066\u3044\u308bSUNW_PRODNAME\u5024\u306e\u6570\u5c11\u306a\u3044\u4f8b\u306b\u306f\u3001"SunOS"\u3001"OpenWindows"\u3001\u304a\u3088\u3073"Common Desktop Environment"\u304c\u3042\u308a\u307e\u3059\u3002
PACKAGING_SUNW_PRODVERS_DOC=SUNW_PRODNAME\u306b\u8a18\u8f09\u3055\u308c\u3066\u3044\u308b\u88fd\u54c1\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u307e\u305f\u306f\u30ea\u30ea\u30fc\u30b9\u3092\u793a\u3059Solaris\u5c02\u7528\u306e\u30d1\u30e9\u30e1\u30fc\u30bf(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002\u305f\u3068\u3048\u3070\u3001SUNW_PRODNAME="SunOS"\u3067\u3001Solaris 2.x Beta\u30ea\u30ea\u30fc\u30b9\u306e\u5834\u5408\u3001\u3053\u306e\u6587\u5b57\u5217\u306f"5.x BETA"\u306b\u306a\u308a\u307e\u3059\u3002\u4e00\u65b9\u3001Solaris 2.x FCS\u30ea\u30ea\u30fc\u30b9\u306e\u5834\u5408\u3001\u6587\u5b57\u5217\u306f"5.x"\u306b\u306a\u308a\u307e\u3059\u3002Solaris 10\u306e\u5834\u5408\u3001\u6587\u5b57\u5217\u306f"5.10"\u3067\u3059\u3002SUNW_PRODNAME\u30d1\u30e9\u30e1\u30fc\u30bf\u304cNULL\u306e\u5834\u5408\u3001SUNW_PRODVERS\u30d1\u30e9\u30e1\u30fc\u30bf\u3082\u540c\u69d8\u306b\u306a\u308a\u307e\u3059\u3002
PACKAGING_ULIMIT_DOC=\u8a2d\u5b9a\u3055\u308c\u305f\u5834\u5408\u3001\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306f\u5f15\u6570\u3068\u3057\u3066ulimit(1)\u30b3\u30de\u30f3\u30c9\u306b\u6e21\u3055\u308c\u307e\u3059(limit(1)\u3092\u53c2\u7167)\u3002\u3053\u308c\u306f\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u4e2d\u306e\u30d5\u30a1\u30a4\u30eb\u306e\u6700\u5927\u30b5\u30a4\u30ba\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
PACKAGING_VENDOR_DOC=\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306e\u30b3\u30d4\u30fc\u30e9\u30a4\u30c8\u3092\u6301\u3064\u30d9\u30f3\u30c0\u30fc\u3092\u7279\u5b9a\u3059\u308b\u306e\u306b\u4f7f\u7528\u3057\u307e\u3059(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002
PACKAGING_VSTOCK_DOC=\u3042\u308b\u5834\u5408\u3001\u3053\u306e\u88fd\u54c1\u3092\u7279\u5b9a\u3059\u308b\u30d9\u30f3\u30c0\u30fc\u306e\u30b9\u30c8\u30c3\u30af\u756a\u53f7(\u6700\u5927\u9577\u306f256 ASCII\u6587\u5b57)\u3002

PackagingNewEntryPanel.entryLabel.text=\u540d\u524d(&N):
PackagingNewEntryPanel.valueLabel.text=\u5024(&V):
PackagingFilesOuterPanel.filePermLabel.text=\u901a\u5e38\u30d5\u30a1\u30a4\u30eb(&I):
PackagingFilesOuterPanel.ownerLabel.text=\u6240\u6709\u8005(&W):
PackagingFilesOuterPanel.groupLabel.text=\u30b0\u30eb\u30fc\u30d7(&G):
PackagingFilesOuterPanel.defaultValues.text=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30d5\u30a1\u30a4\u30eb\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3(\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u8ffd\u52a0\u3059\u308b\u3068\u304d\u306b\u4f7f\u7528):
PackagingFilesOuterPanel.exePermLabel.text=exe\u30d5\u30a1\u30a4\u30eb(&X):
PackagingFilesOuterPanel.topDirectoryLabel.text=\u6700\u4e0a\u4f4d\u30c7\u30a3\u30ec\u30af\u30c8\u30ea(&O):
PackagingFilesOuterPanel.column.0.text=\u30bf\u30a4\u30d7
PackagingFilesOuterPanel.column.1.text=\u30d1\u30c3\u30b1\u30fc\u30b8\u5185\u3067\u306e\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d1\u30b9
PackagingFilesOuterPanel.column.2.text=\u5143\u306e\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30ea\u30f3\u30af
PackagingFilesOuterPanel.column.3.text=\u8a31\u53ef
PackagingFilesOuterPanel.column.4.text=\u6240\u6709\u8005
PackagingFilesOuterPanel.column.5.text=\u30b0\u30eb\u30fc\u30d7
FileChooserFileTitle=\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u8ffd\u52a0
FileChooserFilesTitle=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30d5\u30a1\u30a4\u30eb\u3092\u8ffd\u52a0
FileChooserButtonText=\u9078\u629e
PackagingInfoPanel.column.0.text=\u540d\u524d
PackagingInfoPanel.column.1.text=\u5024
AddNewParameterDialogTitle=\u65b0\u898f\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u8ffd\u52a0
PackagingAddingFilesProgressPanel.Stop.Button.text=\u505c\u6b62

PackagingAddingFilesProgressPanel.title=\u30d5\u30a1\u30a4\u30eb\u306e\u8ffd\u52a0\u4e2d...

# PackagingPanel
InfoPanelText=\u60c5\u5831
FilePanelText=\u30d5\u30a1\u30a4\u30eb

# PackagingNodeProp
FilesTextZero=0\u30d5\u30a1\u30a4\u30eb
FilesTextOne={0}\u30d5\u30a1\u30a4\u30eb: {1}
FilesTextMany={0}\u30d5\u30a1\u30a4\u30eb: {1}
PackagingPanel.tabbedPane.AccessibleContext.accessibleName=\u30d5\u30a1\u30a4\u30eb\u304a\u3088\u3073\u60c5\u5831\u30d1\u30cd\u30eb
PackagingPanel.tabbedPane.AccessibleContext.accessibleDescription=\u30d5\u30a1\u30a4\u30eb\u304a\u3088\u3073\u60c5\u5831\u30d1\u30cd\u30eb
PackagingInfoOuterPanel.docTextArea.AccessibleContext.accessibleName=DocArea
PackagingInfoOuterPanel.docTextArea.AccessibleContext.accessibleDescription=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u9818\u57df
PackagingNewEntryPanel.docArea.AccessibleContext.accessibleName=DocArea
PackagingNewEntryPanel.docArea.AccessibleContext.accessibleDescription=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u9818\u57df
PackagingNewEntryPanel.entryComboBox.AccessibleContext.accessibleName=ParameterComboBox
PackagingNewEntryPanel.entryComboBox.AccessibleContext.accessibleDescription=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fb\u30c1\u30e5\u30fc\u30b6
PackagingNewEntryPanel.entryValueTextField.AccessibleContext.accessibleDescription=\u30d1\u30e9\u30e1\u30fc\u30bf\u5024
PackagingFilesOuterPanel.topDirectoryTextField.AccessibleContext.accessibleDescription=\u6700\u4e0a\u4f4d\u30c7\u30a3\u30ec\u30af\u30c8\u30ea
PackagingFilesOuterPanel.exePermTextField.AccessibleContext.accessibleDescription=\u5b9f\u884c\u6a29
PackagingFilesOuterPanel.filePermTextField.AccessibleContext.accessibleDescription=\u30d5\u30a1\u30a4\u30eb\u8a31\u53ef
PackagingFilesOuterPanel.ownerTextField.AccessibleContext.accessibleDescription=\u30d5\u30a1\u30a4\u30eb\u6240\u6709\u8005
PackagingFilesOuterPanel.groupTextField.AccessibleContext.accessibleDescription=\u30d5\u30a1\u30a4\u30eb\u30fb\u30b0\u30eb\u30fc\u30d7
PackagingNewLinkPanel.nameLabel.text=\u30ea\u30f3\u30af\u306e\u540d\u524d(&N):



PackagingNewLinkPanel.link.text=\u30ea\u30f3\u30af\u5148(&W):
PackagingNewLinkPanel.nameTextField.AccessibleContext.accessibleDescription=\u30ea\u30f3\u30af\u306e\u540d\u524d
PackagingNewLinkPanel.linkTextField.AccessibleContext.accessibleDescription=\u30ea\u30f3\u30af\u30fb\u30bf\u30fc\u30b2\u30c3\u30c8
PackagingAddingFilesProgressPanel.fileLabel.text=\u8ffd\u52a0\u3055\u308c\u308b\u30d5\u30a1\u30a4\u30eb:
PackagingAddingFilesProgressPanel.fileTextField.AccessibleContext.accessibleDescription=\u8ffd\u52a0\u4e2d\u306e\u30d5\u30a1\u30a4\u30eb
PackagingAddingFilesProgressPanel.AccessibleContext.accessibleName=ProgressPanel
PackagingAddingFilesProgressPanel.AccessibleContext.accessibleDescription=\u9032\u6357\u30d1\u30cd\u30eb
PackagingAddingFilesProgressPanel.progressBar.AccessibleContext.accessibleName=ProgressBar
PackagingAddingFilesProgressPanel.progressBar.AccessibleContext.accessibleDescription=\u9032\u6357\u30d0\u30fc
PackagingFilesOuterPanel.jLabel4.text=\u6240\u6709\u8005\u304a\u3088\u3073\u30b0\u30eb\u30fc\u30d7









PackagingFilesOuterPanel.filePermTextField.AccessibleContext.accessibleName=\u901a\u5e38\u30d5\u30a1\u30a4\u30eb\u306e\u5b9f\u884c\u6a29
PackagingFilesOuterPanel.exePermTextField.AccessibleContext.accessibleName=exe\u30d5\u30a1\u30a4\u30eb\u306e\u5b9f\u884c\u6a29

# AdditionalInfoPanel
AdditionalInfoLabel_txt=\u8ffd\u52a0\u60c5\u5831:

ADD_DIALOG_LABEL_TXT=\u8ffd\u52a0\u60c5\u5831
ADD_BUTTON_LBL=\u65b0\u898f

REMOVE_BUTTON_LBL=\u9664\u53bb

UP_BUTTON_LBL=\u4e0a

DOWN_BUTTON_LBL=\u4e0b

ProjectPropPanel.seeAlsoLabel.text=(\u300c\u30aa\u30d7\u30b7\u30e7\u30f3\u300d>\u300c\u305d\u306e\u4ed6\u300d>\u300c\u30d5\u30a1\u30a4\u30eb\u300d\u3067IDE\u30ec\u30d9\u30eb\u306e\u30d5\u30a1\u30a4\u30eb\u30fb\u30d5\u30a3\u30eb\u30bf\u3082\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044)
ProjectPropPanel.ignoreFoldersLabel.text=\u7121\u8996\u3055\u308c\u308b\u30d5\u30a9\u30eb\u30c0\u306e\u30d1\u30bf\u30fc\u30f3:

ProjectPropPanel.ignoreFoldersDefaultButton.text=\u30c7\u30d5\u30a9\u30eb\u30c8(&F)

ProjectPropPanel.incorrectRegEx=\u30d5\u30a9\u30eb\u30c0\u30fb\u30d1\u30bf\u30fc\u30f3\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093:\n {0}\n\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306b\u623b\u3057\u307e\u3059\u3002

#CompilerSetEditorCustomizer
CompilerSetEditorCustomizerTitile=\u30c4\u30fc\u30eb\u30fb\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3 - {0}

RemoteSyncFactoryTxt=\u30bd\u30fc\u30b9
RemoteSyncFactoryNoFactory=\u30ed\u30fc\u30ab\u30eb(\u540c\u671f\u306a\u3057)
RemoteSyncFactoryHint=\u30ea\u30e2\u30fc\u30c8\u30fb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5834\u5408\u306f\u3001\u30ed\u30fc\u30ab\u30eb\u3001\u30ea\u30e2\u30fc\u30c8\u3001\u307e\u305f\u306f\u5171\u6709\u306e\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u5834\u6240\u3092\u6307\u5b9a\u3057\u307e\u3059

default_cs=\u30c7\u30d5\u30a9\u30eb\u30c8
PkgConfigLibrary.label.text=PkgConfig\u30e9\u30a4\u30d6\u30e9\u30ea(&P):
PkgConfigLibrary.filterLabel.text=\u30d5\u30a3\u30eb\u30bf(&F):
PkgConfigLibrary.tooltip.text=<html>{0}<br>\u30d0\u30fc\u30b8\u30e7\u30f3: {1}<br>\u30e9\u30a4\u30d6\u30e9\u30ea: {2}
Init_PkgConfigLibrary_List=\u30e9\u30a4\u30d6\u30e9\u30ea\u30fb\u30ea\u30b9\u30c8\u3092\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059...
Error_PkgConfigLibrary_List=\u30db\u30b9\u30c8\u306f\u4f7f\u7528\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093
PkgConfigLibrary_CTL_Cancel=\u53d6\u6d88
PkgConfigLibrary_CTL_OK=OK

FormattingPropPanel.cLabel.text=C\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u30fb\u30b9\u30bf\u30a4\u30eb(&C):
FormattingPropPanel.cppLabel.text=C++\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u30fb\u30b9\u30bf\u30a4\u30eb(&F):
FormattingPropPanel.headerLabel.text=C/C++\u30d8\u30c3\u30c0\u30fc\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u30fb\u30b9\u30bf\u30a4\u30eb(&S):
FormattingPropPanel.globalRadioButton.text=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u30fb\u30b9\u30bf\u30a4\u30eb\u3092\u4f7f\u7528(&G)
FormattingPropPanel.projectRadioButton.text=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u72ec\u81ea\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u30fb\u30b9\u30bf\u30a4\u30eb\u3092\u4f7f\u7528(&P)

#State Code Assistance
CodeAssistanceItem_ParsedSource=\u89e3\u6790\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb
CodeAssistanceItem_ExtraParsedSource=\u8ffd\u52a0\u89e3\u6790\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb
CodeAssistanceItem_ParsedOrphanHeader=\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306a\u3057\u306e\u30d8\u30c3\u30c0\u30fc\u89e3\u6790
CodeAssistanceItem_IncludedHeader=\u30d8\u30c3\u30c0\u30fc\u30fb\u30d5\u30a1\u30a4\u30eb\u3068\u3057\u3066\u542b\u3081\u3089\u308c\u308b
CodeAssistanceItem_ExcludedSource=\u672a\u89e3\u6790\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb
CodeAssistanceItem_ExcludedHeader=\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb\u306b\u3088\u3063\u3066\u542b\u3081\u3089\u308c\u306a\u3044\u30d8\u30c3\u30c0\u30fc
CodeAssistanceItem_NotYetParsed=\u672a\u89e3\u6790\u30d5\u30a1\u30a4\u30eb
MacroExpandedEditorPanel.previewLabel.text=\u30d7\u30ec\u30d3\u30e5\u30fc:

#Platform specific configuration
PlatformSpecificFalse=\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u306b\u4f9d\u5b58\u3057\u306a\u3044\u69cb\u6210
PlatformSpecificTrue={0}\u306e\u69cb\u6210

