# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.

OpenIDE-Module-Display-Category=Servizos web
OpenIDE-Module-Long-Description=Declaraci\u00f3n dos servizos web StrikeIron como compo\u00f1entes dos servizos web RESTfull
OpenIDE-Module-Name=Servizos StrikeIron

OpenIDE-Module-Short-Description=Compo\u00f1ente de servizo StrikeIron
#StrikeIron_Name=StrikeIron

AddressVerification40_Name=Verificaci\u00f3n de enderezo 40
EmailVerify30_Name=Verificaci\u00f3n de correo electr\u00f3nico 30
IPAddressLookup_Name=Busca de enderezo IP
ReversePhoneLookup_Name=Busca inversa de tel\u00e9fono
SalesandUseTaxComplete40_Name=Completado de impostos 40
ZipCode_Name=C\u00f3digo postal

AddressVerification40_Desc=<html>O servizo web inspecciona cada elemento do enderezo para asegurar a s\u00faa validez e, <br/>empregando unha tecnolox\u00eda de coincidencia e estandarizaci\u00f3n de datos sofisticada, actualiza <br/> os enderezos incorrectos de acordo a os requerimentos postais. Strikelron inspecciona os n\u00fameros <br/>de casa, enderezos da calle, n\u00fameros de apartamentos e <br/>apartados postais para asegurarse a exactitude de cada elemento e estandariza o enderezo <br/>de acordo \u00e1s regras da autoridade postal. StrikeIron tam\u00e9n corrixe os erros de escritura<br/> nos nomes de calles , valida as extensi\u00f3ns de tipo de calles<br/> e os nomes de estado, adem\u00e1is engade as abreviaturas de estado que falten. O servizo web pode ser <br/>invocado con un \u00fanico enderezo ou como un proceso en lote.</html>

EmailVerify30_Desc=<html>O servizo web de verificaci\u00f3n de Email StrikeIron determina instantaneamente a validez dun enderezo <br/>  de correo electr\u00f3nico ou o seu dominio. Simplemente proporci\u00f3nelle un enderezo de correo e o servizo web <br/>  devolver\u00e1 verdadeiro ou falso contactando cos servidores SMTP para validar <br/> un enderezo sen enviar un correo electr\u00f3nico. </html>

IPAddressLookup_Desc=<html>Este servizo web devolve un enderezo IP cando se lle proporciona un nome de un servidor web. <br/> Por exemplo, www.usc.es deber\u00eda voltar 193.144.75.244 </html>

ReversePhoneLookup_Desc=<html>A busca de tel\u00e9fono inversa: O servizo web de exactitude do d\u00eda 90 fornece unha interface de programaci\u00f3n <br/> para os datos de nome e enderezo asociados a calquera n\u00famero de tel\u00e9fono. Actualizado nocturnamente, <br/> e a s\u00faa exactitude refl\u00edctese nos 90 d\u00edas posteriores dos cambios.</html></html>

SalesandUseTaxComplete40_Desc=<html>Os servizos web de Sistema de vendas de datos de impostos e Impostos de uso de Strikelton fornecen unha interface de programaci\u00f3n a <br/>vendas en vivo e datos de impostos de uso. Simplemente forneza un c\u00f3digo postal de Estados Unidos ou Canad\u00e1<br/>e coincidir\u00e1 automaticamente coas ventas reais e niveis de \u00edndice de impostos<br/>para o estado, pa\u00eds, cidade, MTA, SPD e m\u00e1is. O dato de imposto env\u00edase despois <br/> mediante un servizo web XML directamente a calquera aplicativo, plataforma, <br/>produto, ou sitio web.</html>

ZipCode_Desc=<html>O servizo web ZIP Code Information de StrikeIron obt\u00e9n de forma instant\u00e1nea a cidade, estado, pa\u00eds, latitude, <br/> e a zona horaria para un c\u00f3digo postal de Estados Unidos e Canad\u00e1.</html>

