# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder.
#
# Contributor(s):
#
# Portions Copyrighted 2008 Sun Microsystems, Inc.

ERR_Project_validation=Proyecto de validaci\u00f3n del modelo fallo.

ERR_SystemScope=Un 'system' \u00e1mbito de dependencia no se encontr\u00f3. C\u00f3digo de finalizaci\u00f3n se ve afectada. 

MSG_SystemScope=Hay una'system' alcance de dependencia en el proyecto, pero la ruta de acceso al binario no es v\u00e1lido.\nPor favor, compruebe que la ruta es absoluta y los puntos para un binario.

ERR_NonLocal=Algunos artefactos de dependencia no est\u00e1 en el repositorio local.

MSG_NonLocal=Su proyecto tiene dependencias que no se resuelven a nivel local. C\u00f3digo en el IDE no incluir\u00e1 las clases de estas dependencias o sus dependencias transitivo (a menos que se encuentran entre los proyectos abiertos).\nPor favor, descargue el sistema de dependencias, o instalelo manualmente, si no se dispone de forma remota.\n\nLos artefactos son\:\n {0}

ERR_NoParent=Padres de archivo POM no es accesible. Proyecto podr\u00eda estar indebidamente configurado.

MSG_NoParent=El padre POM con id {0} no se ha encontrado en las fuentes o repositorio local. Por favor, compruebe que <relativePath> etiqueta est\u00e1 presente y correcto, la versi\u00f3n de los padres en el POM fuentes coincide con la versi\u00f3n definida. \nSi los padres se encuentra disponible \u00fanicamente a trav\u00e9s de un repositorio remoto, compruebe que el repositorio de alojamiento que se define en el POM.

ACT_OpenPom=Abrir pom.xml

LBL_Problems=%Problemas\:

LBL_Description=&Descripci\u00f3n\:

BTN_Correct=Correcto

ACT_DownloadDeps=Download Dependencies

ERR_MissingJ2eeModule=Modulo soporte Maven J2EE esta desaparecido
MSG_MissingJ2eeModule=Falta el soporte para el m\u00f3dulo Maven  J2EE en su instalaci\u00f3n. Esto significa que toda la funcionalidad relacionada a J2EE (por ejemplo, Despliegue, plantilla de archivos) est\u00e1 faltando. La causa m\u00e1s probable es que parte del apoyo general J2EE falta. Vaya a Herramientas / Complementos e instale el complemento relacionado a J2EE.

ERR_MissingApisupportModule=Falta el m\u00f3dulo de apoyo Maven NetBeans Development
MSG_MissingApisupportModule=Le falta el m\u00f3dulo soporte Maven en su instalaci\u00f3n. This means that all NetBeans development related functionality (for example, File templates, running platform application) is missing. The most probable cause is that part of the general API support is missing as well. Please go to Tools/Plugins and install the plugins related to NetBeans development.

ACT_validate=Revalidate

